{
  "Дәріс 1. Кіріспе": [
    {
      "kk": "Ақпарат",
      "ru": "Информация",
      "en": "Information",
      "definition": {
        "kk": "Ақпарат — қоршаған орта туралы мәлімет.",
        "ru": "Информация — сведения об окружающем мире.",
        "en": "Information is data about the surrounding environment."
      },
      "example": {
        "kk": "Ақпарат компьютер арқылы беріледі.",
        "ru": "Информация передаётся через компьютер.",
        "en": "Information is transmitted via computer."
      },
      "relations": {
        "synonyms": ["Дерек", "Мәлімет"],
        "broader_term": "Ақпараттық технологиялар",
        "narrower_terms": ["Деректер", "Білім"],
        "related_terms": ["Цифрландыру", "Ақпаратты өңдеу"]
  },
      "image": "",
      "source": "https://kk.wikipedia.org/wiki/Ақпарат"
    },
    {
      "kk": "Ақпараттық технологиялар",
      "ru": "Информационные технологии",
      "en": "Information Technology",
      "definition": {
        "kk": "Ақпаратты жинау, өңдеу, сақтау және тарату үшін қолданылатын технологиялар жиынтығы.",
        "ru": "Совокупность технологий для сбора, обработки, хранения и передачи информации.",
        "en": "Technologies used for collecting, processing, storing, and transmitting information."
      },
      "example": {
        "kk": "Ақпараттық технологиялар білім беру саласында кеңінен қолданылады.",
        "ru": "Информационные технологии широко применяются в сфере образования.",
        "en": "Information technologies are widely used in education."
      },
            "image": "",
      "source": "https://kk.wikipedia.org/wiki/Ақпараттық_технология"
    },
    {
      "kk": "Ақпараттық-коммуникациялық технологиялар (АКТ)",
      "ru": "Информационно-коммуникационные технологии (ИКТ)",
      "en": "ICT",
      "definition": {
        "kk": "Ақпараттық-коммуникациялық технологиялар — ақпарат пен байланыс технологияларының жиынтығы.",
        "ru": "Информационно-коммуникационные технологии — совокупность технологий связи и обработки информации.",
        "en": "ICT is the combination of communication and information technologies."
      },
      "example": {
        "kk": "АКТ білім беруде маңызды рөл атқарады.",
        "ru": "ИКТ играют важную роль в образовании.",
        "en": "ICT plays an important role in education."
      },
      "image": "",
      "source": "https://kk.wikipedia.org/wiki/Ақпараттық-коммуникациялық_технологиялар"
    },
    
    {
      "kk": "Стандарт",
      "ru": "Стандарт",
      "en": "Standard",
      "definition": {
        "kk": "Стандарт — белгілі бір салада келісілген ережелер жиынтығы.",
        "ru": "Стандарт — набор согласованных правил в определённой области.",
        "en": "Standard is a set of agreed rules in a specific field."
      },
      "example": {
        "kk": "ISO стандарттары халықаралық деңгейде қолданылады.",
        "ru": "Стандарты ISO используются на международном уровне.",
        "en": "ISO standards are used internationally."
      },
      "image": "",
      "source": "https://kk.wikipedia.org/wiki/Стандарт"
    },
    {
  "kk": "Информатика",
  "ru": "Информатика",
  "en": "Computer science",
  "definition": {
    "kk": "Информатика – компьютерлер мен ақпараттық жүйелерді пайдалана отырып, ақпаратты өңдеу, сақтау және тасымалдау әдістерін зерттейтін ғылым.",
    "ru": "Информатика — это наука, изучающая методы обработки, хранения и передачи информации с использованием компьютеров и информационных систем.",
    "en": "Computer Science is the study of methods for processing, storing, and transmitting information using computers and information systems."
  },
  "example": {
    "kk": "Мысалы, информатика пәнінде алгоритмдер мен бағдарламалау негіздері оқытылады.",
    "ru": "Например, на уроках информатики изучаются алгоритмы и основы программирования.",
    "en": "For example, computer science courses cover algorithms and the fundamentals of programming."
  },
  "relations": {
    "synonyms": ["компьютерлік ғылым"],
    "homonyms": [],
    "general_concept": {
      "kk": "Информатика – ақпаратты өңдеу, сақтау және тарату процестерін, сондай-ақ адам мен компьютер арасындағы өзара әрекеттесуді зерттейтін ғылым.",
      "ru": "Информатика — это наука, изучающая процессы обработки, хранения и передачи информации, а также взаимодействие человека и компьютера.",
      "en": "Computer Science is the study of the processes involved in processing, storing, and transmitting information, as well as the interaction between humans and computers."
    },
    "specific_concepts": {
      "kk": ["бағдарламалау", "алгоритмдер", "мәліметтер құрылымы"],
      "ru": ["программирование", "алгоритмы", "структуры данных"],
      "en": ["programming", "algorithms", "data structures"]
    },
    "associative": {
      "kk": ["жасанды интеллект", "инновация", "компьютерлер", "цифрлық әлем"],
      "ru": ["искусственный интеллект", "инновации", "компьютеры", "цифровой мир"],
      "en": ["artificial intelligence", "innovation", "computers", "digital world"]
    }
  }
},
{
  "kk": "Компьютермен жұмыс дағдылары (КД)",
  "ru": "Компьютерные навыки (КН)",
  "en": "Computer Skills (CS)",
  "definition": {
    "kk": "Компьютермен жұмыс дағдылары – бұл компьютерді тиімді пайдалану, ақпаратпен жұмыс істеу және цифрлық құралдар арқылы коммуникация жүргізу үшін қажетті білім мен дағдылар жиынтығы.",
    "ru": "Компьютерные навыки — это совокупность знаний и умений, необходимых для эффективного использования компьютера, работы с информацией и коммуникации с помощью цифровых инструментов.",
    "en": "Computer skills are the set of knowledge and abilities required to effectively use a computer, work with information, and communicate via digital tools."
  },
  "example": {
    "kk": "Мысалы, мәтіндік редакторларды пайдалану, электрондық пошта арқылы байланысу және интернетте ақпарат іздеу.",
    "ru": "Например, использование текстовых редакторов, общение через электронную почту и поиск информации в интернете.",
    "en": "For instance, using word processors, communicating via email, and searching for information on the internet."
  },   
      "image": "",
      "source": ""
    },
    {
  "kk": "Конвергенция",
  "ru": "Конвергенция",
  "en": "Convergence",
  "definition": {
    "kk": "Конвергенция – бұл әртүрлі элементтердің немесе технологиялардың біріккен немесе бір-біріне жақындаған күйі, олардың функциялары мен ерекшеліктері біртұтас жүйеде үйлесімді түрде жұмыс істеуін қамтамасыз етеді.",
    "ru": "Конвергенция – это состояние или процесс сближения различных элементов или технологий, в результате которого их функции и особенности интегрируются в единую систему.",
    "en": "Convergence is a state or process in which different elements or technologies come together or become increasingly alike, integrating their functions into a unified system."
  },
  "example": {
    "kk": "Мысалы, қазіргі заманғы смартфондарда компьютерлік, телефондық және мультимедиялық функциялардың конвергенциясы байқалады.",
    "ru": "Например, современные смартфоны демонстрируют конвергенцию компьютерных, телефонных и мультимедийных функций.",
    "en": "For example, modern smartphones exhibit convergence of computing, telecommunication, and multimedia features."
  },
  "relations": {
    "synonyms": [
      "интеграция",
      "слияние"
    ],
    "homonyms": [],
    "general_concept": {
      "kk": "Конвергенция ұғымы әртүрлі элементтердің немесе жүйелердің біртұтас құрылымға бірігуін сипаттайды.",
      "ru": "Конвергенция описывает процесс объединения различных элементов или систем в единую конструкцию.",
      "en": "Convergence describes the process of uniting different elements or systems into a single cohesive structure."
    },
    "specific_concepts": {
      "kk": [
        "технологиялық конвергенция",
        "коммуникациялық конвергенция"
      ],
      "ru": [
        "технологическая конвергенция",
        "коммуникационная конвергенция"
      ],
      "en": [
        "technological convergence",
        "communication convergence"
      ]
    },
    "associative": {
      "kk": [
        "инновация",
        "синергия",
        "интеграция",
        "коммуникация"
      ],
      "ru": [
        "инновация",
        "синергия",
        "интеграция",
        "коммуникация"
      ],
      "en": [
        "innovation",
        "synergy",
        "integration",
        "communication"
      ]
    }
  }
},
    {
      "kk": "Цифрландыру",
      "ru": "Цифровизация",
      "en": "Digitalization",
      "definition": {
        "kk": "Цифрландыру — ақпаратты сандық форматқа көшіру процесі.",
        "ru": "Цифровизация — процесс перевода информации в цифровой формат.",
        "en": "Digitalization is the process of converting information into a digital format."
      },
      "example": {
        "kk": "Мемлекеттік қызметтер цифрландырылып жатыр.",
        "ru": "Государственные услуги оцифровываются.",
        "en": "Public services are being digitalized."
      },
      "image": "",
      "source": "https://kk.wikipedia.org/wiki/Цифрландыру"
    }
  ],
  "Дәріс 2. Компьютер архитектурасы": [
        {
  "kk": "Компьютер",
  "ru": "Компьютер",
  "en": "Computer",
  "definition": {
    "kk": "Компьютер — ақпаратты автоматты түрде өңдейтін электронды құрылғы.",
    "ru": "Компьютер — электронное устройство для автоматической обработки информации.",
    "en": "A computer is an electronic device for automatic information processing."
  },
  "example": {
    "kk": "Компьютер деректерді жылдам өңдейді.",
    "ru": "Компьютер быстро обрабатывает данные.",
    "en": "The computer processes data quickly."
  },
  "relations": {
    "synonyms": ["ЭЕМ"],
    "broader_term": "Ақпараттық құрылғылар",
    "narrower_terms": ["Ноутбук", "Жұмыс үстелі компьютері"],
    "related_terms": ["Процессор", "Жад", "ОЖ"]
  },
  "source": "https://kk.wikipedia.org/wiki/Компьютер"
},
    {
  "kk": "Компьютер архитектурасы",
  "ru": "Компьютерная архитекттура",
  "en": "Computer Architecture",
  "definition": {
    "kk": "Компьютер архитектурасы – бұл компьютердің құрылымын, негізгі компоненттерін және олардың өзара байланысын зерттейтін ғылым. Ол жүйенің өнімділігін, функционалдығын және жұмыс принциптерін анықтайды.",
    "ru": "Компьютерная архитектура – это наука, изучающая структуру компьютера, его основные компоненты и взаимосвязи, определяющие производительность, функциональность и принципы работы системы.",
    "en": "Computer architecture is the study of the structure of computers, their core components, and interconnections that determine system performance, functionality, and operational principles."
  },
  "example": {
    "kk": "Мысалы, процессор, оперативті жады және сақтау құрылғылары арасындағы үйлесімді жұмыс компьютер архитектурасының негізін құрайды.",
    "ru": "Например, слаженная работа процессора, оперативной памяти и устройств хранения данных является основой компьютерной архитектуры.",
    "en": "For example, the coordinated operation of the CPU, RAM, and storage devices is fundamental to computer architecture."
  },
  "relations": {
    "synonyms": [
      "компьютерлік құрылым",
      "системелік архитектура"
    ],
    "homonyms": [],
    "general_concept": {
      "kk": "Компьютер архитектурасы компьютердің жұмыс істеу принциптері мен ішкі құрылымын түсіндіреді.",
      "ru": "Компьютерная архитектура описывает принцип работы и внутреннюю структуру компьютера.",
      "en": "Computer architecture explains the operational principles and internal structure of a computer."
    },
    "specific_concepts": {
      "kk": [
        "процессор архитектурасы",
        "жады архитектурасы",
        "жеткізу шиналарының архитектурасы"
      ],
      "ru": [
        "архитектура процессора",
        "архитектура памяти",
        "архитектура шин"
      ],
      "en": [
        "processor architecture",
        "memory architecture",
        "bus architecture"
      ]
    },
    "associative": {
      "kk": [
        "жүйелік дизайн",
        "инновация",
        "технология",
        "дигитал трансформация"
      ],
      "ru": [
        "системный дизайн",
        "инновации",
        "технологии",
        "цифровая трансформация"
      ],
      "en": [
        "system design",
        "innovation",
        "technology",
        "digital transformation"
      ]
    }
  },
      
      "image": "https://drive.google.com/file/d/1Z8GgYCcEjFyHWWEYsTPvGRnMbHbXV87O/view?usp=sharing",
      "source": ""
},
{
      "kk": "Басқару құрылғысы",
      "ru": "Устройство управления",
      "en": "Control Unit",
      "definition": {
        "kk": "Басқару құрылғысы — компьютердің түрлі компоненттерінің жұмысын үйлестіретін және командаларды орындауды басқаратын негізгі бөлім.",
        "ru": "Устройство управления — это основная часть компьютера, координирующая работу различных компонентов и управляющая выполнением команд.",
        "en": "The control unit is the central component of a computer that orchestrates the functioning of its various parts and manages the execution of commands."
      },
      "example": {
        "kk": "Басқару құрылғысы командаларды интерпретациялап, оларды процессорға жібереді.",
        "ru": "Устройство управления интерпретирует команды и отправляет их в процессор.",
        "en": "The control unit interprets instructions and sends them to the processor."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Екілік код",
      "ru": "Двоичный код",
      "en": "Binary Code",
      "definition": {
        "kk": "Екілік код – компьютерлік жүйелерде ақпаратты сақтау, өңдеу және тасымалдау үшін қолданылатын негізгі кодтау жүйесі. Ол екі таңбадан, яғни 0 және 1-ден тұрады.",
        "ru": "Двоичный код – основная система кодирования для хранения, обработки и передачи информации в компьютерных системах. Она использует два символа: 0 и 1.",
        "en": "Binary code is the fundamental encoding system used for storing, processing, and transmitting information in computer systems. It is composed of two symbols: 0 and 1."
      },
      "example": {
        "kk": "Мысалы, ондық сан 5 екілік түрде «101» деп жазылады.",
        "ru": "Например, десятичное число 5 записывается в двоичном виде как «101».",
        "en": "For example, the decimal number 5 is represented in binary as \"101\"."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Регистр",
      "ru": "Регистр",
      "en": "Register",
      "definition": {
        "kk": "Регистр – процессордың ішіндегі кішігірім, бірақ өте жылдам жады, ол есептеулер мен операциялар кезінде уақытша мәліметтерді сақтайды.",
        "ru": "Регистр – небольшая, но очень быстрая область памяти внутри процессора, которая временно хранит данные во время выполнения операций.",
        "en": "A register is a small but very fast memory area within the processor that temporarily stores data during computations."
      },
      "example": {
        "kk": "Мысалы, процессор арифметикалық операциялар кезінде регистрлерді пайдаланады.",
        "ru": "Например, процессор использует регистры во время арифметических операций.",
        "en": "For example, the processor utilizes registers during arithmetic operations."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Процессор",
      "ru": "Процессор",
      "en": "Processor",
      "definition": {
        "kk": "Компьютердің негізгі есептеу элементі.",
        "ru": "Основной вычислительный элемент компьютера.",
        "en": "The main computing element of a computer."
      },
      "example": {
        "kk": "Процессор бағдарламаларды орындау үшін қолданылады.",
        "ru": "Процессор используется для выполнения программ.",
        "en": "The processor is used to execute programs."
      },
      "image": "https://drive.google.com/file/d/1YOYRiENrynsYcSJAMkbccQIB-NE2sq0-/view?usp=sharing",
      "source": ""
    },
    {
      "kk": "Арифметикалық-логикалық құрылғы",
      "ru": "Арифметико-логическое устройство",
      "en": "Arithmetic Logic Unit",
      "definition": {
        "kk": "Арифметикалық-логикалық құрылғы – процессордың негізгі бөліктерінің бірі, ол арифметикалық (қосу, алу, көбейту, бөлу) және логикалық (AND, OR, NOT) операцияларды орындайды.",
        "ru": "Арифметико-логическое устройство – один из ключевых компонентов процессора, выполняющий арифметические (сложение, вычитание, умножение, деление) и логические (AND, OR, NOT) операции.",
        "en": "The arithmetic logic unit (ALU) is one of the core components of a processor, performing arithmetic (addition, subtraction, multiplication, division) and logical (AND, OR, NOT) operations."
      },
      "example": {
        "kk": "Мысалы, арифметикалық-логикалық құрылғы компьютердің негізгі есептеу операцияларын орындайды.",
        "ru": "Например, арифметико-логическое устройство выполняет основные вычислительные операции в компьютере.",
        "en": "For example, the ALU executes fundamental computational operations in a computer."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Сумматор",
      "ru": "Сумматор",
      "en": "Adder",
      "definition": {
        "kk": "Сумматор – компьютердің арифметикалық операцияларының бірі болып, екілік сандарды қосу операциясын орындауға арналған логикалық құрылғы.",
        "ru": "Сумматор – логическая схема, предназначенная для выполнения операции сложения двоичных чисел.",
        "en": "An adder is a digital circuit designed to perform the arithmetic operation of adding binary numbers."
      },
      "example": {
        "kk": "Сумматор екі биттік сандарды қосып, олардың қосындысын есептейді.",
        "ru": "Сумматор складывает два двоичных числа, вычисляя их сумму.",
        "en": "The adder computes the sum by adding two binary numbers."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Аналық тақта",
      "ru": "Материнская плата",
      "en": "Motherboard",
      "definition": {
        "kk": "Компьютер компоненттерін біріктіретін негізгі плата.",
        "ru": "Основная плата, объединяющая компоненты компьютера.",
        "en": "The main board that integrates computer components."
      },
      "example": {
        "kk": "Аналық тақта барлық компоненттерді байланыстырады.",
        "ru": "Материнская плата связывает все компоненты.",
        "en": "The motherboard connects all components."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Компьютер жады",
      "ru": "Компьютерная память",
      "en": "Computer Memory",
      "definition": {
        "kk": "Компьютер жады — компьютердің деректерді уақытша немесе тұрақты түрде сақтау үшін қолданылатын компоненті.",
        "ru": "Компьютерная память — компонент, используемый для временного или постоянного хранения данных в компьютере.",
        "en": "Computer memory is a component used for both temporary and permanent storage of data in a computer."
      },
      "example": {
        "kk": "Компьютер жады программалардың жылдам жұмысын қамтамасыз етеді және ақпаратты сақтайды.",
        "ru": "Компьютерная память обеспечивает быструю работу программ и хранит информацию.",
        "en": "Computer memory ensures the fast operation of programs and stores information."
      },
      "image": "https://drive.google.com/file/d/1eGzP43ZolSR5MYWb2JGOTn2ckv_x6vYr/view?usp=drive_link",
      "source": ""
    }, 
     {
      "kk": "Ішкі жады",
      "ru": "Внутренняя память",
      "en": "Internal Memory",
      "definition": {
        "kk": "Ішкі жады – компьютердің процессорға жақын орналасқан және жылдам қол жетімділікті қамтамасыз ететін жады, мысалы, кэш немесе регистрлер.",
        "ru": "Внутренняя память – память, располагающаяся близко к процессору и обеспечивающая быстрый доступ, например, кэш или регистры.",
        "en": "Internal memory refers to memory located close to the CPU, providing fast access, such as cache or registers."
      },
      "example": {
        "kk": "Процессор ішкі жадыға тез қол жеткізіп, есептерді жылдамырақ орындайды.",
        "ru": "Процессор использует внутреннюю память для быстрой обработки данных.",
        "en": "The processor accesses internal memory quickly to execute tasks faster."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Сыртқы жады",
      "ru": "Внешняя память",
      "en": "External Memory",
      "definition": {
        "kk": "Сыртқы жады – деректерді ұзақ мерзімге сақтау үшін қолданылатын жады құрылғысы, мысалы, қатты диск немесе SSD.",
        "ru": "Внешняя память – устройства для долговременного хранения данных, например, жесткий диск или SSD.",
        "en": "External memory refers to storage devices used for long-term data retention, such as a hard disk or SSD."
      },
      "example": {
        "kk": "Сыртқы жады үлкен көлемдегі файлдарды сақтап, деректерді ұзақ мерзімге сақтайды.",
        "ru": "Внешняя память хранит большие объемы данных на длительный срок.",
        "en": "External memory is used to store large amounts of data for long-term use."
      },
      "image": "",
      "source": ""
    }, 
     {
      "kk": "Жүйелік блок",
      "ru": "Системный блок",
      "en": "System Unit",
      "definition": {
        "kk": "Жүйелік блок – компьютердің негізгі компоненттері мен электр құрылғыларын біріктіретін корпус. Ол процессор, жедел жад, сақтау құрылғылары және басқа да компоненттерді орналастырады.",
        "ru": "Системный блок – это корпус, объединяющий основные компоненты и электрические устройства компьютера. В нем размещаются процессор, оперативная память, устройства хранения и другие компоненты.",
        "en": "The system unit is the chassis that houses the essential components and electrical devices of a computer. It contains the processor, RAM, storage devices, and other components."
      },
      "example": {
        "kk": "Жүйелік блок компьютердің «миы» ретінде қызмет етеді, себебі оның ішінде барлық маңызды компоненттер орналасқан.",
        "ru": "Системный блок служит «мозгом» компьютера, так как в нем находятся все основные компоненты.",
        "en": "The system unit acts as the 'brain' of the computer, housing all the critical components."
      },
      "image": "https://artemsannikov.ru/wp-content/uploads/2015/01/device-system-unit.jpg",
      "source": ""
    }, 
    {
      "kk": "Жедел жад",
      "ru": "Оперативная память (ОЗУ)",
      "en": "RAM",
      "definition": {
        "kk": "Бағдарламалар мен мәліметтерді уақытша сақтайтын жад.",
        "ru": "Память для временного хранения программ и данных.",
        "en": "Memory for temporary storage of programs and data."
      },
      "example": {
        "kk": "Жедел жад бағдарламалардың жылдам орындалуына ықпал етеді.",
        "ru": "Оперативная память способствует быстрому выполнению программ.",
        "en": "RAM helps programs run quickly."
      },
      "image": "https://vseplus.com/uploads/articles/749/749_1.jpg",
      "source": ""
    },
    {
      "kk": "Тұрақты жад",
      "ru": "Постоянная память (ПЗУ)",
      "en": "ROM",
      "definition": {
        "kk": "Құрылғының жұмыс істеуіне қажетті тұрақты мәліметтер сақтайтын жад.",
        "ru": "Память для хранения постоянных данных, необходимых для работы устройства.",
        "en": "Memory that stores permanent data needed for device operation."
      },
      "example": {
        "kk": "Тұрақты жад жүйе бағдарламаларын сақтайды.",
        "ru": "Постоянная память сохраняет системные программы.",
        "en": "ROM stores system programs."
      },
      "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRSZu1RZ72DsSs-aOp8qK-l_n8d3W060a67vw&s",
      "source": ""
    },
    {
      "kk": "Қуат көзі",
      "ru": "Блок питания",
      "en": "Power Supply",
      "definition": {
        "kk": "Компьютерге электр энергиясын жеткізетін блок.",
        "ru": "Блок, обеспечивающий компьютер электроэнергией.",
        "en": "A unit that supplies electricity to the computer."
      },
      "example": {
        "kk": "Қуат көзі тұрақты токты қамтамасыз етеді.",
        "ru": "Блок питания обеспечивает постоянный ток.",
        "en": "The power supply provides stable current."
      },
      "image": "https://stack-systems.com.ua/media/magefan_blog/9687902d-0a9f-11e1-b8f4-0019dbf63c892.jpg",
      "source": ""
    }, 
     {
      "kk": "Монитор",
      "ru": "Монитор",
      "en": "Monitor",
      "definition": {
        "kk": "Монитор – компьютердің бейнелік ақпаратты көрсетуге арналған шығару құрылғысы.",
        "ru": "Монитор – устройство для отображения визуальной информации компьютера.",
        "en": "Monitor is an output device used to display visual information from a computer."
      },
      "example": {
        "kk": "Компьютерге қосылған монитор арқылы ақпарат көрінеді.",
        "ru": "Через подключённый монитор отображается информация.",
        "en": "Information is displayed through the connected monitor."
      },
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/MonitorLCDlcd.svg/1200px-MonitorLCDlcd.svg.png",
      "source": ""
    },
    {
      "kk": "Пернетақта",
      "ru": "Клавиатура",
      "en": "Keyboard",
      "definition": {
        "kk": "Пернетақта – компьютерге деректерді енгізу үшін қолданылатын құрылғы.",
        "ru": "Клавиатура – устройство для ввода данных в компьютер.",
        "en": "Keyboard is an input device used for data entry into a computer."
      },
      "example": {
        "kk": "Пернетақта арқылы мәтіндер енгізіледі.",
        "ru": "С помощью клавиатуры вводятся тексты.",
        "en": "Text is entered using a keyboard."
      },
      "image": "https://manuals.plus/wp-content/uploads/2022/09/geemarc-KBSV3_BLK-Standard-Big-Letter-Keyboard-featured.png",
      "source": ""
    },
    {
      "kk": "Тінтуір",
      "ru": "Мышь",
      "en": "Mouse",
      "definition": {
        "kk": "Тінтуір – компьютердің графикалық интерфейсін басқаруға арналған енгізу құрылғысы.",
        "ru": "Мышь – устройство для управления графическим интерфейсом компьютера.",
        "en": "Mouse is an input device used to control the computer's graphical interface."
      },
      "example": {
        "kk": "Тінтуір арқылы экрандағы элементтер таңдалады.",
        "ru": "С помощью мыши выбираются элементы на экране.",
        "en": "Elements on the screen are selected using a mouse."
      },
      "image": "https://www.delux-asia.kz/upload/catalog/item170/0_black_big.jpg",
      "source": ""
    },
    {
      "kk": "Принтер",
      "ru": "Принтер",
      "en": "Printer",
      "definition": {
        "kk": "Принтер – компьютердегі деректерді қағаз бетіне басып шығару үшін пайдаланылатын құрылғы.",
        "ru": "Принтер – устройство для вывода информации с компьютера на бумагу.",
        "en": "Printer is a device used to print data from a computer onto paper."
      },
      "example": {
        "kk": "Принтер арқылы құжатты басып шығаруға болады.",
        "ru": "При помощи принтера можно распечатать документ.",
        "en": "A document can be printed using a printer."
      },
      "image": "https://cdn.lifehacker.ru/wp-content/uploads/2019/10/Copy-of-Copy-of-Copy-of-Copy-of-Book-2_1570775107.jpg",
      "source": ""
    },
    {
      "kk": "Плоттер",
      "ru": "Плоттер",
      "en": "Plotter",
      "definition": {
        "kk": "Плоттер – жоғары дәлдіктегі графикалық құрылғы, үлкен форматтағы сызбалар мен техникалық чертеждерді басып шығару үшін пайдаланылады.",
        "ru": "Плоттер – устройство для высокоточной печати больших графических изображений и технических чертежей.",
        "en": "Plotter is a high-precision graphical device used to print large-format drawings and technical blueprints."
      },
      "example": {
        "kk": "Архитекторлар өз сызбаларын плоттер арқылы басып шығарады.",
        "ru": "Архитекторы печатают свои чертежи с помощью плоттера.",
        "en": "Architects print their drawings using a plotter."
      },
      "image": "https://strgimgr.umico.az/sized/840/318478-dbb2c66b4a3c565c7e22dfe56d7b6c2f.jpg",
      "source": ""
    },
    {
      "kk": "Сканер",
      "ru": "Сканер",
      "en": "Scanner",
      "definition": {
        "kk": "Сканер – қағаз құжаттарын және суреттерді цифрлық форматқа айналдыратын құрылғы.",
        "ru": "Сканер – устройство для преобразования бумажных документов и изображений в цифровой формат.",
        "en": "Scanner is a device that converts paper documents and images into digital format."
      },
      "example": {
        "kk": "Сканер арқылы ескі құжаттардың цифрлық көшірмесін алуға болады.",
        "ru": "С помощью сканера можно создать цифровую копию старых документов.",
        "en": "A digital copy of old documents can be obtained using a scanner."
      },
      "image": "https://www.quickscan.ru/files/9085/4286/st640.jpg",
      "source": ""
    },
    {
      "kk": "Дисковод",
      "ru": "Дисковод",
      "en": "Disk Drive",
      "definition": {
        "kk": "Дисковод – оптикалық немесе магниттік дискілерді оқу және жазу үшін қолданылатын құрылғы.",
        "ru": "Дисковод – устройство для чтения и записи оптических или магнитных дисков.",
        "en": "Disk drive is a device used for reading and writing optical or magnetic disks."
      },
      "example": {
        "kk": "Дисковод арқылы DVD және CD дискілері оқылады.",
        "ru": "DVD и CD диски читаются с помощью дисковода.",
        "en": "DVD and CD disks are read using a disk drive."
      },
      "image": "https://patron-service.ru/images/thumbnails/720/720/detailed/3419/0112003_1.jpg",
      "source": ""
    },
    {
      "kk": "Модем",
      "ru": "Модем",
      "en": "Modem",
      "definition": {
        "kk": "Модем – компьютерді желіге қосу үшін, деректерді сандық сигналдарға модуляциялау және демодуляциялау арқылы байланыс орнататын құрылғы.",
        "ru": "Модем – устройство для подключения компьютера к сети, осуществляющее модуляцию и демодуляцию цифровых сигналов.",
        "en": "Modem is a device used to connect a computer to a network, modulating and demodulating digital signals."
      },
      "example": {
        "kk": "Модем арқылы компьютер интернетке қосылады.",
        "ru": "С помощью модема компьютер подключается к интернету.",
        "en": "A computer connects to the internet using a modem."
      },
      "image": "https://englishlib.org/dictionary/wlibrary/m/60259c5c052fd8.92997254.jpg",
      "source": ""
    },
    {
      "kk": "Мультимедиа",
      "ru": "Мультимедиа",
      "en": "Multimedia",
      "definition": {
        "kk": "Мультимедиа – аудио, видео және графикалық ақпаратты біріктіретін, қолданушыға бай және интерактивті контент ұсынатын технологиялар жиынтығы.",
        "ru": "Мультимедиа – совокупность технологий, объединяющих аудио, видео и графическую информацию для создания интерактивного контента.",
        "en": "Multimedia is a set of technologies that combine audio, video, and graphics to deliver rich, interactive content."
      },
      "example": {
        "kk": "Мультимедиалық презентациялар оқыту процесінде кеңінен қолданылады.",
        "ru": "Мультимедийные презентации широко используются в образовательном процессе.",
        "en": "Multimedia presentations are widely used in the educational process."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Стриммер",
      "ru": "Стриммер",
      "en": "Streamer",
      "definition": {
        "kk": "Стриммер – ағынды (стриминг) ақпаратты, яғни аудио немесе видео контентті таратуға арналған құрылғы немесе бағдарлама.",
        "ru": "Стриммер – устройство или программа для передачи потокового аудио или видео контента.",
        "en": "Streamer is a device or software used for delivering streaming audio or video content."
      },
      "example": {
        "kk": "Стриммер қызметтері арқылы интернетте тікелей эфир трансляцияланады.",
        "ru": "С помощью стриммера осуществляется прямая трансляция в интернете.",
        "en": "Streaming services use streamers to broadcast live content over the internet."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Желілік адаптер",
      "ru": "Сетевой адаптер",
      "en": "Network Adapter",
      "definition": {
        "kk": "Желілік адаптер – компьютерді желіге қосып, деректерді тасымалдауды қамтамасыз ететін құрылғы.",
        "ru": "Сетевой адаптер – устройство для подключения компьютера к сети и обеспечения передачи данных.",
        "en": "A network adapter is a device that connects a computer to a network and enables data transfer."
      },
      "example": {
        "kk": "Желілік адаптер компьютерді интернетке немесе жергілікті желіге қосуға мүмкіндік береді.",
        "ru": "Сетевой адаптер позволяет подключить компьютер к интернету или локальной сети.",
        "en": "A network adapter enables a computer to connect to the internet or a local network."
      },
      "image": "https://nevateka.ru/upload/iblock/f4e/283160_v01_b.jpg",
      "source": ""
    }
  ],
  "Дәріс 3. Компьютердің программалық қамтамасыз етілуі": [
    {
      "kk": "Операциялық жүйе",
      "ru": "Операционная система",
      "en": "Operating System",
      "definition": {
        "kk": "Компьютерді басқаруға арналған негізгі бағдарламалық платформа.",
        "ru": "Основная программная платформа для управления компьютером.",
        "en": "The main software platform for managing a computer."
      },
      "example": {
        "kk": "Windows және Linux танымал операциялық жүйелер.",
        "ru": "Windows и Linux популярные операционные системы.",
        "en": "Windows and Linux are popular operating systems."
      },
      "relations": {
        "broader_term": "Программалық қамтамасыз ету",
        "narrower_terms": ["Windows", "Linux", "macOS"],
        "related_terms": ["Файлдық жүйе", "Процессор", "Интерфейс"]
  },
      "image": "",
      "source": ""
    },
    {
  "kk": "Тактілік жиілік",
  "ru": "Тактовая частота",
  "en": "Clock Frequency",
  "definition": {
    "kk": "Тактілік жиілік – процессордың такт генераторының секунд ішінде жасайтын такттарының саны, ол процессордың жылдамдығын сипаттайды.",
    "ru": "Тактовая частота – количество тактов, создаваемых генератором процессора за секунду, описывающее его скорость.",
    "en": "Clock frequency is the number of cycles generated by the processor's clock generator per second, describing its speed."
  },
  "example": {
    "kk": "Процессордың тактілік жиілігі жоғары болған сайын, оның жылдамдығы артады.",
    "ru": "Чем выше тактовая частота процессора, тем выше его скорость.",
    "en": "The higher the clock frequency of the processor, the faster its speed."
  },
  "relations": {
    "synonyms": ["процессордың жылдамдығы"],
    "homonyms": [],
    "general_concept": {
      "kk": "Тактілік жиілік процессордың негізгі өнімділік көрсеткіші ретінде сипатталады.",
      "ru": "Тактовая частота описывается как ключевой показатель производительности процессора.",
      "en": "Clock frequency is described as a key indicator of processor performance."
    },
    "specific_concepts": {
      "kk": ["генератор", "такт"],
      "ru": ["генератор", "такт"],
      "en": ["generator", "cycle"]
    },
    "associative": {
      "kk": ["жоғары жылдамдық", "өнімділік"],
      "ru": ["высокая скорость", "производительность"],
      "en": ["high speed", "performance"]
    }
  }
},
    {
      "kk": "Қолданбалы бағдарламалар",
      "ru": "Прикладные программы",
      "en": "Applications",
      "definition": {
        "kk": "Белгілі бір тапсырмаларды орындауға арналған бағдарламалар жиынтығы.",
        "ru": "Набор программ для выполнения определённых задач.",
        "en": "A set of programs designed to perform specific tasks."
      },
      "example": {
        "kk": "Microsoft Word мәтінді өңдеу үшін қолданылады.",
        "ru": "Microsoft Word используется для обработки текста.",
        "en": "Microsoft Word is used for text processing."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Кітапхана бағдарламалары",
      "ru": "Библиотечные программы",
      "en": "Library Programs",
      "definition": {
        "kk": "Кітапхана бағдарламалары – компьютерлік бағдарламаларда қолданылатын функциялар, процедуралар және мәліметтер жинақтарын сақтайтын кодтардың жинағы.",
        "ru": "Библиотечные программы – это набор кодов, содержащих функции, процедуры и данные, используемые в компьютерных программах.",
        "en": "Library programs are collections of code that store functions, procedures, and data used in computer software."
      },
      "example": {
        "kk": "Python тіліндегі 'math' кітапханасы математикалық операцияларды орындауға мүмкіндік береді.",
        "ru": "Библиотека 'math' в Python позволяет выполнять математические операции.",
        "en": "The 'math' library in Python enables mathematical operations."
      },
      "image": "",
      "source": ""
    }, 
    {
      "kk": "Ассемблер",
      "ru": "Ассемблер",
      "en": "Assembler",
      "definition": {
        "kk": "Ассемблер – төмен деңгейлі бағдарламалау тілі, ол машиналық кодтарды түсінікті командаларға айналдырады.",
        "ru": "Ассемблер – язык программирования низкого уровня, который преобразует машинные коды в понятные команды.",
        "en": "Assembler is a low-level programming language that translates machine codes into readable instructions."
      },
      "example": {
        "kk": "Ассемблер көмегімен микропроцессордың машиналық кодтарын жазуға болады.",
        "ru": "С помощью ассемблера можно писать машинные коды для микропроцессора.",
        "en": "Assembler allows writing machine codes for microprocessors."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Интерпретатор",
      "ru": "Интерпретатор",
      "en": "Interpreter",
      "definition": {
        "kk": "Интерпретатор – бағдарламаны бір уақытта, жол-жолымен оқып, орындайтын құрал.",
        "ru": "Интерпретатор – это средство, которое выполняет программу построчно, одновременно читая её.",
        "en": "An interpreter is a tool that reads and executes a program line by line in real time."
      },
      "example": {
        "kk": "Python тілі интерпретаторға негізделген, сондықтан кодты бірден орындауға болады.",
        "ru": "Язык Python основан на интерпретаторе, поэтому код можно выполнять сразу.",
        "en": "Python is interpreter-based, allowing code to be executed immediately."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Компилятор",
      "ru": "Компилятор",
      "en": "Compiler",
      "definition": {
        "kk": "Компилятор – бағдарламаның бастапқы кодын машиналық кодқа толық аударып, орындалуға дайын файл жасайтын құрал.",
        "ru": "Компилятор – это средство, которое переводит исходный код программы в машинный код и создаёт готовый файл для выполнения.",
        "en": "A compiler is a tool that translates the source code of a program into machine code, creating a ready-to-execute file."
      },
      "example": {
        "kk": "C++ бағдарламасының кодын компилятор арқылы орындалатын файлға аударуға болады.",
        "ru": "Код программы на C++ можно перевести в исполняемый файл с помощью компилятора.",
        "en": "A C++ program's code can be compiled into an executable file using a compiler."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Драйвер",
      "ru": "Драйвер",
      "en": "Driver",
      "definition": {
        "kk": "Аппараттық құралдармен жұмыс істеуге мүмкіндік беретін бағдарлама.",
        "ru": "Программа для работы с аппаратными устройствами.",
        "en": "A program that enables working with hardware devices."
      },
      "example": {
        "kk": "Принтердің драйвері компьютерге принтерді басқаруға мүмкіндік береді.",
        "ru": "Драйвер принтера позволяет компьютеру управлять принтером.",
        "en": "Printer drivers allow the computer to manage the printer."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Антивирус",
      "ru": "Антивирус",
      "en": "Antivirus",
      "definition": {
        "kk": "Компьютерлік вирустардан қорғауға арналған бағдарлама.",
        "ru": "Программа для защиты от компьютерных вирусов.",
        "en": "A program designed to protect against computer viruses."
      },
      "example": {
        "kk": "Антивирус бағдарламасы зиянды бағдарламаларды анықтайды.",
        "ru": "Антивирус обнаруживает вредоносные программы.",
        "en": "The antivirus detects harmful software."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Бағдарламалау тілдері",
      "ru": "Языки программирования",
      "en": "Programming Languages",
      "definition": {
        "kk": "Компьютерлік бағдарламалар құруға арналған құралдар жиынтығы.",
        "ru": "Набор инструментов для создания компьютерных программ.",
        "en": "A set of tools for creating computer programs."
      },
      "example": {
        "kk": "Python бағдарламалауды үйрену үшін кеңінен қолданылады.",
        "ru": "Python широко используется для изучения программирования.",
        "en": "Python is widely used for learning programming."
      },
      "image": "",
      "source": ""
    }
  ],
  
  "Дәріс 4. Ақпаратты өңдеу": [
    {
      "kk": "Мәліметтер базасы",
      "ru": "База данных",
      "en": "Database",
      "definition": {
        "kk": "Мәліметтерді сақтау және басқаруға арналған жүйе.",
        "ru": "Система для хранения и управления данными.",
        "en": "A system for storing and managing data."
      },
      "example": {
        "kk": "Мәліметтер базасы клиенттердің ақпаратын ұйымдастырады.",
        "ru": "База данных организует информацию о клиентах.",
        "en": "The database organizes customer information."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Алгоритм",
      "ru": "Алгоритм",
      "en": "Algorithm",
      "definition": {
        "kk": "Белгілі бір тапсырманы орындау үшін қажетті әрекеттердің реттілігі.",
        "ru": "Последовательность действий для выполнения определённой задачи.",
        "en": "A sequence of actions to complete a specific task."
      },
      "example": {
        "kk": "Сұрыптау алгоритмдері деректерді ретке келтіреді.",
        "ru": "Алгоритмы сортировки упорядочивают данные.",
        "en": "Sorting algorithms organize data."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Өңдеу жылдамдығы",
      "ru": "Скорость обработки",
      "en": "Processing Speed",
      "definition": {
        "kk": "Компьютердің деректерді өңдеу жылдамдығын сипаттайтын көрсеткіш.",
        "ru": "Показатель скорости обработки данных компьютером.",
        "en": "A measure of the speed at which a computer processes data."
      },
      "example": {
        "kk": "Жоғары жылдамдықты процессор деректерді тез өңдей алады.",
        "ru": "Высокоскоростной процессор быстро обрабатывает данные.",
        "en": "A high-speed processor can quickly process data."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Форматтау",
      "ru": "Форматирование",
      "en": "Formatting",
      "definition": {
        "kk": "Мәліметтердің құрылымын белгілеу процесі.",
        "ru": "Процесс установления структуры данных.",
        "en": "The process of defining the structure of data."
      },
      "example": {
        "kk": "Деректерді кестелерге форматтау оларды оқуды жеңілдетеді.",
        "ru": "Форматирование данных в таблицах облегчает их чтение.",
        "en": "Formatting data into tables makes it easier to read."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Кэш",
      "ru": "Кэш",
      "en": "Cache",
      "definition": {
        "kk": "Мәліметтерді уақытша сақтау үшін қолданылатын жад түрі.",
        "ru": "Тип памяти для временного хранения данных.",
        "en": "A type of memory used for temporary data storage."
      },
      "example": {
        "kk": "Кэш браузердің жылдамдығын арттырады.",
        "ru": "Кэш увеличивает скорость работы браузера.",
        "en": "Cache increases browser speed."
      },
      "image": "",
      "source": ""
    },
     {
      "kk": "Word",
      "ru": "Word",
      "en": "Word",
      "definition": {
        "kk": "Word – мәтіндік құжаттарды жасау, өңдеу және сақтау үшін қолданылатын бағдарламалық құрал.",
        "ru": "Word – программное обеспечение для создания, редактирования и хранения текстовых документов.",
        "en": "Word is software for creating, editing, and storing text documents."
      },
      "example": {
        "kk": "Word бағдарламасында есеп берудің мәтінін дайындауға болады.",
        "ru": "В Word можно подготовить текст отчёта.",
        "en": "You can prepare a report text in Word."
      },
      "relations": {
        "synonyms": ["Мәтіндік редактор"],
        "general_concept": {
          "kk": "Мәтіндермен жұмыс істеу үшін арналған бағдарламалық құрал.",
          "ru": "Программное обеспечение для работы с текстами.",
          "en": "Software for working with texts."
        },
        "specific_concepts": {
          "kk": ["құжат", "қаріп"],
          "ru": ["документ", "шрифт"],
          "en": ["document", "font"]
        },
        "associative": {
          "kk": ["мәтін", "дизайн"],
          "ru": ["текст", "дизайн"],
          "en": ["text", "design"]
        }
      }
    },
    {
      "kk": "PowerPoint",
      "ru": "PowerPoint",
      "en": "PowerPoint",
      "definition": {
        "kk": "PowerPoint – презентацияларды жасау, өңдеу және көрсету үшін қолданылатын бағдарламалық құрал.",
        "ru": "PowerPoint – программное обеспечение для создания, редактирования и демонстрации презентаций.",
        "en": "PowerPoint is software for creating, editing, and displaying presentations."
      },
      "example": {
        "kk": "PowerPoint арқылы графиктер мен диаграммалар бар презентация жасауға болады.",
        "ru": "С помощью PowerPoint можно создать презентацию с графиками и диаграммами.",
        "en": "You can create a presentation with graphs and charts using PowerPoint."
      },
      "relations": {
        "synonyms": ["Презентация құралы"],
        "general_concept": {
          "kk": "Ақпаратты визуалды көрсетуге арналған бағдарлама.",
          "ru": "Программа для визуального представления информации.",
          "en": "Software for visually presenting information."
        },
        "specific_concepts": {
          "kk": ["диаграмма", "графика"],
          "ru": ["диаграмма", "графика"],
          "en": ["diagram", "graphics"]
        },
        "associative": {
          "kk": ["дизайн", "слайд"],
          "ru": ["дизайн", "слайд"],
          "en": ["design", "slide"]
        }
      }
    },
    {
      "kk": "Excel",
      "ru": "Excel",
      "en": "Excel",
      "definition": {
        "kk": "Excel – деректерді есептеу, талдау және кестелерде ұйымдастыру үшін қолданылатын бағдарламалық құрал.",
        "ru": "Excel – программное обеспечение для расчёта, анализа данных и их организации в таблицах.",
        "en": "Excel is software for calculating, analyzing, and organizing data in tables."
      },
      "example": {
        "kk": "Excel бағдарламасында деректерді талдап, диаграмма жасауға болады.",
        "ru": "В Excel можно анализировать данные и создавать диаграммы.",
        "en": "You can analyze data and create charts in Excel."
      },
      "relations": {
        "synonyms": ["Кестелер редакторы"],
        "general_concept": {
          "kk": "Деректермен жұмыс істеуге арналған құрал.",
          "ru": "Инструмент для работы с данными.",
          "en": "A tool for working with data."
        },
        "specific_concepts": {
          "kk": ["кесте", "формула", "ұяшық"],
          "ru": ["таблица", "формула", "ячейка"],
          "en": ["table", "formula", "cell"]
        },
        "associative": {
          "kk": ["анализ", "гистограмма"],
          "ru": ["анализ", "гистограмма"],
          "en": ["analysis", "histogram"]
        }
      }
    },
    {
      "kk": "Кесте",
      "ru": "Таблица",
      "en": "Table",
      "definition": {
        "kk": "Кесте – деректерді жолдар мен бағандар түрінде ұйымдастыру тәсілі.",
        "ru": "Таблица – способ организации данных в виде строк и столбцов.",
        "en": "Table is a way of organizing data into rows and columns."
      },
      "example": {
        "kk": "Excel кестесінде деректерді талдауға болады.",
        "ru": "В таблице Excel можно анализировать данные.",
        "en": "You can analyze data in an Excel table."
      },
      "relations": {
        "synonyms": ["мәліметтер"],
        "general_concept": {
          "kk": "Деректерді жүйелеу тәсілі.",
          "ru": "Способ структурирования данных.",
          "en": "A method of structuring data."
        },
        "specific_concepts": {
          "kk": ["қатар", "баған", "ұяшық"],
          "ru": ["строка", "столбец", "ячейка"],
          "en": ["row", "column", "cell"]
        },
        "associative": {
          "kk": ["деректер", "ұйымдастыру"],
          "ru": ["данные", "организация"],
          "en": ["data", "organization"]
        }
      }
    },
    {
  "kk": "Қатар",
  "ru": "Строка",
  "en": "Row",
  "definition": {
    "kk": "Қатар – кестеде деректерді көлденең бағытта ұйымдастыру элементі.",
    "ru": "Строка – элемент организации данных в таблице по горизонтали.",
    "en": "Row is an element that organizes data horizontally in a table."
  },
  "example": {
    "kk": "Қатардың әрбір ұяшығында бір жазба орналасады.",
    "ru": "В каждой ячейке строки содержится одна запись.",
    "en": "Each cell in a row contains one record."
  },
  "relations": {
    "synonyms": ["көлденең элемент"],
    "general_concept": {
      "kk": "Қатар деректерді кестеде көлденең бағытта көрсетуге арналған.",
      "ru": "Строка предназначена для отображения данных по горизонтали в таблице.",
      "en": "Row is designed to display data horizontally in a table."
    },
    "specific_concepts": {
      "kk": ["ұяшық", "баған"],
      "ru": ["ячейка", "столбец"],
      "en": ["cell", "column"]
    },
    "associative": {
      "kk": ["деректер", "ұйымдастыру"],
      "ru": ["данные", "организация"],
      "en": ["data", "organization"]
    }
  }
},
{
  "kk": "Баған",
  "ru": "Столбец",
  "en": "Column",
  "definition": {
    "kk": "Баған – кестеде деректерді тік бағытта ұйымдастыру элементі.",
    "ru": "Столбец – элемент организации данных в таблице по вертикали.",
    "en": "Column is an element that organizes data vertically in a table."
  },
  "example": {
    "kk": "Бағандар арқылы деректерді топтастыруға болады.",
    "ru": "С помощью столбцов можно группировать данные.",
    "en": "Columns can be used to group data."
  },
  "relations": {
    "synonyms": ["тік элемент"],
    "general_concept": {
      "kk": "Баған деректерді кестеде тік бағытта көрсетуге арналған.",
      "ru": "Столбец предназначен для отображения данных по вертикали в таблице.",
      "en": "Column is designed to display data vertically in a table."
    },
    "specific_concepts": {
      "kk": ["қатар", "ұяшық"],
      "ru": ["строка", "ячейка"],
      "en": ["row", "cell"]
    },
    "associative": {
      "kk": ["топтастыру", "деректер"],
      "ru": ["группировка", "данные"],
      "en": ["grouping", "data"]
    }
  }
},
{
  "kk": "Ұяшық",
  "ru": "Ячейка",
  "en": "Cell",
  "definition": {
    "kk": "Ұяшық – кестеде қатар мен бағанның қиылысында орналасқан деректер элементі.",
    "ru": "Ячейка – элемент данных, находящийся на пересечении строки и столбца в таблице.",
    "en": "Cell is a data element located at the intersection of a row and a column in a table."
  },
  "example": {
    "kk": "Ұяшықта бір мән немесе формула сақталуы мүмкін.",
    "ru": "В ячейке может храниться одно значение или формула.",
    "en": "A cell can contain a single value or a formula."
  },
  "relations": {
    "synonyms": ["деректер элементі"],
    "general_concept": {
      "kk": "Ұяшық деректерді сақтау үшін арналған.",
      "ru": "Ячейка предназначена для хранения данных.",
      "en": "Cell is designed to store data."
    },
    "specific_concepts": {
      "kk": ["қатар", "баған"],
      "ru": ["строка", "столбец"],
      "en": ["row", "column"]
    },
    "associative": {
      "kk": ["мән", "формула"],
      "ru": ["значение", "формула"],
      "en": ["value", "formula"]
    }
  }
},
{
  "kk": "Құжат",
  "ru": "Документ",
  "en": "Document",
  "definition": {
    "kk": "Құжат – электронды түрде немесе қағазда жасалған ақпараттық файл.",
    "ru": "Документ – информационный файл, созданный в электронном виде или на бумаге.",
    "en": "Document is an informational file created either electronically or on paper."
  },
  "example": {
    "kk": "Құжатты Word бағдарламасында дайындауға болады.",
    "ru": "Документ можно подготовить в программе Word.",
    "en": "A document can be prepared using Word software."
  },
  "relations": {
    "synonyms": ["файл"],
    "general_concept": {
      "kk": "Құжат ақпаратты сақтау үшін қолданылады.",
      "ru": "Документ используется для хранения информации.",
      "en": "Document is used for storing information."
    },
    "specific_concepts": {
      "kk": ["Word", "қаріп"],
      "ru": ["Word", "шрифт"],
      "en": ["Word", "font"]
    },
    "associative": {
      "kk": ["мәліметтер", "форматтау"],
      "ru": ["данные", "форматирование"],
      "en": ["data", "formatting"]
    }
  }
}, 
    {
  "kk": "Қаріп",
  "ru": "Шрифт",
  "en": "Font",
  "definition": {
    "kk": "Қаріп – мәтіннің әріптері мен белгілерінің стилі мен өлшемін анықтайтын графикалық дизайн элементі.",
    "ru": "Шрифт – графический элемент, определяющий стиль и размер букв и знаков текста.",
    "en": "Font is a graphical element that defines the style and size of the text's letters and symbols."
  },
  "example": {
    "kk": "Құжат дизайнында әртүрлі қаріптерді қолдануға болады.",
    "ru": "В дизайне документа можно использовать различные шрифты.",
    "en": "Different fonts can be used in document design."
  },
  "relations": {
    "synonyms": ["мәтін стилі"],
    "general_concept": {
      "kk": "Қаріп мәтіннің көркемдік ерекшелігін анықтайды.",
      "ru": "Шрифт определяет художественные особенности текста.",
      "en": "Font determines the artistic features of the text."
    },
    "specific_concepts": {
      "kk": ["дизайн", "формат"],
      "ru": ["дизайн", "формат"],
      "en": ["design", "format"]
    },
    "associative": {
      "kk": ["эстетика", "оқылымдығы"],
      "ru": ["эстетика", "читабельность"],
      "en": ["aesthetics", "readability"]
    }
  }
},
{
  "kk": "Маркер",
  "ru": "Маркёр",
  "en": "Marker",
  "definition": {
    "kk": "Маркер – мәтіндегі немесе құжаттағы маңызды бөліктерді белгілеу үшін қолданылатын элемент.",
    "ru": "Маркёр – элемент, используемый для выделения важных частей текста или документа.",
    "en": "Marker is an element used to highlight important parts of the text or document."
  },
  "example": {
    "kk": "Маркер арқылы негізгі ұғымдарды белгілеуге болады.",
    "ru": "С помощью маркера можно выделить ключевые концепции.",
    "en": "Key concepts can be highlighted using a marker."
  },
  "relations": {
    "synonyms": ["белгілеу элементі"],
    "general_concept": {
      "kk": "Маркер мәтіннің назар аударуға тұрарлық бөлімдерін көрсетеді.",
      "ru": "Маркёр указывает на важные части текста.",
      "en": "Marker points out important parts of the text."
    },
    "specific_concepts": {
      "kk": ["құжат", "құрал"],
      "ru": ["документ", "инструмент"],
      "en": ["document", "tool"]
    },
    "associative": {
      "kk": ["маңызды", "белгілеу"],
      "ru": ["важность", "выделение"],
      "en": ["importance", "highlighting"]
    }
  }
},
{
  "kk": "Формула",
  "ru": "Формула",
  "en": "Formula",
  "definition": {
    "kk": "Формула – математикалық немесе логикалық есептеулерді автоматтандыру үшін қолданылатын символдар мен операторлардың жиынтығы.",
    "ru": "Формула – это набор символов и операторов, используемый для автоматизации математических или логических расчётов.",
    "en": "Formula is a set of symbols and operators used to automate mathematical or logical calculations."
  },
  "example": {
    "kk": "Excel бағдарламасында формулаларды қолданып, есептеулерді автоматтандыруға болады.",
    "ru": "В Excel можно использовать формулы для автоматизации расчётов.",
    "en": "Formulas can be used in Excel to automate calculations."
  },
  "relations": {
    "synonyms": ["есептеу"],
    "general_concept": {
      "kk": "Формулалар есептерді оңайлату үшін арналған.",
      "ru": "Формулы предназначены для упрощения вычислений.",
      "en": "Formulas are designed to simplify calculations."
    },
    "specific_concepts": {
      "kk": ["математика", "оператор"],
      "ru": ["математика", "оператор"],
      "en": ["mathematics", "operator"]
    },
    "associative": {
      "kk": ["логика", "есеп"],
      "ru": ["логика", "расчёт"],
      "en": ["logic", "calculation"]
    }
  }
},
{
  "kk": "Формат",
  "ru": "Формат",
  "en": "Format",
  "definition": {
    "kk": "Формат – құжат немесе файлдың құрылымы мен ұйымдастырылуын анықтайтын ережелер.",
    "ru": "Формат – это правила, определяющие структуру и организацию документа или файла.",
    "en": "Format is the set of rules that define the structure and organization of a document or file."
  },
  "example": {
    "kk": "Құжаттың дұрыс форматын таңдау оның оқылымдылығын арттырады.",
    "ru": "Правильный формат документа улучшает его читаемость.",
    "en": "Choosing the right format for a document improves its readability."
  },
  "relations": {
    "synonyms": ["құрылым"],
    "general_concept": {
      "kk": "Формат деректердің тәртібі мен көрінісін анықтайды.",
      "ru": "Формат определяет порядок и представление данных.",
      "en": "Format determines the arrangement and presentation of data."
    },
    "specific_concepts": {
      "kk": ["құжат", "құрал"],
      "ru": ["документ", "инструмент"],
      "en": ["document", "tool"]
    },
    "associative": {
      "kk": ["нақтылық", "құрылым"],
      "ru": ["точность", "структура"],
      "en": ["precision", "structure"]
    }
  }
},
{
  "kk": "Диаграмма",
  "ru": "Диаграмма",
  "en": "Chart",
  "definition": {
    "kk": "Диаграмма – деректерді графикалық түрде көрсету үшін қолданылатын визуалды құрал.",
    "ru": "Диаграмма – визуальный инструмент для представления данных в графической форме.",
    "en": "Chart is a visual tool used to represent data in a graphical form."
  },
  "example": {
    "kk": "Excel бағдарламасында сатылым деректерін диаграмма түрінде көрсетуге болады.",
    "ru": "В Excel можно представить данные о продажах в виде диаграммы.",
    "en": "Sales data can be displayed as a chart in Excel."
  },
  "relations": {
    "synonyms": ["графика"],
    "general_concept": {
      "kk": "Диаграммалар деректердің үлгілерін көрсету үшін арналған.",
      "ru": "Диаграммы предназначены для отображения шаблонов данных.",
      "en": "Charts are designed to display data patterns."
    },
    "specific_concepts": {
      "kk": ["гистограмма", "график"],
      "ru": ["гистограмма", "график"],
      "en": ["histogram", "graph"]
    },
    "associative": {
      "kk": ["визуализация", "талдау"],
      "ru": ["визуализация", "анализ"],
      "en": ["visualization", "analysis"]
    }
  }
}
  ],
  "Дәріс 5. Компьютерлік желілер": [
    {
  "kk": "Компьютерлік желі",
  "ru": "Компьютерная сеть",
  "en": "Computer Network",
  "definition": {
    "kk": "Компьютерлік желі – ақпаратты алмасу және ортақ ресурстарды пайдалану үшін бір-бірімен байланыстырылған бірнеше компьютерлердің жүйесі.",
    "ru": "Компьютерная сеть – это система из нескольких компьютеров, соединённых для обмена информацией и использования общих ресурсов.",
    "en": "Computer network is a system of interconnected computers designed for information exchange and shared resource utilization."
  },
  "example": {
    "kk": "Компьютерлік желі арқылы файлдарды басқа компьютерлермен бөлісуге болады.",
    "ru": "С помощью компьютерной сети можно делиться файлами с другими компьютерами.",
    "en": "Computer networks allow file sharing with other computers."
  },
  "relations": {
    "synonyms": ["ақпараттық желі"],
    "general_concept": {
      "kk": "Компьютерлік желі деректерді жылдам және тиімді алмасуға мүмкіндік береді.",
      "ru": "Компьютерная сеть обеспечивает быстрый и эффективный обмен данными.",
      "en": "Computer networks enable rapid and efficient data exchange."
    },
    "specific_concepts": {
      "kk": ["интернет", "локалды желі"],
      "ru": ["интернет", "локальная сеть"],
      "en": ["internet", "local network"]
    },
    "associative": {
      "kk": ["байланыс", "деректер"],
      "ru": ["связь", "данные"],
      "en": ["connection", "data"]
    }
  }
},
    {
      "kk": "Жергілікті желі",
      "ru": "Локальная сеть",
      "en": "LAN",
      "definition": {
        "kk": "Бір ғимарат ішінде бірнеше құрылғыны байланыстыратын желі.",
        "ru": "Сеть, соединяющая устройства внутри одного здания.",
        "en": "A network connecting devices within a single building."
      },
      "example": {
        "kk": "Жергілікті желі кеңселерде кеңінен қолданылады.",
        "ru": "Локальная сеть широко используется в офисах.",
        "en": "LAN is widely used in offices."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Әлемдік желі",
      "ru": "Глобальная сеть",
      "en": "WAN",
      "definition": {
        "kk": "Әр түрлі аймақтарды байланыстыратын кең ауқымды желі.",
        "ru": "Широкомасштабная сеть, соединяющая разные регионы.",
        "en": "A large-scale network that connects different regions."
      },
      "example": {
        "kk": "Интернет әлемдік желінің ең танымал мысалы.",
        "ru": "Интернет — самый известный пример глобальной сети.",
        "en": "The Internet is the most well-known example of a WAN."
      },
      "image": "",
      "source": ""
    },
    {
  "kk": "Корпоративты желі",
  "ru": "Корпоративная сеть",
  "en": "Corporate Network",
  "definition": {
    "kk": "Корпоративты желі – ұйым ішіндегі бөлімшелер мен қызметкерлер арасында деректерді алмасуды қамтамасыз ететін жеке компьютерлік желі.",
    "ru": "Корпоративная сеть – это частная компьютерная сеть, обеспечивающая обмен данными между отделами и сотрудниками внутри организации.",
    "en": "Corporate network is a private computer network facilitating data exchange among departments and employees within an organization."
  },
  "example": {
    "kk": "Корпоративты желі арқылы қызметкерлер маңызды құжаттарға ортақ қол жеткізе алады.",
    "ru": "Корпоративная сеть позволяет сотрудникам совместно использовать важные документы.",
    "en": "Corporate networks enable employees to share access to important documents."
  },
  "relations": {
    "synonyms": ["жеке желі"],
    "general_concept": {
      "kk": "Корпоративты желі ұйымның ішкі деректер алмасу жүйесін құрайды.",
      "ru": "Корпоративная сеть формирует внутреннюю систему обмена данными организации.",
      "en": "Corporate networks establish an internal data exchange system for organizations."
    },
    "specific_concepts": {
      "kk": ["желілік қауіпсіздік", "сервер"],
      "ru": ["сетевая безопасность", "сервер"],
      "en": ["network security", "server"]
    },
    "associative": {
      "kk": ["ұйым", "ресурстар"],
      "ru": ["организация", "ресурсы"],
      "en": ["organization", "resources"]
    }
  }
    },
    {
  "kk": "Компьютерлік желі топологиясы",
  "ru": "Топология компьютерной сети",
  "en": "Computer Network Topology",
  "definition": {
    "kk": "Компьютерлік желі топологиясы – желідегі құрылғылардың физикалық немесе логикалық орналасу тәртібі мен байланысу әдісі.",
    "ru": "Топология компьютерной сети – это порядок физического или логического расположения устройств в сети и способ их соединения.",
    "en": "Computer network topology refers to the arrangement and connection method of devices within a network, either physically or logically."
  },
  "example": {
    "kk": "Жұлдыз топологиясында барлық құрылғылар бір орталық серверге қосылған.",
    "ru": "В топологии «звезда» все устройства подключены к центральному серверу.",
    "en": "In star topology, all devices are connected to a central server."
  },
  "relations": {
    "synonyms": ["желінің орналасуы"],
    "general_concept": {
      "kk": "Топология желінің тиімділігін және құрылғылар арасындағы байланыс әдісін анықтайды.",
      "ru": "Топология определяет эффективность сети и способ связи между устройствами.",
      "en": "Topology determines network efficiency and the connection method between devices."
    },
    "specific_concepts": {
      "kk": ["жұлдыз топологиясы", "сақина топологиясы"],
      "ru": ["топология «звезда»", "топология «кольцо»"],
      "en": ["star topology", "ring topology"]
    },
    "associative": {
      "kk": ["байланыс", "құрылғы"],
      "ru": ["связь", "устройства"],
      "en": ["connection", "devices"]
    }
  }
},
    {
  "kk": "Жұлдыз топологиясы",
  "ru": "Топология «звезда»",
  "en": "Star Topology",
  "definition": {
    "kk": "Жұлдыз топологиясы – желідегі барлық құрылғылар орталық торапқа (хаб немесе коммутатор) қосылатын топология түрі.",
    "ru": "Топология «звезда» – это тип топологии, при котором все устройства в сети подключаются к центральному узлу (хабу или коммутатору).",
    "en": "Star topology is a type of network topology where all devices are connected to a central hub or switch."
  },
  "example": {
    "kk": "Жұлдыз топологиясында бір құрылғы істен шықса, бұл желінің басқа құрылғыларына әсер етпейді.",
    "ru": "При топологии «звезда» выход одного устройства из строя не влияет на работу других устройств сети.",
    "en": "In star topology, the failure of one device does not affect the rest of the network."
  },
  "relations": {
    "synonyms": ["орталық топология"],
    "general_concept": {
      "kk": "Жұлдыз топологиясы тиімді байланыс пен басқаруды қамтамасыз етеді.",
      "ru": "Топология «звезда» обеспечивает эффективную связь и управление.",
      "en": "Star topology ensures efficient communication and management."
    },
    "specific_concepts": {
      "kk": ["хаб", "коммутатор"],
      "ru": ["хаб", "коммутатор"],
      "en": ["hub", "switch"]
    },
    "associative": {
      "kk": ["желілік құрылым", "байланыс"],
      "ru": ["сетевая структура", "связь"],
      "en": ["network structure", "connection"]
    }
  }
},
{
  "kk": "Шеңберлі топологиясы",
  "ru": "Кольцевая топология",
  "en": "Ring Topology",
  "definition": {
    "kk": "Шеңберлі топологиясы – барлық құрылғылар бір-бірімен тізбектей қосылып, соңғы құрылғы бірінші құрылғыға қосылатын топология түрі.",
    "ru": "Кольцевая топология – это тип топологии, при котором все устройства соединены последовательно, а последнее устройство подключено к первому.",
    "en": "Ring topology is a type of network topology where all devices are connected sequentially, and the last device connects back to the first."
  },
  "example": {
    "kk": "Шеңберлі топологиясында бір байланыс үзілсе, бүкіл желі істен шығады.",
    "ru": "При кольцевой топологии разрыв одного соединения приводит к выходу всей сети из строя.",
    "en": "In ring topology, a single connection failure disrupts the entire network."
  },
  "relations": {
    "synonyms": ["тізбектелген топология"],
    "general_concept": {
      "kk": "Шеңберлі топологиясы деректерді ретімен жіберуді қамтамасыз етеді.",
      "ru": "Кольцевая топология обеспечивает последовательную передачу данных.",
      "en": "Ring topology ensures sequential data transmission."
    },
    "specific_concepts": {
      "kk": ["деректерді жіберу", "байланыс"],
      "ru": ["передача данных", "связь"],
      "en": ["data transmission", "connection"]
    },
    "associative": {
      "kk": ["тұрақтылық", "реттілік"],
      "ru": ["устойчивость", "последовательность"],
      "en": ["stability", "sequence"]
    }
  }
},
{
  "kk": "Шина топологиясы",
  "ru": "Шинная топология",
  "en": "Bus Topology",
  "definition": {
    "kk": "Шина топологиясы – барлық құрылғылар деректерді бір жалпы кабель арқылы бөлісетін желі топологиясы.",
    "ru": "Шинная топология – это тип топологии, при котором все устройства разделяют один общий кабель для передачи данных.",
    "en": "Bus topology is a type of network topology where all devices share a single common cable for data transmission."
  },
  "example": {
    "kk": "Шина топологиясында кабельдің зақымдалуы бүкіл желінің жұмысын тоқтатады.",
    "ru": "При шинной топологии повреждение кабеля приводит к остановке всей сети.",
    "en": "In bus topology, cable damage can cause the entire network to stop functioning."
  },
  "relations": {
    "synonyms": ["ортақ кабель"],
    "general_concept": {
      "kk": "Шина топологиясы қарапайым және арзан болып табылады.",
      "ru": "Шинная топология является простой и недорогой.",
      "en": "Bus topology is simple and inexpensive."
    },
    "specific_concepts": {
      "kk": ["кабель", "деректер"],
      "ru": ["кабель", "данные"],
      "en": ["cable", "data"]
    },
    "associative": {
      "kk": ["қарапайымдылық", "тиімділік"],
      "ru": ["простота", "эффективность"],
      "en": ["simplicity", "efficiency"]
    }
  }
},
    {
      "kk": "IP адрес",
      "ru": "IP-адрес",
      "en": "IP Address",
      "definition": {
        "kk": "Құрылғыны желіде тану үшін пайдаланылатын сандық идентификатор.",
        "ru": "Цифровой идентификатор устройства в сети.",
        "en": "A numerical identifier used to recognize a device on a network."
      },
      "example": {
        "kk": "Серверге қосылу үшін IP адрес қажет.",
        "ru": "Для подключения к серверу требуется IP-адрес.",
        "en": "An IP address is needed to connect to a server."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Маршрутизатор",
      "ru": "Маршрутизатор",
      "en": "Router",
      "definition": {
        "kk": "Желінің деректерін тасымалдауға арналған құрылғы.",
        "ru": "Устройство для передачи данных в сети.",
        "en": "A device used for transmitting data in a network."
      },
      "example": {
        "kk": "Маршрутизатор бірнеше құрылғыларға интернетті жеткізеді.",
        "ru": "Маршрутизатор распределяет интернет на несколько устройств.",
        "en": "A router distributes internet to multiple devices."
      },
      "image": "",
      "source": ""
    },
    {
  "kk": "Шлюз",
  "ru": "Шлюз",
  "en": "Gateway",
  "definition": {
    "kk": "Шлюз – желілер арасындағы деректер алмасуды қамтамасыз ететін құрылғы немесе бағдарлама.",
    "ru": "Шлюз — это устройство или программа, обеспечивающие обмен данными между сетями.",
    "en": "Gateway is a device or software that enables data exchange between networks."
  },
  "example": {
    "kk": "Шлюз арқылы жергілікті желі мен интернет арасында байланыс орнатылады.",
    "ru": "С помощью шлюза устанавливается связь между локальной сетью и интернетом.",
    "en": "A gateway establishes communication between a local network and the internet."
  },
  "relations": {
    "synonyms": ["желілік шлюз"],
    "general_concept": {
      "kk": "Шлюз деректерді түрлендіру және маршруттау функциясын орындайды.",
      "ru": "Шлюз выполняет функции преобразования и маршрутизации данных.",
      "en": "Gateway performs data conversion and routing functions."
    },
    "specific_concepts": {
      "kk": ["желілік байланыс", "деректер алмасу"],
      "ru": ["сетевое соединение", "обмен данными"],
      "en": ["network connection", "data exchange"]
    },
    "associative": {
      "kk": ["байланыс", "технология"],
      "ru": ["связь", "технологии"],
      "en": ["connection", "technology"]
    }
  }
},
    {
      "kk": "Брандмауэр",
      "ru": "Брандмауэр",
      "en": "Firewall",
      "definition": {
        "kk": "Желіні рұқсатсыз қол жеткізуден қорғауға арналған жүйе.",
        "ru": "Система защиты сети от несанкционированного доступа.",
        "en": "A system that protects the network from unauthorized access."
      },
      "example": {
        "kk": "Брандмауэр зиянды шабуылдардан қорғайды.",
        "ru": "Брандмауэр защищает от вредоносных атак.",
        "en": "A firewall protects against malicious attacks."
      },
      "image": "",
      "source": ""
    }
  ],
  "Дәріс 6. Бұлтты және мобильді технологиялар": [
  {
  "kk": "Бұлтты есептеулер",
  "ru": "Облачные вычисления",
  "en": "Cloud Computing",
  "definition": {
    "kk": "Бұлтты есептеулер – интернет арқылы деректерді өңдеу, сақтау және басқару қызметтерін ұсынатын технология.",
    "ru": "Облачные вычисления – технология предоставления услуг обработки, хранения и управления данными через интернет.",
    "en": "Cloud computing is a technology that offers data processing, storage, and management services over the internet."
  },
  "example": {
    "kk": "Google Drive бұлтты есептеулердің бір түрі болып табылады.",
    "ru": "Google Drive является одним из видов облачных вычислений.",
    "en": "Google Drive is an example of cloud computing."
  },
  "relations": {
    "synonyms": ["онлайн қызметтер"],
    "general_concept": {
      "kk": "Бұлтты есептеулер деректерді сақтау үшін интернет арқылы қол жетімді платформа.",
      "ru": "Облачные вычисления — это платформа для хранения данных через интернет.",
      "en": "Cloud computing is a platform for storing data accessible via the internet."
    },
    "specific_concepts": {
      "kk": ["деректер сақтау", "бұлт"],
      "ru": ["хранение данных", "облако"],
      "en": ["data storage", "cloud"]
    },
    "associative": {
      "kk": ["онлайн орта", "қолжетімділік"],
      "ru": ["онлайн среда", "доступность"],
      "en": ["online environment", "accessibility"]
    }
  }
},
    {
  "kk": "Бұлтты сақтау",
  "ru": "Облачное хранилище",
  "en": "Cloud Storage",
  "definition": {
    "kk": "Бұлтты сақтау – деректерді интернет арқылы қол жетімді орталықтандырылған серверлерде сақтау қызметі.",
    "ru": "Облачное хранилище — это услуга хранения данных на централизованных серверах, доступных через интернет.",
    "en": "Cloud storage is a service for storing data on centralized servers accessible via the internet."
  },
  "example": {
    "kk": "Dropbox деректерді бұлтта сақтауға мүмкіндік береді.",
    "ru": "Dropbox позволяет хранить данные в облаке.",
    "en": "Dropbox enables cloud-based data storage."
  },
  "relations": {
    "synonyms": ["онлайн сақтау"],
    "general_concept": {
      "kk": "Бұлтты сақтау деректерге кез келген жерден қол жеткізуге мүмкіндік береді.",
      "ru": "Облачное хранилище позволяет получать доступ к данным из любой точки.",
      "en": "Cloud storage allows access to data from anywhere."
    },
    "specific_concepts": {
      "kk": ["сервер", "қолжетімділік"],
      "ru": ["сервер", "доступ"],
      "en": ["server", "access"]
    },
    "associative": {
      "kk": ["ресурстар", "құрал"],
      "ru": ["ресурсы", "инструмент"],
      "en": ["resources", "tool"]
    }
  }
},
{
  "kk": "Бұлтты платформалар",
  "ru": "Облачные платформы",
  "en": "Cloud Platforms",
  "definition": {
    "kk": "Бұлтты платформалар – бұлтты технологиялар арқылы бағдарламалар мен қызметтерді іске асыруға арналған орталар.",
    "ru": "Облачные платформы — это среды для запуска программ и сервисов через облачные технологии.",
    "en": "Cloud platforms are environments for running applications and services using cloud technologies."
  },
  "example": {
    "kk": "Amazon AWS – бұлтты платформалардың бірі.",
    "ru": "Amazon AWS — одна из облачных платформ.",
    "en": "Amazon AWS is one of the cloud platforms."
  },
  "relations": {
    "synonyms": ["онлайн платформалар"],
    "general_concept": {
      "kk": "Бұлтты платформалар қолданушыларға көптеген ресурстарды ұсынады.",
      "ru": "Облачные платформы предоставляют пользователям множество ресурсов.",
      "en": "Cloud platforms offer users a variety of resources."
    },
    "specific_concepts": {
      "kk": ["бағдарламалар", "ресурстар"],
      "ru": ["программы", "ресурсы"],
      "en": ["applications", "resources"]
    },
    "associative": {
      "kk": ["қолжетімділік", "инновация"],
      "ru": ["доступ", "инновация"],
      "en": ["access", "innovation"]
    }
  }
},

   {
  "kk": "Мобильді қосымшалар",
  "ru": "Мобильные приложения",
  "en": "Mobile Applications",
  "definition": {
    "kk": "Мобильді қосымшалар – смартфондар мен планшеттерде пайдалануға арналған бағдарламалық қамтамасыз ету.",
    "ru": "Мобильные приложения – это программное обеспечение, предназначенное для использования на смартфонах и планшетах.",
    "en": "Mobile applications are software designed for use on smartphones and tablets."
  },
  "example": {
    "kk": "Instagram – танымал мобильді қосымша.",
    "ru": "Instagram — популярное мобильное приложение.",
    "en": "Instagram is a popular mobile application."
  },
  "relations": {
    "synonyms": ["мобильді бағдарлама"],
    "general_concept": {
      "kk": "Мобильді қосымшалар смартфондар мен планшеттерді пайдалануды жеңілдетеді.",
      "ru": "Мобильные приложения упрощают использование смартфонов и планшетов.",
      "en": "Mobile applications simplify the use of smartphones and tablets."
    },
    "specific_concepts": {
      "kk": ["смартфон", "платформа"],
      "ru": ["смартфон", "платформа"],
      "en": ["smartphone", "platform"]
    },
    "associative": {
      "kk": ["жүктеу", "қолдану"],
      "ru": ["скачивание", "использование"],
      "en": ["download", "usage"]
    }
  }
},
    {
  "kk": "Мобилді қызметтер",
  "ru": "Мобильные сервисы",
  "en": "Mobile Services",
  "definition": {
    "kk": "Мобилді қызметтер – смартфондар мен басқа да мобильді құрылғыларға ұсынылатын онлайн сервистер.",
    "ru": "Мобильные сервисы — это онлайн-сервисы, предоставляемые для смартфонов и других мобильных устройств.",
    "en": "Mobile services are online services provided for smartphones and other mobile devices."
  },
  "example": {
    "kk": "Мобилді банк қызметтері арқылы шоттарды бақылауға болады.",
    "ru": "Через мобильные банковские сервисы можно отслеживать счета.",
    "en": "Mobile banking services allow tracking of accounts."
  },
  "relations": {
    "synonyms": ["онлайн қызметтер"],
    "general_concept": {
      "kk": "Мобилді қызметтер пайдаланушыларға ыңғайлы шешімдер ұсынады.",
      "ru": "Мобильные сервисы предоставляют удобные решения для пользователей.",
      "en": "Mobile services provide convenient solutions for users."
    },
    "specific_concepts": {
      "kk": ["смартфон", "интернет"],
      "ru": ["смартфон", "интернет"],
      "en": ["smartphone", "internet"]
    },
    "associative": {
      "kk": ["қолдану", "қолжетімділік"],
      "ru": ["использование", "доступ"],
      "en": ["usage", "access"]
    }
  }
},

 {
  "kk": "Виртуалды машина",
  "ru": "Виртуальная машина",
  "en": "Virtual Machine",
  "definition": {
    "kk": "Виртуалды машина – физикалық компьютердің ресурстарын пайдалана отырып, тәуелсіз операциялық жүйені іске асыратын бағдарламалық жүйе.",
    "ru": "Виртуальная машина – это программная система, запускающая независимую операционную систему, используя ресурсы физического компьютера.",
    "en": "A virtual machine is software that runs an independent operating system using the resources of a physical computer."
  },
  "example": {
    "kk": "VMware виртуалды машиналарды басқаруға арналған платформа болып табылады.",
    "ru": "VMware — это платформа для управления виртуальными машинами.",
    "en": "VMware is a platform for managing virtual machines."
  },
  "relations": {
    "synonyms": ["виртуалды операциялық жүйе"],
    "general_concept": {
      "kk": "Виртуалды машина деректерді тәуелсіз ортада өңдейді.",
      "ru": "Виртуальная машина обрабатывает данные в независимой среде.",
      "en": "Virtual machines process data in an independent environment."
    },
    "specific_concepts": {
      "kk": ["операциялық жүйе", "ресурстар"],
      "ru": ["операционная система", "ресурсы"],
      "en": ["operating system", "resources"]
    },
    "associative": {
      "kk": ["тәуелсіздік", "құрал"],
      "ru": ["независимость", "инструмент"],
      "en": ["independence", "tool"]
    }
  }
},
{
  "kk": "Мобильді байланыс",
  "ru": "Мобильная связь",
  "en": "Mobile Communication",
  "definition": {
    "kk": "Мобильді байланыс – ұялы желі арқылы ақпаратты беру және алу технологиясы.",
    "ru": "Мобильная связь – это технология передачи и получения информации через сотовую сеть.",
    "en": "Mobile communication is the technology for transmitting and receiving information via a cellular network."
  },
  "example": {
    "kk": "5G мобильді байланыс жылдамдығын арттырады.",
    "ru": "5G увеличивает скорость мобильной связи.",
    "en": "5G enhances the speed of mobile communication."
  },
  "relations": {
    "synonyms": ["ұялы байланыс"],
    "general_concept": {
      "kk": "Мобильді байланыс адамдар арасында байланыс орнатуға мүмкіндік береді.",
      "ru": "Мобильная связь позволяет устанавливать связь между людьми.",
      "en": "Mobile communication allows establishing connections between people."
    },
    "specific_concepts": {
      "kk": ["5G", "смартфон"],
      "ru": ["5G", "смартфон"],
      "en": ["5G", "smartphone"]
    },
    "associative": {
      "kk": ["жылдамдық", "желілер"],
      "ru": ["скорость", "сети"],
      "en": ["speed", "networks"]
    }
  }
},
{
  "kk": "Мобильді құрылғылар",
  "ru": "Мобильные устройства",
  "en": "Mobile Devices",
  "definition": {
    "kk": "Мобильді құрылғылар – ұялы телефон, планшет және смарт-сағат сияқты портативті электронды құрылғылар.",
    "ru": "Мобильные устройства — это портативные электронные устройства, такие как мобильные телефоны, планшеты и смарт-часы.",
    "en": "Mobile devices are portable electronic devices such as mobile phones, tablets, and smartwatches."
  },
  "example": {
    "kk": "Мобильді құрылғылар арқылы интернетке қосылуға болады.",
    "ru": "Через мобильные устройства можно подключаться к интернету.",
    "en": "Mobile devices allow internet connectivity."
  },
  "relations": {
    "synonyms": ["ұялы құрылғылар"],
    "general_concept": {
      "kk": "Мобильді құрылғылар адамдарға байланыста болуға мүмкіндік береді.",
      "ru": "Мобильные устройства позволяют людям оставаться на связи.",
      "en": "Mobile devices allow people to stay connected."
    },
    "specific_concepts": {
      "kk": ["смартфон", "планшет"],
      "ru": ["смартфон", "планшет"],
      "en": ["smartphone", "tablet"]
    },
    "associative": {
      "kk": ["портативтілік", "байланыс"],
      "ru": ["портативность", "связь"],
      "en": ["portability", "connection"]
    }
  }
}
  ],
  
  "Дәріс 7. Smart технологиялар": [
  {
  "kk": "SMART технология",
  "ru": "SMART технология",
  "en": "SMART Technology",
  "definition": {
    "kk": "SMART технология – білім беру, бизнес және тұрмыстық жағдайлар үшін интерактивті және интеллектуалды шешімдер ұсынатын инновациялық технологиялар жиынтығы.",
    "ru": "SMART технология — это совокупность инновационных технологий, предлагающих интерактивные и интеллектуальные решения для образования, бизнеса и бытовых нужд.",
    "en": "SMART technology is a collection of innovative technologies offering interactive and intelligent solutions for education, business, and household needs."
  },
  "example": {
    "kk": "SMART тақталар оқушылар мен мұғалімдердің оқу процесін жеңілдетеді.",
    "ru": "SMART-доски упрощают процесс обучения для учеников и учителей.",
    "en": "SMART boards simplify the learning process for students and teachers."
  },
  "relations": {
    "synonyms": ["интерактивті технология"],
    "general_concept": {
      "kk": "SMART технология білім беру мен кәсіпкерлік салаларында тиімділікті арттырады.",
      "ru": "SMART технология увеличивает эффективность в области образования и бизнеса.",
      "en": "SMART technology enhances efficiency in education and business."
    },
    "specific_concepts": {
      "kk": ["интерактивті тақта", "ақылды шешімдер"],
      "ru": ["интерактивные доски", "умные решения"],
      "en": ["interactive boards", "smart solutions"]
    },
    "associative": {
      "kk": ["инновация", "технология"],
      "ru": ["инновации", "технологии"],
      "en": ["innovation", "technology"]
    }
  }
},
    {
  "kk": "SMART үй",
  "ru": "Умный дом",
  "en": "Smart Home",
  "definition": {
    "kk": "SMART үй – тұрмыстық құрылғылар мен жүйелерді автоматтандыру және қашықтан басқару мүмкіндігін ұсынатын технология.",
    "ru": "Умный дом — это технология автоматизации и удалённого управления бытовыми устройствами и системами.",
    "en": "Smart home is a technology that provides automation and remote control of household devices and systems."
  },
  "example": {
    "kk": "SMART үйде жарықтандыруды смартфон арқылы басқаруға болады.",
    "ru": "В умном доме можно управлять освещением через смартфон.",
    "en": "In a smart home, lighting can be controlled through a smartphone."
  },
  "relations": {
    "synonyms": ["ақылды үй"],
    "general_concept": {
      "kk": "SMART үй тұрмыстық жайлылықты арттырады және энергия тиімділігін қамтамасыз етеді.",
      "ru": "Умный дом повышает бытовой комфорт и обеспечивает энергоэффективность.",
      "en": "Smart home enhances household comfort and ensures energy efficiency."
    },
    "specific_concepts": {
      "kk": ["ақылды құрылғылар", "автоматтандыру"],
      "ru": ["умные устройства", "автоматизация"],
      "en": ["smart devices", "automation"]
    },
    "associative": {
      "kk": ["қашықтан басқару", "технология"],
      "ru": ["удалённое управление", "технологии"],
      "en": ["remote control", "technology"]
    }
  }
},
{
  "kk": "Ақылды құрылғылар",
  "ru": "Умные устройства",
  "en": "Smart Devices",
  "definition": {
    "kk": "Ақылды құрылғылар – интернетке қосылып, пайдаланушыларға қосымша мүмкіндіктер мен деректер алмасуды ұсынатын электронды құрылғылар.",
    "ru": "Умные устройства — это электронные устройства, подключённые к интернету, предлагающие дополнительные возможности и обмен данными.",
    "en": "Smart devices are electronic gadgets connected to the internet that offer additional features and data exchange."
  },
  "example": {
    "kk": "Ақылды сағаттар пайдаланушыларға денсаулық деректерін бақылауға мүмкіндік береді.",
    "ru": "Умные часы позволяют пользователям отслеживать данные о здоровье.",
    "en": "Smartwatches enable users to monitor health data."
  },
  "relations": {
    "synonyms": ["ақылды гаджеттер"],
    "general_concept": {
      "kk": "Ақылды құрылғылар өмір сапасын жақсартады.",
      "ru": "Умные устройства улучшают качество жизни.",
      "en": "Smart devices improve the quality of life."
    },
    "specific_concepts": {
      "kk": ["смартфон", "сағат"],
      "ru": ["смартфон", "часы"],
      "en": ["smartphone", "watch"]
    },
    "associative": {
      "kk": ["қосымшалар", "пайдалану"],
      "ru": ["приложения", "использование"],
      "en": ["applications", "usage"]
    }
  }
},
{
  "kk": "Wi-Fi",
  "ru": "Wi-Fi",
  "en": "Wi-Fi",
  "definition": {
    "kk": "Wi-Fi – сымсыз желілер арқылы деректерді жоғары жылдамдықта беруді қамтамасыз ететін технология.",
    "ru": "Wi-Fi — это технология, обеспечивающая передачу данных на высокой скорости через беспроводные сети.",
    "en": "Wi-Fi is a technology that provides high-speed data transfer over wireless networks."
  },
  "example": {
    "kk": "Wi-Fi қосылымы арқылы интернетке сымсыз қол жеткізуге болады.",
    "ru": "Через подключение Wi-Fi можно получить беспроводной доступ к интернету.",
    "en": "Wi-Fi connection allows wireless access to the internet."
  },
  "relations": {
    "synonyms": ["сымсыз желі"],
    "general_concept": {
      "kk": "Wi-Fi технологиясы пайдаланушыларды кабельдерден босатады және мобильділікке мүмкіндік береді.",
      "ru": "Технология Wi-Fi освобождает пользователей от проводов и обеспечивает мобильность.",
      "en": "Wi-Fi technology frees users from cables and enables mobility."
    },
    "specific_concepts": {
      "kk": ["роутер", "сымсыз желі"],
      "ru": ["роутер", "беспроводная сеть"],
      "en": ["router", "wireless network"]
    },
    "associative": {
      "kk": ["интернет", "қол жетімділік"],
      "ru": ["интернет", "доступ"],
      "en": ["internet", "access"]
    }
  }
},

   {
  "kk": "Блокчейн",
  "ru": "Блокчейн",
  "en": "Blockchain",
  "definition": {
    "kk": "Блокчейн – ақпараттың сақталуын және қауіпсіздігін қамтамасыз ететін, транзакцияларды тексеру үшін қолданылатын таралған деректер базасы технологиясы.",
    "ru": "Блокчейн — это технология распределённой базы данных, обеспечивающая сохранность и безопасность информации и проверку транзакций.",
    "en": "Blockchain is a distributed database technology that ensures the security and integrity of information while verifying transactions."
  },
  "example": {
    "kk": "Блокчейн криптовалюталар транзакцияларын қауіпсіз етуде маңызды рөл атқарады.",
    "ru": "Блокчейн играет важную роль в обеспечении безопасности транзакций с криптовалютами.",
    "en": "Blockchain plays a vital role in securing cryptocurrency transactions."
  },
  "relations": {
    "synonyms": ["таратылған журнал"],
    "general_concept": {
      "kk": "Блокчейн технологиясы деректердің өзгермейтіндігін қамтамасыз етеді.",
      "ru": "Технология блокчейн обеспечивает неизменяемость данных.",
      "en": "Blockchain technology ensures data immutability."
    },
    "specific_concepts": {
      "kk": ["криптовалюта", "транзакция"],
      "ru": ["криптовалюта", "транзакция"],
      "en": ["cryptocurrency", "transaction"]
    },
    "associative": {
      "kk": ["қауіпсіздік", "сенімділік"],
      "ru": ["безопасность", "надёжность"],
      "en": ["security", "reliability"]
    }
  }
} 
  ],
  
  "Дәріс 8. Е - технологиялар": [
 {
  "kk": "Электрондық технология",
  "ru": "Электронные технологии",
  "en": "Electronic Technology",
  "definition": {
    "kk": "Электрондық технология – деректерді өңдеу, беру және сақтау үшін электронды құрылғылар мен жүйелерді пайдаланатын инновациялық шешімдер жиынтығы.",
    "ru": "Электронные технологии — это набор инновационных решений, использующих электронные устройства и системы для обработки, передачи и хранения данных.",
    "en": "Electronic technology is a set of innovative solutions using electronic devices and systems for data processing, transmission, and storage."
  },
  "example": {
    "kk": "Электрондық технологиялар арқылы өндіріс процесін автоматтандыру жүзеге асырылады.",
    "ru": "С помощью электронных технологий осуществляется автоматизация производственного процесса.",
    "en": "Electronic technologies enable the automation of production processes."
  },
  "relations": {
    "synonyms": ["цифрлық технологиялар"],
    "general_concept": {
      "kk": "Электрондық технологиялар ақпаратты басқару мен өндіріске тиімділік қосады.",
      "ru": "Электронные технологии повышают эффективность управления информацией и производства.",
      "en": "Electronic technologies enhance the efficiency of information management and production."
    },
    "specific_concepts": {
      "kk": ["құрылғылар", "инновация"],
      "ru": ["устройства", "инновации"],
      "en": ["devices", "innovation"]
    },
    "associative": {
      "kk": ["ақпарат", "интернет"],
      "ru": ["информация", "интернет"],
      "en": ["information", "internet"]
    }
  }
},
    {
  "kk": "Электронды білім беру",
  "ru": "Электронное образование",
  "en": "E-learning",
  "definition": {
    "kk": "Электронды білім беру – интернет пен электрондық құралдарды пайдалана отырып, оқу және оқыту процесін ұйымдастыру әдісі.",
    "ru": "Электронное образование — это способ организации процесса обучения и преподавания с использованием интернета и электронных инструментов.",
    "en": "E-learning is a method of organizing the learning and teaching process using the internet and electronic tools."
  },
  "example": {
    "kk": "Электронды білім беру платформалары оқушыларға қашықтан оқуға мүмкіндік береді.",
    "ru": "Платформы электронного образования позволяют ученикам учиться удалённо.",
    "en": "E-learning platforms enable students to learn remotely."
  },
  "relations": {
    "synonyms": ["электронды оқыту"],
    "general_concept": {
      "kk": "Электронды білім беру білім алуды икемді және қолжетімді етеді.",
      "ru": "Электронное образование делает процесс обучения гибким и доступным.",
      "en": "E-learning makes education flexible and accessible."
    },
    "specific_concepts": {
      "kk": ["қашықтан оқу", "онлайн курстар"],
      "ru": ["дистанционное обучение", "онлайн-курсы"],
      "en": ["distance learning", "online courses"]
    },
    "associative": {
      "kk": ["платформа", "мультимедиа"],
      "ru": ["платформа", "мультимедиа"],
      "en": ["platform", "multimedia"]
    }
  }
},
{
  "kk": "Электронды үкімет",
  "ru": "Электронное правительство",
  "en": "E-government",
  "definition": {
    "kk": "Электронды үкімет – азаматтар мен мемлекеттік органдар арасында қызмет көрсету процесін жеңілдету үшін ақпараттық технологияларды қолдану.",
    "ru": "Электронное правительство — это использование информационных технологий для упрощения процесса предоставления услуг гражданам и государственными органами.",
    "en": "E-government is the use of information technologies to simplify the service delivery process between citizens and government bodies."
  },
  "example": {
    "kk": "Электронды үкімет порталы арқылы салықтарды төлеуге болады.",
    "ru": "Через портал электронного правительства можно оплачивать налоги.",
    "en": "Taxes can be paid through the e-government portal."
  },
  "relations": {
    "synonyms": ["электронды әкімшілік"],
    "general_concept": {
      "kk": "Электронды үкімет азаматтарға жылдам және ыңғайлы қызметтер ұсынады.",
      "ru": "Электронное правительство предоставляет гражданам быстрые и удобные услуги.",
      "en": "E-government provides citizens with fast and convenient services."
    },
    "specific_concepts": {
      "kk": ["қызметтер", "ақпараттық жүйе"],
      "ru": ["услуги", "информационная система"],
      "en": ["services", "information system"]
    },
    "associative": {
      "kk": ["технология", "ресурстар"],
      "ru": ["технология", "ресурсы"],
      "en": ["technology", "resources"]
    }
  }
},
    {
  "kk": "Электронды сауда",
  "ru": "Электронная коммерция",
  "en": "E-commerce",
  "definition": {
    "kk": "Электронды сауда – интернет арқылы тауарлар мен қызметтерді сатып алу және сату процесі.",
    "ru": "Электронная коммерция — это процесс покупки и продажи товаров и услуг через интернет.",
    "en": "E-commerce is the process of buying and selling goods and services over the internet."
  },
  "example": {
    "kk": "Электронды сауда платформалары арқылы тапсырыстар жасауға болады.",
    "ru": "Через платформы электронной коммерции можно делать заказы.",
    "en": "Orders can be placed through e-commerce platforms."
  },
  "relations": {
    "synonyms": ["онлайн сауда"],
    "general_concept": {
      "kk": "Электронды сауда сауда-саттық процесін жеңілдетеді және уақыт үнемдейді.",
      "ru": "Электронная коммерция упрощает процесс торговли и экономит время.",
      "en": "E-commerce simplifies the trading process and saves time."
    },
    "specific_concepts": {
      "kk": ["онлайн дүкендер", "төлемдер"],
      "ru": ["онлайн-магазины", "платежи"],
      "en": ["online stores", "payments"]
    },
    "associative": {
      "kk": ["интернет", "қолжетімділік"],
      "ru": ["интернет", "доступ"],
      "en": ["internet", "access"]
    }
  }
},
    {
  "kk": "Портал",
  "ru": "Портал",
  "en": "Portal",
  "definition": {
    "kk": "Портал – интернет немесе интранет арқылы пайдаланушыларға белгілі бір тақырып бойынша ақпарат пен қызметтер ұсынатын веб-құрал.",
    "ru": "Портал — это веб-инструмент, предоставляющий пользователям информацию и услуги по определённой теме через интернет или интранет.",
    "en": "A portal is a web tool that provides users with information and services on a specific topic through the internet or intranet."
  },
  "example": {
    "kk": "Е-үкімет порталы арқылы азаматтар мемлекеттік қызметтерге қол жеткізе алады.",
    "ru": "Через портал электронного правительства граждане могут получить доступ к государственным услугам.",
    "en": "Through the e-government portal, citizens can access public services."
  },
  "relations": {
    "synonyms": ["веб-платформа"],
    "general_concept": {
      "kk": "Порталдар пайдаланушыларға қажетті ақпаратты бір жерден алуға мүмкіндік береді.",
      "ru": "Порталы позволяют пользователям получать необходимую информацию в одном месте.",
      "en": "Portals allow users to access necessary information in one place."
    },
    "specific_concepts": {
      "kk": ["ақпараттық жүйе", "қызметтер"],
      "ru": ["информационная система", "услуги"],
      "en": ["information system", "services"]
    },
    "associative": {
      "kk": ["интернет", "қолжетімділік"],
      "ru": ["интернет", "доступ"],
      "en": ["internet", "access"]
    }
  }
},
{
  "kk": "Провайдинг",
  "ru": "Провайдинг",
  "en": "Providing",
  "definition": {
    "kk": "Провайдинг – пайдаланушыларға интернет, байланыс, бұлттық қызметтер немесе басқа да ресурстарды ұсыну процесі.",
    "ru": "Провайдинг — это процесс предоставления пользователям интернета, связи, облачных услуг или других ресурсов.",
    "en": "Providing is the process of delivering internet, communication, cloud services, or other resources to users."
  },
  "example": {
    "kk": "Интернет провайдинг қызметтері арқылы үйге интернет қосуға болады.",
    "ru": "С помощью услуг интернет-провайдинга можно подключить интернет домой.",
    "en": "Internet providing services can be used to connect internet at home."
  },
  "relations": {
    "synonyms": ["қызмет көрсету"],
    "general_concept": {
      "kk": "Провайдинг пайдаланушылардың ресурстарға қол жеткізуін қамтамасыз етеді.",
      "ru": "Провайдинг обеспечивает доступ пользователей к ресурсам.",
      "en": "Providing ensures user access to resources."
    },
    "specific_concepts": {
      "kk": ["интернет", "бұлттық қызмет"],
      "ru": ["интернет", "облачные услуги"],
      "en": ["internet", "cloud services"]
    },
    "associative": {
      "kk": ["қолжетімділік", "байланыс"],
      "ru": ["доступ", "связь"],
      "en": ["access", "connection"]
    }
  }
}

  ],
    "Дәріс 9. Internet технологиялар": [
    {
  "kk": "Интернет",
  "ru": "Интернет",
  "en": "Internet",
  "definition": {
    "kk": "Интернет – бүкіл әлемдегі компьютерлер мен желілерді байланыстыратын жаһандық ақпараттық желі.",
    "ru": "Интернет — это глобальная информационная сеть, соединяющая компьютеры и сети по всему миру.",
    "en": "The Internet is a global information network that connects computers and networks worldwide."
  },
  "example": {
    "kk": "Интернет арқылы ақпарат алмасуға және байланыс орнатуға болады.",
    "ru": "С помощью интернета можно обмениваться информацией и устанавливать связь.",
    "en": "The Internet allows information exchange and communication."
  },
  "relations": {
    "synonyms": ["бүкіләлемдік желі"],
    "general_concept": {
      "kk": "Интернет деректер алмасудың басты платформасы болып табылады.",
      "ru": "Интернет является основной платформой для обмена данными.",
      "en": "The Internet serves as the primary platform for data exchange."
    },
    "specific_concepts": {
      "kk": ["веб-сайт", "электронды пошта"],
      "ru": ["веб-сайт", "электронная почта"],
      "en": ["website", "email"]
    },
    "associative": {
      "kk": ["қол жетімділік", "байланыс"],
      "ru": ["доступ", "связь"],
      "en": ["access", "connection"]
    }
  }
},
  {
  "kk": "TCP құжаты",
  "ru": "TCP-документ",
  "en": "TCP Document",
  "definition": {
    "kk": "TCP құжаты – Интернеттегі деректерді жіберу және қабылдау үшін пайдаланылатын Трансмиссиялық басқару протоколының сипаттамаларын анықтайтын техникалық құжат.",
    "ru": "TCP-документ — это технический документ, определяющий спецификации протокола управления передачей для отправки и получения данных в интернете.",
    "en": "A TCP document is a technical document that specifies the Transmission Control Protocol for sending and receiving data over the internet."
  },
  "example": {
    "kk": "TCP құжаты Интернетте сенімді байланыс орнатуға мүмкіндік береді.",
    "ru": "TCP-документ позволяет устанавливать надёжные соединения в интернете.",
    "en": "A TCP document enables reliable connections over the Internet."
  },
  "relations": {
    "synonyms": ["TCP стандарты"],
    "general_concept": {
      "kk": "TCP деректер пакеттерін басқаруды және сенімді жеткізуді қамтамасыз етеді.",
      "ru": "TCP обеспечивает управление пакетами данных и их надёжную доставку.",
      "en": "TCP ensures data packet management and reliable delivery."
    },
    "specific_concepts": {
      "kk": ["желілер", "протокол"],
      "ru": ["сети", "протокол"],
      "en": ["networks", "protocol"]
    },
    "associative": {
      "kk": ["деректер", "қосылу"],
      "ru": ["данные", "подключение"],
      "en": ["data", "connection"]
    }
  }
},
   {
  "kk": "ARPANET",
  "ru": "ARPANET",
  "en": "ARPANET",
  "definition": {
    "kk": "ARPANET – АҚШ-тың Қорғаныс министрлігі құрған алғашқы компьютерлік желі, ол қазіргі Интернеттің негізін қалады.",
    "ru": "ARPANET — это первая компьютерная сеть, созданная Министерством обороны США, которая положила основу современному интернету.",
    "en": "ARPANET was the first computer network created by the U.S. Department of Defense, laying the foundation for the modern Internet."
  },
  "example": {
    "kk": "ARPANET ғылыми-зерттеу мақсатында қолданылды.",
    "ru": "ARPANET использовалась для научных исследований.",
    "en": "ARPANET was used for research purposes."
  },
  "relations": {
    "synonyms": ["алғашқы желі"],
    "general_concept": {
      "kk": "ARPANET қазіргі интернет технологияларының дамуына негіз болды.",
      "ru": "ARPANET стала основой для развития современных интернет-технологий.",
      "en": "ARPANET formed the basis for the development of modern internet technologies."
    },
    "specific_concepts": {
      "kk": ["деректер алмасу", "ғылым"],
      "ru": ["обмен данными", "наука"],
      "en": ["data exchange", "science"]
    },
    "associative": {
      "kk": ["тарих", "инновация"],
      "ru": ["история", "инновация"],
      "en": ["history", "innovation"]
    }
  }
},
  {
  "kk": "FTP",
  "ru": "FTP",
  "en": "FTP",
  "definition": {
    "kk": "FTP (Файлдарды тасымалдау протоколы) – интернет арқылы файлдарды жіберу және қабылдау үшін пайдаланылатын стандартты желілік протокол.",
    "ru": "FTP (Протокол передачи файлов) — это стандартный сетевой протокол для отправки и получения файлов через интернет.",
    "en": "FTP (File Transfer Protocol) is a standard network protocol used to send and receive files over the Internet."
  },
  "example": {
    "kk": "FTP сервері файлдарды орталықтандырылған түрде сақтауға мүмкіндік береді.",
    "ru": "FTP-сервер позволяет централизованно хранить файлы.",
    "en": "An FTP server allows centralized file storage."
  },
  "relations": {
    "synonyms": ["файлдарды тасымалдау"],
    "general_concept": {
      "kk": "FTP үлкен көлемдегі файлдарды беру үшін қолданылады.",
      "ru": "FTP используется для передачи файлов большого объёма.",
      "en": "FTP is used for transferring large files."
    },
    "specific_concepts": {
      "kk": ["сервер", "желілер"],
      "ru": ["сервер", "сети"],
      "en": ["server", "networks"]
    },
    "associative": {
      "kk": ["деректер", "қолжетімділік"],
      "ru": ["данные", "доступ"],
      "en": ["data", "access"]
    }
  }
},
      {
  "kk": "Электронды пошта",
  "ru": "Электронная почта",
  "en": "Email",
  "definition": {
    "kk": "Электронды пошта – интернет арқылы мәтіндік хабарламалар мен файлдарды жіберуге және алуға мүмкіндік беретін байланыс құралы.",
    "ru": "Электронная почта — это средство связи, позволяющее отправлять и получать текстовые сообщения и файлы через интернет.",
    "en": "Email is a communication tool that allows sending and receiving text messages and files via the internet."
  },
  "example": {
    "kk": "Электронды пошта арқылы құжаттарды әріптестермен бөлісуге болады.",
    "ru": "Через электронную почту можно делиться документами с коллегами.",
    "en": "Email can be used to share documents with colleagues."
  },
  "relations": {
    "synonyms": ["E-mail", "цифрлық пошта"],
    "general_concept": {
      "kk": "Электронды пошта ресми және бейресми байланыс үшін кең таралған құрал.",
      "ru": "Электронная почта широко используется для официальной и неофициальной связи.",
      "en": "Email is widely used for formal and informal communication."
    },
    "specific_concepts": {
      "kk": ["хабарламалар", "желі"],
      "ru": ["сообщения", "сеть"],
      "en": ["messages", "network"]
    },
    "associative": {
      "kk": ["байланыс", "құжат алмасу"],
      "ru": ["связь", "обмен документами"],
      "en": ["communication", "document exchange"]
    }
  }
},
{
  "kk": "ІР (Internet Protocol)",
  "ru": "IP (Интернет-протокол)",
  "en": "IP (Internet Protocol)",
  "definition": {
    "kk": "ІР – интернет арқылы деректер пакеттерінің жеткізілуін реттейтін байланыс ережелерінің жиынтығы.",
    "ru": "IP — это набор правил связи, регулирующих доставку пакетов данных через интернет.",
    "en": "IP is a set of communication rules that govern the delivery of data packets over the internet."
  },
  "example": {
    "kk": "ІР мекенжайы құрылғылар арасындағы деректер жіберуді анықтайды.",
    "ru": "IP-адрес определяет отправку данных между устройствами.",
    "en": "IP address identifies the data transmission between devices."
  },
  "relations": {
    "synonyms": ["Интернет протоколы"],
    "general_concept": {
      "kk": "ІР деректерді жіберу және маршруттау үшін жауапты.",
      "ru": "IP отвечает за передачу и маршрутизацию данных.",
      "en": "IP is responsible for transmitting and routing data."
    },
    "specific_concepts": {
      "kk": ["мекенжай", "деректер пакеттері"],
      "ru": ["адрес", "пакеты данных"],
      "en": ["address", "data packets"]
    },
    "associative": {
      "kk": ["байланыс", "желілер"],
      "ru": ["связь", "сети"],
      "en": ["connection", "networks"]
    }
  }
},
{
  "kk": "IP мекенжай",
  "ru": "IP-адрес",
  "en": "IP Address",
  "definition": {
    "kk": "IP мекенжай – желідегі әр құрылғыны бірегей идентификациялауға мүмкіндік беретін нөмір.",
    "ru": "IP-адрес — это номер, позволяющий уникально идентифицировать каждое устройство в сети.",
    "en": "IP Address is a unique number that identifies each device on a network."
  },
  "example": {
    "kk": "IP мекенжайды пайдаланып, интернеттегі құрылғылар арасындағы байланыс орнатылады.",
    "ru": "С помощью IP-адреса устанавливается связь между устройствами в интернете.",
    "en": "An IP address is used to establish communication between devices on the internet."
  },
  "relations": {
    "synonyms": ["желілік адрес"],
    "general_concept": {
      "kk": "IP мекенжай деректер пакеттерін бағыттау үшін маңызды.",
      "ru": "IP-адрес важен для маршрутизации пакетов данных.",
      "en": "IP addresses are essential for data packet routing."
    },
    "specific_concepts": {
      "kk": ["IPv4", "IPv6"],
      "ru": ["IPv4", "IPv6"],
      "en": ["IPv4", "IPv6"]
    },
    "associative": {
      "kk": ["желілік байланыс", "интернет"],
      "ru": ["сетевое соединение", "интернет"],
      "en": ["network connection", "internet"]
    }
  }
},
 {
  "kk": "DNS (Domain Name System)",
  "ru": "DNS (Система доменных имён)",
  "en": "DNS (Domain Name System)",
  "definition": {
    "kk": "DNS – домендік атауларды IP мекенжайларға түрлендіретін интернет жүйесі.",
    "ru": "DNS — это интернет-система, преобразующая доменные имена в IP-адреса.",
    "en": "DNS is an internet system that converts domain names into IP addresses."
  },
  "example": {
    "kk": "DNS арқылы \"example.com\" доменін нақты IP мекенжайға бағыттауға болады.",
    "ru": "С помощью DNS можно направить домен \"example.com\" на конкретный IP-адрес.",
    "en": "DNS can direct the domain \"example.com\" to a specific IP address."
  },
  "relations": {
    "synonyms": ["домендік атаулар жүйесі"],
    "general_concept": {
      "kk": "DNS интернетте домендік атауларды пайдалану үшін қолайлы етеді.",
      "ru": "DNS упрощает использование доменных имён в интернете.",
      "en": "DNS simplifies the use of domain names on the internet."
    },
    "specific_concepts": {
      "kk": ["домендер", "IP мекенжай"],
      "ru": ["домены", "IP-адрес"],
      "en": ["domains", "IP address"]
    },
    "associative": {
      "kk": ["желілік бағыттау", "интернет ресурстар"],
      "ru": ["сетевое маршрутизация", "ресурсы интернета"],
      "en": ["network routing", "internet resources"]
    }
  }
},
  {
  "kk": "URL (Uniform Resource Locator)",
  "ru": "URL (Единый указатель ресурса)",
  "en": "URL (Uniform Resource Locator)",
  "definition": {
    "kk": "URL – интернеттегі ресурстың орналасу орнын анықтайтын мәтіндік жол.",
    "ru": "URL — это текстовая строка, определяющая местоположение ресурса в интернете.",
    "en": "URL is a text string that specifies the location of a resource on the internet."
  },
  "example": {
    "kk": "https://example.com URL арқылы веб-сайтқа кіруге болады.",
    "ru": "С помощью URL https://example.com можно зайти на веб-сайт.",
    "en": "Using the URL https://example.com, you can access a website."
  },
  "relations": {
    "synonyms": ["веб мекенжай"],
    "general_concept": {
      "kk": "URL интернеттегі ресурсқа жылдам қолжетімділік ұсынады.",
      "ru": "URL предоставляет быстрый доступ к ресурсу в интернете.",
      "en": "URL provides quick access to a resource on the internet."
    },
    "specific_concepts": {
      "kk": ["веб-сайт", "хостинг"],
      "ru": ["веб-сайт", "хостинг"],
      "en": ["website", "hosting"]
    },
    "associative": {
      "kk": ["ресурстар", "интернет"],
      "ru": ["ресурсы", "интернет"],
      "en": ["resources", "internet"]
    }
  }
},
  {
  "kk": "HTTP (Hypertext Transfer Protocol)",
  "ru": "HTTP (Протокол передачи гипертекста)",
  "en": "HTTP (Hypertext Transfer Protocol)",
  "definition": {
    "kk": "HTTP – интернет арқылы гипермәтіндік ақпаратты жіберу және қабылдау үшін пайдаланылатын байланыс протоколы.",
    "ru": "HTTP — это протокол связи, используемый для отправки и получения гипертекстовой информации через интернет.",
    "en": "HTTP is a communication protocol used for transmitting and receiving hypertext information over the internet."
  },
  "example": {
    "kk": "HTTP веб-сервер мен браузер арасындағы байланыс орнатады.",
    "ru": "HTTP устанавливает связь между веб-сервером и браузером.",
    "en": "HTTP establishes communication between the web server and the browser."
  },
  "relations": {
    "synonyms": ["гипермәтіндік протокол"],
    "general_concept": {
      "kk": "HTTP веб-қызметтерді пайдалану үшін қажетті негіз болып табылады.",
      "ru": "HTTP является основой для использования веб-сервисов.",
      "en": "HTTP serves as the foundation for using web services."
    },
    "specific_concepts": {
      "kk": ["веб-сервер", "браузер"],
      "ru": ["веб-сервер", "браузер"],
      "en": ["web server", "browser"]
    },
    "associative": {
      "kk": ["байланыс", "веб-сайттар"],
      "ru": ["связь", "веб-сайты"],
      "en": ["connection", "websites"]
    }
  }
},
 {
  "kk": "WWW",
  "ru": "WWW (Всемирная паутина)",
  "en": "WWW (World Wide Web)",
  "definition": {
    "kk": "WWW – интернет арқылы ақпаратқа қол жеткізуді қамтамасыз ететін өзара байланысқан гипермәтіндік құжаттардың ғаламдық жүйесі.",
    "ru": "WWW — это глобальная система взаимосвязанных гипертекстовых документов, обеспечивающая доступ к информации через интернет.",
    "en": "WWW is a global system of interconnected hypertext documents that provides access to information over the internet."
  },
  "example": {
    "kk": "WWW арқылы веб-сайттарға қол жеткізуге болады.",
    "ru": "Через WWW можно получить доступ к веб-сайтам.",
    "en": "WWW provides access to websites."
  },
  "relations": {
    "synonyms": ["Интернет жүйесі", "Веб"],
    "general_concept": {
      "kk": "WWW пайдаланушыларға ақпаратты іздеу және пайдалану мүмкіндігін береді.",
      "ru": "WWW предоставляет пользователям возможность искать и использовать информацию.",
      "en": "WWW gives users the ability to search and use information."
    },
    "specific_concepts": {
      "kk": ["веб-сайт", "гипермәтін"],
      "ru": ["веб-сайт", "гипертекст"],
      "en": ["website", "hypertext"]
    },
    "associative": {
      "kk": ["ақпарат", "интернет"],
      "ru": ["информация", "интернет"],
      "en": ["information", "internet"]
    }
  }
}
    ]
    }
