{
  "Дәріс 1. Кіріспе": [
    {
      "kk": "Ақпарат",
      "ru": "Информация",
      "en": "Information",
      "definition": {
        "kk": "Ақпарат — белгілі бір объект немесе құбылыстар туралы деректердің жүйелі түрде жинақталуы, құрылымдалуы және өңделуі нәтижесінде пайда болатын, мағыналық және интерпретацияланатын жиынтық. Ақпарат танымдық, басқарушылық және коммуникациялық процестердің негізін құрап, деректерді нақтылы білімге айналдыруда маңызды рөл атқарады.",
        "ru": "Информация – совокупность данных, полученных, структурированных и обработанных таким образом, что они обретают смысл и могут быть интерпретированы. Информация является основой познавательных, управленческих и коммуникативных процессов, обеспечивая переход от необработанных данных к осмысленным знаниям и сообщениям.",
        "en": "Information – a systematically collected, structured, and processed set of data that acquires meaning and can be interpreted. Information forms the basis of cognitive, managerial, and communicative processes, enabling the transformation of raw data into coherent knowledge and actionable insights."
      },
      "example": {
        "kk": "Ақпарат компьютер арқылы беріледі.",
        "ru": "Информация передаётся через компьютер.",
        "en": "Information is transmitted via computer."
      },
      "relations": {
        "synonyms": [
          "Дерек",
          "Мәлімет"
        ],
        "general_concept": "Ақпараттық технологиялар",
        "specific_concepts": [
          "Деректер",
          "Білім"
        ],
        "associative": [
          "Цифрландыру",
          "Ақпаратты өңдеу"
        ]
      },
      "image": "",
      "source": "https://kk.wikipedia.org/wiki/Ақпарат"
    },
    {
      "kk": "Ақпараттық технологиялар",
      "ru": "Информационные технологии",
      "en": "Information Technology",
      "definition": {
        "kk": "Ақпараттық технологиялар – ақпаратты цифрлық форматта өндіру, өңдеу, сақтау және тарату мақсатында қолданылатын компьютерлік жүйелер мен телекоммуникациялық құралдардың кешені. Бұл технологиялар ғылым, өндіріс, басқару және білім беру салаларында деректердің автоматтандырылған өңдеуін және интерпретациясын қамтамасыз ете отырып, ақпараттық ағындардың тиімді басқарылуына ықпал етеді.",
        "ru": "Информационные технологии – совокупность средств, методов и процессов, предназначенных для создания, обработки, хранения и передачи информации в цифровом виде. Эти технологии включают компьютерное оборудование, программное обеспечение, телекоммуникационные системы и сети, а также специализированные прикладные решения, которые обеспечивают автоматизацию и оптимизацию информации в науке, производстве, управлении и образовательной сфере.",
        "en": "Information Technologies – a comprehensive set of tools, methods, and processes aimed at the creation, processing, storage, and transmission of information in digital form. This domain encompasses computer hardware, software, telecommunication systems, networks, and specialized application solutions that facilitate the automation and optimization of data handling in science, industry, management, and education."
      },
      "example": {
        "kk": "Ақпараттық технологиялар білім беру саласында кеңінен қолданылады.",
        "ru": "Информационные технологии широко применяются в сфере образования.",
        "en": "Information technologies are widely used in education."
      },
      "relations": {
        "synonyms": [
          "Цифрлық технологиялар",
          "Компьютерлік технологиялар"
        ],
        "general_concept": "Ақпараттық технологиялар әртүрлі салаларда цифрлық шешімдерді ұсынады.",
        "specific_concepts": [
          "бұлттық есептеу",
          "деректерді өңдеу",
          "бағдарламалық жасақтама"
        ],
        "associative": [
          "компьютер",
          "желілік жүйелер",
          "интернет"
        ]
      },
      "image": "",
      "source": "https://kk.wikipedia.org/wiki/Ақпараттық_технология"
    },
    {
      "kk": "Ақпараттық-коммуникациялық технологиялар (АКТ)",
      "ru": "Информационно-коммуникационные технологии (ИКТ)",
      "en": "ICT",
      "definition": {
        "kk": "Ақпараттық-коммуникациялық технологиялар – қазіргі заманғы цифрлық трансформация дәуірінде ақпаратты өндіру, өңдеу, сақтау және тарату процестерінде қолданылатын компьютерлік жүйелер мен телекоммуникациялық инфрақұрылымдардың интеграциясы. Бұл технологиялар ақпараттық және коммуникациялық құралдардың синергиялық әрекетін қамтамасыз ете отырып, ғылыми зерттеулерден бастап білім беру, өндіріс және басқару салаларына дейін деректер ағындарын автоматтандырылған түрде тиімді басқаруға мүмкіндік береді.",
        "ru": "Информационно-коммуникационные технологии (ИКТ) – это комплекс интегрированных методов, технических средств и процессов, объединяющих возможности информационных технологий и средств телекоммуникаций для создания, обработки, хранения и передачи данных в цифровом формате. ИКТ обеспечивают автоматизацию и оптимизацию информационных процессов, способствуя повышению эффективности и инновационности в научных исследованиях, образовании, промышленности и управлении.",
        "en": "Information and Communication Technologies (ICT) – a comprehensive integration of digital tools, methodologies, and processes that combine the capabilities of information processing with modern communication systems. ICT encompasses computer hardware, software, telecommunication infrastructure, and networking protocols which together enable the efficient production, management, storage, and transmission of data. This integrated framework significantly enhances connectivity and operational efficiency across research, education, industry, and governance."
      },
      "example": {
        "kk": "АКТ білім беруде маңызды рөл атқарады.",
        "ru": "ИКТ играют важную роль в образовании.",
        "en": "ICT plays an important role in education."
      },
      "image": "",
      "source": "https://kk.wikipedia.org/wiki/Ақпараттық-коммуникациялық_технологиялар"
    },
    {
      "kk": "Стандарт",
      "ru": "Стандарт",
      "en": "Standard",
      "definition": {
        "kk": "Стандарт – белгілі бір саладағы өндіріс, қызмет көрсету немесе процесті ұйымдастыру мақсатында ресми түрде бекітілген талаптар мен нұсқаулар жинағы. Ол нақты нормалар мен критерийлерді айқындай отырып, сапаны, қауіпсіздікті және үйлесімділікті қамтамасыз етуге бағытталған, ғылыми және практикалық негізде әзірленеді.",
        "ru": "Стандарт – это нормативный документ, разработанный и утвержденный компетентными органами или профессиональным сообществом, устанавливающий требования, нормы и критерии для организации процессов, обеспечения качества, безопасности и совместимости продукции, услуг или технологических процессов. Он служит основой для поддержания единообразия, оптимизации деятельности и повышения эффективности в различных областях.",
        "en": "Standard – A standard is an officially established normative document developed and approved by competent authorities or professional communities. It outlines the specific guidelines, requirements, and criteria for organizing processes and ensuring quality, safety, and compatibility of products, services, or operational procedures. This document serves as a reference framework to maintain uniformity and optimize performance across various domains."
      },
      "example": {
        "kk": "ISO стандарттары халықаралық деңгейде қолданылады.",
        "ru": "Стандарты ISO используются на международном уровне.",
        "en": "ISO standards are used internationally."
      },
      "relations": {
        "synonyms": [
          "Норматив",
          "Регламент"
        ],
        "general_concept": "Стандарттар өнімнің сапасын және қауіпсіздігін реттеу үшін әзірленеді.",
        "specific_concepts": [
          "ISO стандарттары",
          "ГОСТ",
          "Техникалық регламент"
        ],
        "associative": [
          "сапа",
          "құжат",
          "үйлесімділік"
        ]
      },
      "image": "",
      "source": "https://kk.wikipedia.org/wiki/Стандарт"
    },
    {
      "kk": "Информатика",
      "ru": "Информатика",
      "en": "Computer science",
      "definition": {
        "kk": "Информатика – бұл ақпаратты өңдеу, сақтау, беру және талдау процестерінің негіздері, әдістері мен алгоритмдерін зерттейтін ғылыми бағыт. Ол математика, логика және инженерия салаларындағы теориялық негіздерді біріктіріп, компьютерлік жүйелер мен бағдарламалық қамтамасыз етуді жобалау мен жүзеге асырудың әдістемелік базаcын құрайды.",
        "ru": "Информатика – это научная дисциплина, изучающая принципы, методы и алгоритмы обработки, хранения, передачи и анализа информации с помощью компьютерных систем. Объединяя теоретические основы математики, логики и инженерии, информатика служит фундаментом для разработки и применения современных вычислительных технологий, программного обеспечения и алгоритмических методов.",
        "en": "Computer Science - a scientific discipline that investigates the principles, methods, and algorithms involved in processing, storing, transmitting, and analyzing information using computer systems. By integrating theoretical foundations from mathematics, logic, and engineering, informatics underpins the development and application of modern computational technologies, software solutions, and algorithmic approaches."
      },
      "example": {
        "kk": "Мысалы, информатика пәнінде алгоритмдер мен бағдарламалау негіздері оқытылады.",
        "ru": "Например, на уроках информатики изучаются алгоритмы и основы программирования.",
        "en": "For example, computer science courses cover algorithms and the fundamentals of programming."
      },
      "relations": {
        "synonyms": [
          "компьютерлік ғылым"
        ],
        "homonyms": [],
        "general_concept": "Информатика – ақпаратты өңдеу, сақтау және тарату процестерін, сондай-ақ адам мен компьютер арасындағы өзара әрекеттесуді зерттейтін ғылым.",
        "specific_concepts": [
          "бағдарламалау",
          "алгоритмдер",
          "мәліметтер құрылымы"
        ],
        "associative": [
          "жасанды интеллект",
          "инновация",
          "компьютерлер",
          "цифрлық әлем"
        ]
      }
    },
    {
      "kk": "Компьютерлік дағдылар (КД)",
      "ru": "Компьютерные навыки (КН)",
      "en": "Computer Skills (CS)",
      "definition": {
        "kk": "Компьютерлік дағдылар (КД) – компьютерлік жүйелерді қолдану мен басқарудағы практикалық білім мен тәжірибе жиынтығы. Оларға аппараттық құралдар мен бағдарламалық қамтамасыз етуді тиімді пайдалану, мәліметтерді өңдеу, талдау және сақтау процестерін автоматтандыру әдістерін меңгеру жатады. Компьютерлік дағдылар заманауи цифрлық ортада ақпараттық жүйелерді тиімді ұйымдастыру және басқаруға мүмкіндік береді.",
        "ru": "Компьютерные навыки (КН) – совокупность практических знаний, умений и компетенций, необходимых для эффективного использования и управления компьютерными системами и программным обеспечением. Они включают навыки работы с аппаратными средствами, программами для обработки, анализа и хранения информации, а также умение автоматизировать и оптимизировать процессы в цифровой среде. Компьютерные навыки играют ключевую роль в развитии цифровой экономики, образования и профессиональной деятельности.",
        "en": "Computer skills – a set of practical abilities, knowledge, and competencies essential for the effective use and management of computer systems and software applications. These skills encompass the operation of hardware devices, the use of software for data processing, analysis, and storage, and the capacity to automate and optimize processes within digital environments. Computer skills are fundamental to driving digital innovation in education, industry, and various professional fields."
      },
      "example": {
        "kk": "Мысалы, мәтіндік редакторларды пайдалану, электрондық пошта арқылы байланысу және интернетте ақпарат іздеу.",
        "ru": "Например, использование текстовых редакторов, общение через электронную почту и поиск информации в интернете.",
        "en": "For instance, using word processors, communicating via email, and searching for information on the internet."
      },
      "relations": {
        "synonyms": [
          "Цифрлық дағдылар",
          "IT-білім"
        ],
        "general_concept": "Компьютерлік дағдылар ақпараттық технологияларды тиімді пайдалану үшін қажет.",
        "specific_concepts": [
          "Бағдарламалық қамтамасыз ету",
          "Желімен жұмыс",
          "Деректерді өңдеу"
        ],
        "associative": [
          "технология",
          "интернет",
          "бағдарламалау"
        ]
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Конвергенция",
      "ru": "Конвергенция",
      "en": "Convergence",
      "definition": {
        "kk": "Конвергенция – жүйелердің, процестердің немесе элементтердің ортақ нәтижеге не белгілі бір шекті мәнге ұмтылуы, сонымен бірге олардың үйлесімді интеграциялануы. Мысалы, математикалық анализде тізбектер мен функциялардың шегі белгілі бір мәнге жақындауы конвергенция процесі ретінде қарастырылады. Сонымен қатар, ақпараттық технологиялар, экономика және әлеуметтік ғылымдарда конвергенция ұғымы әр түрлі бағыттағы процестердің бірлесе жұмыс істеуі мен интеграциясын сипаттайды.",
        "ru": "Конвергенция – это процесс, при котором различные системы, процессы или элементы стремятся к достижению общего результата или приближаются к определённому пределу, объединяясь и интегрируясь в единую систему. В математическом анализе конвергенция описывает поведение последовательностей или функций, стремящихся к определённому значению. В более широком смысле термин применяется в экономике, информационных технологиях и социальных науках для обозначения тенденции к слиянию разрозненных процессов в целостную, гармонизированную систему.",
        "en": "Convergence – a process whereby distinct systems, processes, or elements progressively move toward a common limit or outcome, ultimately merging and integrating into a unified structure. In mathematical analysis, convergence refers to the behavior of sequences or functions as they approach a specific value. More broadly, the concept is employed in fields such as economics, information technology, and social sciences to describe the tendency of disparate processes to coalesce into a cohesive whole."
      },
      "example": {
        "kk": "Мысалы, қазіргі заманғы смартфондарда компьютерлік, телефондық және мультимедиялық функциялардың конвергенциясы байқалады.",
        "ru": "Например, современные смартфоны демонстрируют конвергенцию компьютерных, телефонных и мультимедийных функций.",
        "en": "For example, modern smartphones exhibit convergence of computing, telecommunication, and multimedia features."
      },
      "relations": {
        "synonyms": [
          "интеграция",
          "слияние"
        ],
        "homonyms": [],
        "general_concept": "Конвергенция ұғымы әртүрлі элементтердің немесе жүйелердің біртұтас құрылымға бірігуін сипаттайды.",
        "specific_concepts": [
          "технологиялық конвергенция",
          "коммуникациялық конвергенция"
        ],
        "associative": [
          "инновация",
          "синергия",
          "интеграция",
          "коммуникация"
        ]
      }
    },
    {
      "kk": "Цифрландыру",
      "ru": "Цифровизация",
      "en": "Digitalization",
      "definition": {
        "kk": "Цифрландыру – дәстүрлі (аналогтық) ақпарат көздерін, процестерді және қызметтерді цифрлық форматқа көшіру, сақтау және өңдеуді қамтамасыз ететін трансформациялық процесс. Бұл өзгеріс цифрлық инфрақұрылым мен ақпараттық технологияларды енгізу арқылы жүзеге асады, соның нәтижесінде экономика, білім беру, басқару және басқа да әлеуметтік салаларда тиімділіктің жоғарылауы мен инновацияның дамуына ықпал етеді.",
        "ru": "Цифровизация – процесс перехода от традиционных аналоговых методов хранения, обработки и передачи информации к цифровым форматам посредством внедрения современных информационных технологий и цифровой инфраструктуры. Такой переход способствует повышению эффективности, улучшению доступности данных и интеграции цифровых систем в различных сферах — от экономики и образования до управления и социальных услуг.",
        "en": "Digitalization – the transformative process of converting traditional analog forms of data, processes, and services into digital formats through the implementation of modern information technologies and digital infrastructure. This change enhances operational efficiency, improves data accessibility, and fosters the integration of digital systems across various sectors such as economy, education, management, and social services."
      },
      "example": {
        "kk": "Мемлекеттік қызметтер цифрландырылып жатыр.",
        "ru": "Государственные услуги оцифровываются.",
        "en": "Public services are being digitalized."
      },
      "relations": {
        "synonyms": [
          "Сандық трансформация",
          "Ақпараттандыру"
        ],
        "general_concept": "Цифрландыру әртүрлі салаларда тиімділік пен инновацияны қамтамасыз етеді.",
        "specific_concepts": [
          "Блокчейн",
          "Жасанды интеллект",
          "Автоматтандыру"
        ],
        "associative": [
          "технология",
          "деректер",
          "интернет"
        ]
      },
      "image": "",
      "source": "https://kk.wikipedia.org/wiki/Цифрландыру"
    }
  ],
  "Дәріс 2. Компьютер архитектурасы": [
    {
      "kk": "Компьютер",
      "ru": "Компьютер",
      "en": "Computer",
      "definition": {
        "kk": "Компьютер – деректерді өңдеу, сақтау және тасымалдау функцияларын орындайтын есептеуіш құрылғы. Ол электрондық компоненттерді, бағдарламалық қамтамасыз етуді және ақпараттық процестерді басқару құралдарын біріктіріп, күрделі есептеулерді автоматтандыруға, мәліметтерді модельдеуге және цифрлық ақпаратты өңдеуге мүмкіндік береді. Компьютер ғылым, инженерия, бизнес және білім беру салаларында негізгі құралдардың бірі болып табылады.",
        "ru": "Компьютер – электронное вычислительное устройство, предназначенное для обработки, хранения и передачи данных. Он объединяет аппаратные и программные компоненты, позволяя автоматизировать сложные вычисления, моделировать процессы и анализировать цифровую информацию. Компьютер является важнейшим инструментом в науке, инженерии, бизнесе и образовании, обеспечивая широкий спектр вычислительных и информационных возможностей.",
        "en": "Computer – an electronic computing device designed for processing, storing, and transmitting data. It integrates hardware components, software applications, and control mechanisms to automate complex calculations, model processes, and analyze digital information. Computers serve as essential tools in science, engineering, business, and education, providing advanced computational and informational capabilities."
      },
      "example": {
        "kk": "Компьютер деректерді жылдам өңдейді.",
        "ru": "Компьютер быстро обрабатывает данные.",
        "en": "The computer processes data quickly."
      },
      "relations": {
        "synonyms": [
          "ЭЕМ"
        ],
        "general_concept": "Ақпараттық құрылғылар",
        "specific_concepts": [
          "Ноутбук",
          "Жұмыс үстелі компьютері"
        ],
        "associative": [
          "Процессор",
          "Жад",
          "ОЖ"
        ]
      },
      "source": "https://kk.wikipedia.org/wiki/Компьютер"
    },
    {
      "kk": "Компьютер архитектурасы",
      "ru": "Компьютерная архитекттура",
      "en": "Computer Architecture",
      "definition": {
        "kk": "Компьютер архитектурасы – есептеу жүйесінің ұйымдастырылуы мен құрылымын, деректерді өңдеу және басқару тәсілдерін сипаттайтын ғылыми-тәжірибелік сала. Ол процессорлардың, жедел жадының, енгізу-шығару құрылғыларының өзара әрекеттесу қағидаларын, сондай-ақ бағдарламалық қамтамасыз етуді аппараттық жүйемен үйлестіру механизмдерін зерттейді. Компьютер архитектурасы өнімділікті оңтайландыруға, есептеу ресурстарын тиімді пайдалануға және жаңа технологияларды әзірлеуге негізделген.",
        "ru": "Архитектура компьютера – это структурная организация вычислительной системы, включающая принципы обработки данных, управления ресурсами и взаимодействия аппаратных и программных компонентов. Она определяет характеристики процессоров, оперативной памяти, устройств ввода-вывода, а также способы их согласования для достижения оптимальной производительности. Изучение архитектуры компьютера играет ключевую роль в разработке высокоэффективных вычислительных систем и новых технологических решений.",
        "en": "Computer architecture – the structural design of a computing system that defines the principles of data processing, resource management, and interaction between hardware and software components. It encompasses the specifications of processors, memory units, input-output devices, and their coordination mechanisms to optimize performance. The study of computer architecture is fundamental for developing high-efficiency computing systems and advancing technological innovations."
      },
      "example": {
        "kk": "Мысалы, процессор, оперативті жады және сақтау құрылғылары арасындағы үйлесімді жұмыс компьютер архитектурасының негізін құрайды.",
        "ru": "Например, слаженная работа процессора, оперативной памяти и устройств хранения данных является основой компьютерной архитектуры.",
        "en": "For example, the coordinated operation of the CPU, RAM, and storage devices is fundamental to computer architecture."
      },
      "relations": {
        "synonyms": [
          "компьютерлік құрылым",
          "системелік архитектура"
        ],
        "homonyms": [],
        "general_concept": "Компьютер архитектурасы компьютердің жұмыс істеу принциптері мен ішкі құрылымын түсіндіреді.",
        "specific_concepts": [
          "процессор архитектурасы",
          "жады архитектурасы",
          "жеткізу шиналарының архитектурасы"
        ],
        "associative": [
          "жүйелік дизайн",
          "инновация",
          "технология",
          "дигитал трансформация"
        ]
      },
      "image": "https://drive.google.com/file/d/1Z8GgYCcEjFyHWWEYsTPvGRnMbHbXV87O/view?usp=sharing",
      "source": ""
    },
    {
      "kk": "Басқару құрылғысы",
      "ru": "Устройство управления",
      "en": "Control Unit",
      "definition": {
        "kk": "Басқару құрылғысы – есептеуіш немесе өндірістік жүйенің жұмысын үйлестіруге және бақылауға арналған компонент немесе модуль. Ол деректерді өңдеу процестерін реттейді, басқару сигналдарын генерациялайды және құрылғылардың өзара әрекеттесуін қамтамасыз етеді. Басқару құрылғылары есептеу техникасында, автоматикада және робототехникада маңызды рөл атқарады.",
        "ru": "Устройство управления – функциональный модуль или компонент, предназначенный для координации и контроля работы вычислительных или производственных систем. Оно отвечает за обработку управляющих сигналов, синхронизацию процессов и взаимодействие аппаратных и программных компонентов. Устройства управления широко применяются в вычислительной технике, автоматизированных системах и робототехнике.",
        "en": "Control Unit – a functional unit or module designed for coordinating and managing the operation of computing or industrial systems. It regulates data processing workflows, generates control signals, and facilitates interaction between hardware and software components. Control devices play a crucial role in computing technology, automation, and robotics."
      },
      "example": {
        "kk": "Басқару құрылғысы командаларды интерпретациялап, оларды процессорға жібереді.",
        "ru": "Устройство управления интерпретирует команды и отправляет их в процессор.",
        "en": "The control unit interprets instructions and sends them to the processor."
      },
      "relations": {
        "synonyms": [
          "Басқару элементі",
          "Контроллер"
        ],
        "general_concept": "Басқару құрылғысы жүйені басқаруға және оңтайлы жұмыс істеуге көмектеседі.",
        "specific_concepts": [
          "микроконтроллер",
          "сенсорлық интерфейс",
          "автоматтандырылған жүйе"
        ],
        "associative": [
          "жүйе",
          "интерактивтілік",
          "ақпаратты өңдеу"
        ]
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Екілік код",
      "ru": "Двоичный код",
      "en": "Binary Code",
      "definition": {
        "kk": "Екілік код – ақпаратты өңдеу және сақтау үшін тек екі символды (0 және 1) пайдаланатын сандық жүйе. Ол компьютерлік жүйелердің негізін құрайды және деректерді ішкі түрде көрсету, өңдеу және тасымалдау үшін қолданылады. Екілік код арифметикалық және логикалық операцияларды орындау үшін тиімді құрылым болып табылады және барлық сандық құрылғыларда қолданылады.",
        "ru": "Двоичный код – числовая система представления информации, использующая только два символа: 0 и 1. Он служит основой для обработки, хранения и передачи данных в компьютерных системах, обеспечивая внутреннее представление информации и выполнение арифметических и логических операций. Двоичный код является ключевым компонентом цифровых технологий и широко применяется в вычислительных устройствах.",
        "en": "Binary code – a numerical system used for processing and storing data that employs only two symbols: 0 and 1. It forms the foundation of computer systems, enabling internal data representation, logical operations, and arithmetic calculations. Binary code is a fundamental component of digital technology and is widely used in computational devices."
      },
      "example": {
        "kk": "Мысалы, ондық сан 5 екілік түрде «101» деп жазылады.",
        "ru": "Например, десятичное число 5 записывается в двоичном виде как «101».",
        "en": "For example, the decimal number 5 is represented in binary as \"101\"."
      },
      "relations": {
        "synonyms": [
          "Екілік жүйе",
          "Деректерді кодтау"
        ],
        "general_concept": "Екілік код цифрлық технологиялар мен есептеу жүйелерінің негізін құрайды.",
        "specific_concepts": [
          "ASCII коды",
          "Машиналық тіл",
          "Бит және байт"
        ],
        "associative": [
          "алгоритм",
          "компьютер",
          "ақпаратты өңдеу"
        ]
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Регистр",
      "ru": "Регистр",
      "en": "Register",
      "definition": {
        "kk": "Регистр – компьютерлік жүйелерде деректерді уақытша сақтауға және өңдеуге арналған жоғары жылдамдықты жад элементі. Ол орталық процессордың құрамдас бөлігі ретінде арифметикалық және логикалық операциялар жүргізу үшін қолданылады. Регистрлер ақпаратты сақтау, беру және өңдеудің тиімділігін арттыратын архитектуралық құрылымдардың маңызды компоненті болып табылады.",
        "ru": "Регистр – высокоскоростной элемент памяти, предназначенный для временного хранения и обработки данных в вычислительных системах. Является частью центрального процессора и используется для выполнения арифметических и логических операций. Регистры играют ключевую роль в организации потоков данных, обеспечивая оптимизацию вычислительных процессов.",
        "en": "Register – a high-speed memory element designed for temporary storage and processing of data in computing systems. As a component of the central processing unit (CPU), it is utilized for performing arithmetic and logical operations. Registers are fundamental to data flow management, optimizing computational efficiency and system performance."
      },
      "example": {
        "kk": "Мысалы, процессор арифметикалық операциялар кезінде регистрлерді пайдаланады.",
        "ru": "Например, процессор использует регистры во время арифметических операций.",
        "en": "For example, the processor utilizes registers during arithmetic operations."
      },
      "relations": {
        "synonyms": [
          "Жад регистрі",
          "Уақытша сақтау"
        ],
        "general_concept": "Регистрлер компьютерлік архитектураның негізгі элементі болып табылады.",
        "specific_concepts": [
          "Аккумуляторлық регистр",
          "Адрестік регистр",
          "Командалық регистр"
        ],
        "associative": [
          "деректер",
          "процессор",
          "жад"
        ]
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Процессор",
      "ru": "Процессор",
      "en": "Processor",
      "definition": {
        "kk": "Процессор – есептеуіш жүйенің негізгі компоненті болып табылатын, арифметикалық және логикалық операцияларды орындауға, деректерді өңдеуге және басқаруға арналған электрондық құрылғы. Ол бағдарламалық нұсқауларды орындау арқылы есептеу процестерін жүзеге асырады және орталық есептеу элементі ретінде ақпараттық жүйелердің жұмысын басқарады.",
        "ru": "Процессор – электронное устройство, являющееся ключевым компонентом вычислительной системы, предназначенное для выполнения арифметических и логических операций, обработки данных и управления процессами. Он выполняет программные инструкции, обеспечивая функционирование цифровых систем и координацию вычислительных процессов.",
        "en": "Processor – an electronic device that serves as the central component of a computing system, designed to execute arithmetic and logical operations, process data, and manage computational tasks. It operates by executing program instructions, enabling the functionality of digital systems and coordinating computational workflows."
      },
      "example": {
        "kk": "Процессор бағдарламаларды орындау үшін қолданылады.",
        "ru": "Процессор используется для выполнения программ.",
        "en": "The processor is used to execute programs."
      },
      "relations": {
        "synonyms": [
          "Орталық процессор (CPU)",
          "Есептеу құрылғысы"
        ],
        "general_concept": "Процессор компьютерлік жүйенің негізгі компоненті ретінде деректерді өңдеу мен басқару қызметін атқарады.",
        "specific_concepts": [
          "ядро",
          "кэш жады",
          "тактілік жиілік"
        ],
        "associative": [
          "компьютер",
          "жад",
          "алгоритм"
        ]
      },
      "image": "https://drive.google.com/file/d/1YOYRiENrynsYcSJAMkbccQIB-NE2sq0-/view?usp=sharing",
      "source": ""
    },
    {
      "kk": "Арифметикалық-логикалық құрылғы",
      "ru": "Арифметико-логическое устройство",
      "en": "Arithmetic Logic Unit",
      "definition": {
        "kk": "Арифметикалық-логикалық құрылғы (АЛҚ) – орталық процессордың негізгі құрамдас бөлігі болып табылатын, арифметикалық (қосу, алу, көбейту, бөлу) және логикалық (және, немесе, терістеу) операцияларды орындауға арналған электрондық блок. Ол сандарды өңдеу, салыстыру, логикалық шарттарды бағалау және басқа да негізгі есептеу функцияларын жүзеге асырады. АЛҚ компьютердің есептеу қуаты мен деректерді өңдеу тиімділігін анықтайтын маңызды элемент болып табылады.",
        "ru": "Арифметико-логическое устройство (АЛУ) – ключевой компонент центрального процессора, предназначенный для выполнения арифметических (сложение, вычитание, умножение, деление) и логических (И, ИЛИ, НЕ) операций. Оно выполняет обработку числовых данных, сравнение значений, оценку логических условий и другие вычислительные функции, обеспечивая обработку информации и вычислительную мощность системы.",
        "en": "Arithmetic Logic Unit (ALU) – a fundamental component of the central processing unit (CPU) designed for executing arithmetic (addition, subtraction, multiplication, division) and logical (AND, OR, NOT) operations. It performs numerical data processing, comparison, logical condition evaluation, and other core computational functions, playing a crucial role in determining the processing power and efficiency of a computer system."
      },
      "example": {
        "kk": "Мысалы, арифметикалық-логикалық құрылғы компьютердің негізгі есептеу операцияларын орындайды.",
        "ru": "Например, арифметико-логическое устройство выполняет основные вычислительные операции в компьютере.",
        "en": "For example, the ALU executes fundamental computational operations in a computer."
      },
      "relations": {
        "synonyms": [
          "Арифметикалық процессор",
          "Есептеу құрылғысы"
        ],
        "general_concept": "Арифметикалық-логикалық құрылғы компьютерлік есептеулердің негізгі элементі ретінде жұмыс істейді.",
        "specific_concepts": [
          "Регистр",
          "Қозғалтқыш тактісі",
          "Бүтін санды арифметика"
        ],
        "associative": [
          "процессор",
          "компьютерлік архитектура",
          "деректерді өңдеу"
        ]
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Сумматор",
      "ru": "Сумматор",
      "en": "Adder",
      "definition": {
        "kk": "Сумматор – екілік немесе ондық жүйеде сандарды қосу операциясын орындауға арналған логикалық құрылғы. Ол арифметикалық-логикалық құрылғының құрамдас бөлігі ретінде жұмыс істеп, кіру мәндерін қабылдап, нәтижелерді өңдейді. Сумматорлар компьютерлік архитектурада, микропроцессорлық жүйелерде және цифрлық схемаларда қолданылады, олардың жұмысын оңтайландырады.",
        "ru": "Сумматор – логическое устройство, предназначенное для выполнения операции сложения чисел в двоичной или десятичной системе. Он является частью арифметико-логического устройства процессора, принимая входные значения и формируя результаты. Сумматоры широко применяются в компьютерной архитектуре, микропроцессорных системах и цифровых схемах для обработки данных.",
        "en": "Adder – a logical unit designed to perform addition operations in binary or decimal numeral systems. It functions as a component of the arithmetic logic unit (ALU), receiving input values and generating results. Adders are widely used in computer architecture, microprocessor systems, and digital circuits to optimize data processing."
      },
      "example": {
        "kk": "Сумматор екі биттік сандарды қосып, олардың қосындысын есептейді.",
        "ru": "Сумматор складывает два двоичных числа, вычисляя их сумму.",
        "en": "The adder computes the sum by adding two binary numbers."
      },
      "relations": {
        "synonyms": [
          "Қосу құрылғысы",
          "Арифметикалық блок"
        ],
        "general_concept": "Сумматор компьютерлік және цифрлық жүйелерде арифметикалық есептеулерді орындау үшін қажет.",
        "specific_concepts": [
          "Жартылай сумматор",
          "Толық сумматор",
          "Кері байланысты сумматор"
        ],
        "associative": [
          "арифметика",
          "процессор",
          "логикалық схема"
        ]
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Аналық тақта",
      "ru": "Материнская плата",
      "en": "Motherboard",
      "definition": {
        "kk": "Компьютер компоненттерін біріктіретін негізгі плата.",
        "ru": "Основная плата, объединяющая компоненты компьютера.",
        "en": "The main board that integrates computer components."
      },
      "example": {
        "kk": "Аналық тақта – компьютердің барлық негізгі компоненттерін біріктіретін орталық электрондық тақша. Ол процессор, жедел жады, сақтау құрылғылары және енгізу-шығару интерфейстерінің өзара әрекеттесуін қамтамасыз етеді. Аналық тақта жүйелік ресурстарды үйлестіру, деректер ағынын басқару және перифериялық құрылғыларды қосу үшін маңызды архитектуралық элемент болып табылады.",
        "ru": "Материнская плата – центральная печатная плата компьютера, объединяющая и координирующая работу его основных аппаратных компонентов. Она обеспечивает взаимодействие процессора, оперативной памяти, запоминающих устройств и периферийных интерфейсов, регулируя передачу данных и распределение системных ресурсов. Материнская плата играет ключевую роль в компьютерной архитектуре, определяя функциональность и расширяемость системы.",
        "en": "Motherboard – the central printed circuit board of a computer that integrates and coordinates the operation of its key hardware components. It facilitates interaction between the processor, memory, storage devices, and peripheral interfaces while managing data flow and system resources. The motherboard serves as a fundamental architectural element, influencing system functionality and expandability."
      },
      "relations": {
        "synonyms": [
          "Негізгі плата",
          "Жүйелік плата"
        ],
        "general_concept": "Аналық плата компьютер компоненттерінің өзара әрекеттесуін қамтамасыз етеді.",
        "specific_concepts": [
          "Чипсет",
          "Шина",
          "BIOS"
        ],
        "associative": [
          "компьютер",
          "жүйе",
          "ақпарат алмасу"
        ]
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Компьютер жады",
      "ru": "Компьютерная память",
      "en": "Computer Memory",
      "definition": {
        "kk": "Компьютер жады – сандық ақпаратты уақытша немесе тұрақты сақтау және өңдеу үшін қолданылатын электрондық құрылғылар мен жүйелер жиынтығы. Ол бағдарламалар мен мәліметтерді сақтау, оларды өңдеу кезінде жылдам қолжетімділікті қамтамасыз ету және есептеу жүйелерінің тиімділігін арттыру мақсатында қолданылады. Компьютер жады негізгі екі түрге бөлінеді: жедел (RAM) және тұрақты (ROM) жады.",
        "ru": "Компьютерная память – совокупность электронных устройств и систем, предназначенных для хранения и обработки цифровой информации в вычислительных системах. Она обеспечивает хранение программ и данных, оперативный доступ к ним в ходе обработки и повышение эффективности вычислительных процессов. Компьютерная память подразделяется на оперативную (RAM) и постоянную (ROM), каждая из которых выполняет специфические функции.",
        "en": "Computer memory – a collection of electronic devices and systems designed for storing and processing digital information in computing systems. It enables the storage of programs and data, ensures rapid access during processing, and enhances computational efficiency. Computer memory is generally classified into two primary types: volatile memory (RAM) and non-volatile memory (ROM), each serving distinct functions."
      },
      "example": {
        "kk": "Компьютер жады программалардың жылдам жұмысын қамтамасыз етеді және ақпаратты сақтайды.",
        "ru": "Компьютерная память обеспечивает быструю работу программ и хранит информацию.",
        "en": "Computer memory ensures the fast operation of programs and stores information."
      },
      "relations": {
        "synonyms": [
          "Жады",
          "Ақпарат сақтау жүйесі"
        ],
        "general_concept": "Компьютерлік жады ақпаратты сақтау және өңдеу үшін қажетті технология.",
        "specific_concepts": [
          "RAM",
          "ROM",
          "SSD",
          "HDD"
        ],
        "associative": [
          "деректер",
          "сақтау",
          "жылдамдық"
        ]
      },
      "image": "https://drive.google.com/file/d/1eGzP43ZolSR5MYWb2JGOTn2ckv_x6vYr/view?usp=drive_link",
      "source": ""
    },
    {
      "kk": "Ішкі жады",
      "ru": "Внутренняя память",
      "en": "Internal Memory",
      "definition": {
        "kk": "Ішкі жады – компьютердің негізгі есептеу процесінде қолданылатын, жоғары жылдамдықты деректерді сақтау және өңдеу құрылғысы. Ол орталық процессордың тікелей қолжетімділігінде болып, есептеулерді орындау кезінде қажетті ақпаратты уақытша сақтайды. Ішкі жады жедел жадыны (RAM), тұрақты жадыны (ROM) және кэш-жадыны қамтиды.",
        "ru": "Внутренняя память – высокоскоростное устройство хранения данных, используемое в процессе вычислений и непосредственно доступное центральному процессору. Оно временно сохраняет информацию, необходимую для выполнения операций, и включает оперативную память (RAM), постоянную память (ROM) и кэш-память.",
        "en": "Internal memory – a high-speed data storage system utilized in computing processes and directly accessible by the central processing unit (CPU). It temporarily retains information required for executing operations and encompasses random-access memory (RAM), read-only memory (ROM), and cache memory."
      },
      "example": {
        "kk": "Процессор ішкі жадыға тез қол жеткізіп, есептерді жылдамырақ орындайды.",
        "ru": "Процессор использует внутреннюю память для быстрой обработки данных.",
        "en": "The processor accesses internal memory quickly to execute tasks faster."
      },
      "relations": {
        "synonyms": [
          "Жедел жады",
          "Тұрақты жады"
        ],
        "general_concept": "Ішкі жады құрылғының жұмыс өнімділігін арттыру үшін маңызды.",
        "specific_concepts": [
          "RAM",
          "ROM",
          "Кэш жады"
        ],
        "associative": [
          "процессор",
          "ақпарат сақтау",
          "жылдамдық"
        ]
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Сыртқы жады",
      "ru": "Внешняя память",
      "en": "External Memory",
      "definition": {
        "kk": "Сыртқы жады – ақпаратты ұзақ мерзімге сақтау үшін қолданылатын компьютерлік жад жүйесі. Ол деректерді сақтау құрылғылары арқылы жүзеге асады және есептеуіш құрылғыдан бөлек орналасады. Сыртқы жады қатты дисктерді (HDD, SSD), флэш-жадыларды, оптикалық дисктерді және басқа сақтау құрылғыларын қамтиды.",
        "ru": "Внешняя память – система компьютерного хранения данных, предназначенная для длительного сохранения информации. Она функционирует отдельно от основной вычислительной системы и реализуется посредством запоминающих устройств, таких как жесткие диски (HDD, SSD), флеш-накопители, оптические диски и другие носители.",
        "en": "External memory – a computer storage system designed for long-term data retention. It operates separately from the primary computing system and is implemented through storage devices such as hard drives (HDD, SSD), flash drives, optical discs, and other memory units."
      },
      "example": {
        "kk": "Сыртқы жады үлкен көлемдегі файлдарды сақтап, деректерді ұзақ мерзімге сақтайды.",
        "ru": "Внешняя память хранит большие объемы данных на длительный срок.",
        "en": "External memory is used to store large amounts of data for long-term use."
      },
      "relations": {
        "synonyms": [
          "Сыртқы сақтау құрылғысы",
          "Қосымша жады"
        ],
        "general_concept": "Сыртқы жады ақпаратты ұзақ мерзімді сақтауға және тасымалдауға мүмкіндік береді.",
        "specific_concepts": [
          "HDD",
          "SSD",
          "USB флэш-дискі"
        ],
        "associative": [
          "деректер",
          "сақтау",
          "қолжетімділік"
        ]
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Жүйелік блок",
      "ru": "Системный блок",
      "en": "System Unit",
      "definition": {
        "kk": "Жүйелік блок – компьютердің негізгі аппараттық компоненттерін біріктіретін корпустық құрылғы, оның ішінде процессор, жедел жады, аналық плата, сақтау құрылғылары және салқындату жүйелері бар. Ол есептеу процестерін үйлестіру және басқару үшін маңызды рөл атқарады, барлық ішкі құрылғылардың өзара әрекеттесуін қамтамасыз етеді.",
        "ru": "Системный блок – корпус, содержащий основные аппаратные компоненты компьютера, включая процессор, оперативную память, материнскую плату, устройства хранения данных и системы охлаждения. Он выполняет функции управления вычислительными процессами и координации взаимодействия внутренних устройств, обеспечивая стабильную работу компьютерной системы.",
        "en": "System unit – the enclosure housing the primary hardware components of a computer, including the processor, memory, motherboard, storage devices, and cooling systems. It plays a critical role in coordinating computational processes and managing interactions among internal devices to ensure system stability and efficiency."
      },
      "example": {
        "kk": "Жүйелік блок компьютердің «миы» ретінде қызмет етеді, себебі оның ішінде барлық маңызды компоненттер орналасқан.",
        "ru": "Системный блок служит «мозгом» компьютера, так как в нем находятся все основные компоненты.",
        "en": "The system unit acts as the 'brain' of the computer, housing all the critical components."
      },
      "relations": {
        "synonyms": [
          "Компьютер корпусы",
          "Орталық құрылғы"
        ],
        "general_concept": "Жүйелік блок компьютердің барлық негізгі компоненттерін біріктіреді.",
        "specific_concepts": [
          "Аналық плата",
          "Қуат көзі",
          "Сақтау құрылғылары"
        ],
        "associative": [
          "компьютер",
          "аппараттық бөлік",
          "деректерді өңдеу"
        ]
      },
      "image": "https://artemsannikov.ru/wp-content/uploads/2015/01/device-system-unit.jpg",
      "source": ""
    },
    {
      "kk": "Жедел жад",
      "ru": "Оперативная память (ОЗУ)",
      "en": "Random Access Memory (RAM)",
      "definition": {
        "kk": "Жедел жады – компьютерлік жүйеде уақытша ақпаратты сақтау және өңдеу үшін қолданылатын жоғары жылдамдықты жад түрі. Ол бағдарламалар мен деректерді процессор жылдам қол жеткізе алатын күйде сақтап, есептеуіш құрылғының жалпы өнімділігін арттыруға мүмкіндік береді. Оперативті жады компьютер өшірілгенде немесе қайта іске қосылғанда өзіндегі ақпаратты жоғалтады.",
        "ru": "Оперативная память (ОЗУ) – высокоскоростной тип памяти, предназначенный для временного хранения и обработки данных в вычислительной системе. Она обеспечивает доступ к информации, необходимой процессору для выполнения операций, способствуя увеличению общей производительности компьютера. Оперативная память является энергозависимой, то есть при выключении системы данные в ней стираются.",
        "en": "Random Access Memory (RAM) – a high-speed memory type used for temporary storage and processing of data in a computing system. It provides the processor with fast access to essential information, thereby enhancing overall system performance. RAM is volatile, meaning its stored data is erased when the computer is powered off or restarted."
      },
      "example": {
        "kk": "Жедел жад бағдарламалардың жылдам орындалуына ықпал етеді.",
        "ru": "Оперативная память способствует быстрому выполнению программ.",
        "en": "RAM helps programs run quickly."
      },
      "relations": {
        "synonyms": [
          "Уақытша жад"
        ],
        "general_concept": "Жедел жады компьютердің жылдам әрі тиімді жұмыс істеуін қамтамасыз етеді.",
        "specific_concepts": [
          "DDR4",
          "DDR5",
          "Кэш жады"
        ],
        "associative": [
          "процессор",
          "деректер",
          "жылдамдық"
        ]
      },
      "image": "https://vseplus.com/uploads/articles/749/749_1.jpg",
      "source": ""
    },
    {
      "kk": "Тұрақты жад",
      "ru": "Постоянная память (ПЗУ)",
      "en": "Read-Only Memory (ROM)",
      "definition": {
        "kk": "Тұрақты жады – есептеу жүйелерінде деректерді ұзақ уақыт сақтауға арналған тұрақты жад түрі. Қуат өшірілгеннен кейін өзгеріссіз қалатын жүйелік бағдарламалық жасақтаманы және маңызды нұсқауларды сақтау үшін қолданылады. Тұрақты жады микропроцессорлық құрылғыларда, ендірілген жүйелерде және басқару модульдерінде кеңінен қолданылады.",
        "ru": "Постоянная память (ПЗУ) – энергонезависимый тип памяти, предназначенный для долговременного хранения данных в вычислительных системах. Используется для хранения системного программного обеспечения и критически важных инструкций, которые остаются неизменными после выключения питания. ПЗУ широко применяется в микропроцессорных устройствах, встроенных системах и управляющих модулях.",
        "en": "Read-Only Memory (ROM) – a non-volatile memory type designed for long-term data storage in computing systems. It is used to store system software and essential instructions that remain intact even after power is turned off. ROM is extensively utilized in microprocessor devices, embedded systems, and control modules."
      },
      "example": {
        "kk": "Тұрақты жад жүйе бағдарламаларын сақтайды.",
        "ru": "Постоянная память сохраняет системные программы.",
        "en": "ROM stores system programs."
      },
      "relations": {
        "synonyms": [
          "Тұрақты сақтау құрылғысы",
          "Ұзақ мерзімді жад"
        ],
        "general_concept": "Тұрақты жады ақпараттың ұзақ мерзімді сақталуын қамтамасыз етеді.",
        "specific_concepts": [
          "SSD",
          "HDD",
          "ROM"
        ],
        "associative": [
          "деректер",
          "сақтау",
          "жылдамдық"
        ]
      },
      "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRSZu1RZ72DsSs-aOp8qK-l_n8d3W060a67vw&s",
      "source": ""
    },
    {
      "kk": "Қуат көзі",
      "ru": "Блок питания",
      "en": "Power Supply",
      "definition": {
        "kk": "Қуат көзі (блок питания) – электрондық құрылғылардың, соның ішінде компьютерлік жүйелердің тұрақты және сенімді электрмен жабдықталуын қамтамасыз ететін құрылғы. Ол айнымалы токты тұрақты токқа түрлендіру, кернеуді реттеу және қорғаныс механизмдерін іске асыру функцияларын орындайды. Қуат көзі компьютер архитектурасының маңызды элементі болып табылады және әртүрлі техникалық сипаттамаларға ие.",
        "ru": "Блок питания – устройство, обеспечивающее стабильное и надёжное электропитание электронных систем, включая компьютерные комплексы. Он выполняет преобразование переменного тока в постоянный, регулирование напряжения и защиту от перегрузок. Блок питания является важной частью архитектуры компьютера, определяя устойчивость и эффективность работы всех компонентов.",
        "en": "Power supply unit (PSU) – a device that provides stable and reliable electrical power to electronic systems, including computer architectures. It converts alternating current (AC) into direct current (DC), regulates voltage levels, and implements protection mechanisms against overloads. The PSU is a crucial component that ensures the stability and efficiency of all computer hardware components."
      },
      "example": {
        "kk": "Қуат көзі тұрақты токты қамтамасыз етеді.",
        "ru": "Блок питания обеспечивает постоянный ток.",
        "en": "The power supply provides stable current."
      },
      "image": "https://stack-systems.com.ua/media/magefan_blog/9687902d-0a9f-11e1-b8f4-0019dbf63c892.jpg",
      "source": ""
    },
    {
      "kk": "Монитор",
      "ru": "Монитор",
      "en": "Monitor",
      "definition": {
        "kk": "Монитор - компьютерлік жүйенің деректерін графикалық немесе мәтіндік форматта визуалды түрде көрсетуге арналған ақпаратты көрсету құрылғысы. Монитордың сипаттамаларына пайдаланушының жүйемен өзара әрекеттесуінің сапасы мен ыңғайлылығын анықтайтын кескін шығару технологиясы, ажыратымдылық, жаңарту жылдамдығы және түстердің көбеюі жатады.",
        "ru": "Монитор – устройство отображения информации, предназначенное для визуального представления данных компьютерной системы в графическом или текстовом формате. Характеристики монитора включают технологию вывода изображения, разрешение, частоту обновления и цветопередачу, что определяет качество и удобство взаимодействия пользователя с системой.",
        "en": "Monitor – a display device designed for visually presenting computer system data in graphical and textual formats. Monitor specifications include image rendering technology, resolution, refresh rate, and color reproduction, all of which contribute to user interface interaction and overall visual experience."
      },
      "example": {
        "kk": "Компьютерге қосылған монитор арқылы ақпарат көрінеді.",
        "ru": "Через подключённый монитор отображается информация.",
        "en": "Information is displayed through the connected monitor."
      },
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/MonitorLCDlcd.svg/1200px-MonitorLCDlcd.svg.png",
      "source": ""
    },
    {
      "kk": "Пернетақта",
      "ru": "Клавиатура",
      "en": "Keyboard",
      "definition": {
        "kk": "Пернетақта - пайдаланушыға командалар мен деректер арқылы компьютерлік жүйемен өзара әрекеттесуге мүмкіндік беретін пернелер жиынтығынан тұратын сандық және мәтіндік ақпаратты енгізу құрылғысы. Ол кіріс интерфейсінің негізгі элементі болып табылады және механикалық, мембраналық және сенсорлық пернетақталарды қоса алғанда, әртүрлі түрлерде келеді.",
        "ru": "Клавиатура – устройство ввода цифровой и текстовой информации, состоящее из набора клавиш, позволяющих пользователю взаимодействовать с компьютерной системой посредством команд и данных. Она является ключевым элементом интерфейса ввода и бывает различных типов, включая механические, мембранные и сенсорные клавиатуры.",
        "en": "Keyboard – an input device designed for entering digital and textual information through a set of keys that transmit commands and data to a computing system. It serves as a fundamental component of the user interface and comes in various types, including mechanical, membrane, and touch-sensitive keyboards."
      },
      "example": {
        "kk": "Пернетақта арқылы мәтіндер енгізіледі.",
        "ru": "С помощью клавиатуры вводятся тексты.",
        "en": "Text is entered using a keyboard."
      },
      "image": "https://manuals.plus/wp-content/uploads/2022/09/geemarc-KBSV3_BLK-Standard-Big-Letter-Keyboard-featured.png",
      "source": ""
    },
    {
      "kk": "Тінтуір",
      "ru": "Мышь",
      "en": "Mouse",
      "definition": {
        "kk": "Тінтуір - графикалық интерфейсті басқаруға және компьютерлік жүйеге командаларды жіберуге арналған меңзегіш енгізу құрылғысы. Ол қозғалыс сенсорлары арқылы экрандағы курсордың орнын өзгертеді, ал түймелер мен айналдыру дөңгелегі әртүрлі операциялардың орындалуын қамтамасыз етеді.",
        "ru": "Мышь – указательное устройство ввода, предназначенное для управления графическим интерфейсом и передачи команд компьютерной системе. Она изменяет положение курсора на экране с помощью сенсоров движения, а кнопки и колесо прокрутки обеспечивают выполнение различных операций.",
        "en": "Mouse – a pointing input device designed for controlling graphical interfaces and issuing commands to a computer system. It moves the on-screen cursor based on motion sensors and enables various interactions through buttons and a scroll wheel."
      },
      "example": {
        "kk": "Тінтуір арқылы экрандағы элементтер таңдалады.",
        "ru": "С помощью мыши выбираются элементы на экране.",
        "en": "Elements on the screen are selected using a mouse."
      },
      "image": "https://www.delux-asia.kz/upload/catalog/item170/0_black_big.jpg",
      "source": ""
    },
    {
      "kk": "Принтер",
      "ru": "Принтер",
      "en": "Printer",
      "definition": {
        "kk": "Принтер - сандық ақпаратты қағаз немесе пленка сияқты физикалық медиаға шығаруға арналған перифериялық құрылғы. Ол механикалық және электронды компоненттерді біріктіре отырып, мәтінді басып шығару және графикалық технологияларды қолданады. Принтерлердің бірнеше түрі бар, соның ішінде лазерлік, сиялы, матрицалық және 3D модельдері.",
        "ru": "Принтер – периферийное устройство, предназначенное для вывода цифровой информации на физические носители, такие как бумага или плёнка. Он использует технологии печати текста и графики, объединяя механические и электронные компоненты. Существует несколько типов принтеров, включая лазерные, струйные, матричные и 3D-модели.",
        "en": "Printer – a peripheral device used for transferring digital information onto physical media, such as paper or film. It employs text and graphic printing technologies, integrating mechanical and electronic components. Printers come in various types, including laser, inkjet, dot matrix, and 3D models."
      },
      "example": {
        "kk": "Принтер арқылы құжатты басып шығаруға болады.",
        "ru": "При помощи принтера можно распечатать документ.",
        "en": "A document can be printed using a printer."
      },
      "image": "https://cdn.lifehacker.ru/wp-content/uploads/2019/10/Copy-of-Copy-of-Copy-of-Copy-of-Book-2_1570775107.jpg",
      "source": ""
    },
    {
      "kk": "Плоттер",
      "ru": "Плоттер",
      "en": "Plotter",
      "definition": {
        "kk": "Плоттер - күрделі графикалық кескіндерді, инженерлік сызбаларды және техникалық иллюстрацияларды басып шығаруға арналған жоғары дәлдіктегі шығыс құрылғысы. Ол механикалық қауырсындармен немесе цифрлық баспа механизмдерімен жұмыс істей алады және сәулет, дизайн, картография және инженерлік салаларда кеңінен қолданылады.",
        "ru": "Плоттер – высокоточное устройство вывода, предназначенное для печати сложных графических изображений, инженерных чертежей и технических иллюстраций. Он может работать с механическими перьями или цифровыми печатными механизмами и широко используется в архитектуре, дизайне, картографии и инженерных областях.",
        "en": "Plotter – a high-precision output device used for printing complex graphical images, engineering drawings, and technical illustrations. It operates using mechanical pens or digital printing mechanisms and is extensively utilized in architecture, design, cartography, and engineering disciplines."
      },
      "example": {
        "kk": "Архитекторлар өз сызбаларын плоттер арқылы басып шығарады.",
        "ru": "Архитекторы печатают свои чертежи с помощью плоттера.",
        "en": "Architects print their drawings using a plotter."
      },
      "image": "https://strgimgr.umico.az/sized/840/318478-dbb2c66b4a3c565c7e22dfe56d7b6c2f.jpg",
      "source": ""
    },
    {
      "kk": "Сканер",
      "ru": "Сканер",
      "en": "Scanner",
      "definition": {
        "kk": "Сканер - сандық форматқа түрлендіру мақсатында мәтіндік және графикалық ақпаратты оптикалық оқуға арналған құрылғы. Бұл кейінірек компьютерлік жүйелерде пайдалану үшін кескіндерді, құжаттарды және басқа визуалды деректерді сканерлеуге мүмкіндік береді. Сканерлер ажыратымдылығы, түсі және функционалдығы бойынша ерекшеленеді.",
        "ru": "Сканер – устройство, предназначенное для оптического считывания текстовой и графической информации с целью её преобразования в цифровой формат. Оно позволяет сканировать изображения, документы и другие визуальные данные для последующего использования в компьютерных системах. Сканеры различаются по разрешению, цветопередаче и функциональным возможностям.",
        "en": "Scanner – a device designed for optically reading textual and graphical information and converting it into a digital format. It enables the scanning of images, documents, and other visual data for processing within computer systems. Scanners vary in terms of resolution, color accuracy, and functional capabilities."
      },
      "example": {
        "kk": "Сканер арқылы ескі құжаттардың цифрлық көшірмесін алуға болады.",
        "ru": "С помощью сканера можно создать цифровую копию старых документов.",
        "en": "A digital copy of old documents can be obtained using a scanner."
      },
      "image": "https://www.quickscan.ru/files/9085/4286/st640.jpg",
      "source": ""
    },
    {
      "kk": "Диск жетегі",
      "ru": "Дисковод",
      "en": "Disk Drive",
      "definition": {
        "kk": "Диск жетегі - оптикалық немесе магниттік дискілермен жұмыс істейтін ақпаратты оқуға, жазуға және сақтауға арналған құрылғы. Ол CD, DVD, Blu-ray дискілерімен, сондай-ақ қатты және икемді дискілермен жұмыс істеу үшін қолданылады, бұл компьютерлік жүйелерде деректерді беру мен сақтық көшірмені қамтамасыз етеді.",
        "ru": "Дисковод – устройство для чтения, записи и хранения информации, работающее с оптическими или магнитными дисками. Оно используется для работы с CD, DVD, Blu-ray дисками, а также с жёсткими и гибкими дисками, обеспечивая передачу данных и резервное копирование в компьютерных системах.",
        "en": "Disk drive – a device used for reading, writing, and storing data, designed to operate with optical or magnetic disks. It is utilized for handling CDs, DVDs, Blu-ray discs, as well as hard and floppy disks, facilitating data transfer and backup within computer systems."
      },
      "example": {
        "kk": "Дисковод арқылы DVD және CD дискілері оқылады.",
        "ru": "DVD и CD диски читаются с помощью дисковода.",
        "en": "DVD and CD disks are read using a disk drive."
      },
      "image": "https://patron-service.ru/images/thumbnails/720/720/detailed/3419/0112003_1.jpg",
      "source": ""
    },
    {
      "kk": "Модем",
      "ru": "Модем",
      "en": "Modem",
      "definition": {
        "kk": "Модем - аналогтық және цифрлық сигналдарды түрлендіру арқылы деректерді беруге арналған байланыс құрылғысы. Ол телефон желілері, кабельдік желілер немесе сымсыз технологиялар арқылы Интернетке қосылуды қамтамасыз етеді. Модемнің негізгі функциясы-сандық ақпаратты аналогтық және кері түрлендіруге мүмкіндік беретін сигналдарды модуляциялау және демодуляциялау.",
        "ru": "Модем – устройство связи, предназначенное для передачи данных путем преобразования аналоговых и цифровых сигналов. Он обеспечивает подключение к интернету через телефонные линии, кабельные сети или беспроводные технологии. Основная функция модема – модуляция и демодуляция сигналов, позволяющая преобразовывать цифровую информацию в аналоговую и обратно.",
        "en": "Modem – a communication device designed for data transmission by converting analog and digital signals. It enables internet connectivity via telephone lines, cable networks, or wireless technologies. The primary function of a modem is modulation and demodulation, converting digital data into analog format and vice versa."
      },
      "example": {
        "kk": "Модем арқылы компьютер интернетке қосылады.",
        "ru": "С помощью модема компьютер подключается к интернету.",
        "en": "A computer connects to the internet using a modem."
      },
      "image": "https://englishlib.org/dictionary/wlibrary/m/60259c5c052fd8.92997254.jpg",
      "source": ""
    },
    {
      "kk": "Мультимедиа",
      "ru": "Мультимедиа",
      "en": "Multimedia",
      "definition": {
        "kk": "Мультимедиа - цифрлық ақпаратты мәтін, графика, дыбыс, анимация және бейне түрінде ұсынуды қамтамасыз ететін технологиялар жиынтығы. Олар интерактивті интерфейстер жасауға мүмкіндік береді және пайдаланушының жүйемен өзара әрекеттесуін қамтамасыз етеді. Мультимедия білім беру, Жарнама, Дизайн, ойын-сауық және коммуникацияда кеңінен қолданылады.",
        "ru": "Мультимедиа – совокупность технологий, обеспечивающих представление цифровой информации в виде текста, графики, звука, анимации и видео. Они позволяют создавать интерактивные интерфейсы и обеспечивают взаимодействие пользователя с системой. Мультимедиа широко применяется в образовании, рекламе, дизайне, развлечениях и коммуникациях.",
        "en": "Multimedia – a collection of technologies that integrate and present digital information in the form of text, graphics, audio, animation, and video. It enables interactive user experiences through human-computer interaction and is widely used in fields such as education, entertainment, advertising, design, and communication."
      },
      "example": {
        "kk": "Мультимедиалық презентациялар оқыту процесінде кеңінен қолданылады.",
        "ru": "Мультимедийные презентации широко используются в образовательном процессе.",
        "en": "Multimedia presentations are widely used in the educational process."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Стриммер",
      "ru": "Стриммер",
      "en": "Streamer",
      "definition": {
        "kk": "Стриммер - нақты уақыт режимінде мультимедиялық мазмұнды тасымалдауға арналған техникалық құрал. Ол Желілік қосылыстар мен Кодтау технологияларын қолдана отырып, бейне деректерін, аудио ақпаратты және басқа сандық ағындарды өңдейді және жібереді. Мұндай құрылғылар ойын индустриясында, бейне қоңырауларда және кәсіби ағындық қызметтерде кеңінен қолданылады.",
        "ru": "Стриммер – техническое средство, предназначенное для передачи мультимедийного контента в режиме реального времени. Оно обрабатывает и передаёт видеоданные, аудиоинформацию и другие цифровые потоки, используя сетевые соединения и технологии кодирования. Такие устройства широко применяются в игровой индустрии, видеозвонках и профессиональных стриминговых сервисах.",
        "en": "Streamer – a technical tool designed for transmitting multimedia content in real-time. It processes and transfers video, audio, and other digital data streams, incorporating network connections and encoding technologies. Streaming devices are widely used in the gaming industry, video conferencing, and professional broadcasting services."
      },
      "example": {
        "kk": "Стриммер қызметтері арқылы интернетте тікелей эфир трансляцияланады.",
        "ru": "С помощью стриммера осуществляется прямая трансляция в интернете.",
        "en": "Streaming services use streamers to broadcast live content over the internet."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Желілік адаптер",
      "ru": "Сетевой адаптер",
      "en": "Network Adapter",
      "definition": {
        "kk": "Желілік адаптер - компьютерді немесе басқа электрондық құрылғыны жергілікті желіге немесе интернетке қосуға арналған аппараттық модуль. Ол деректерді беру және қабылдау, желілік хаттамаларды өңдеу және байланыс арналарын құру функцияларын орындайды. Желілік адаптерлер сымды (Ethernet) және сымсыз (Wi-Fi) болып табылады.",
        "ru": "Сетевой адаптер – аппаратный модуль, предназначенный для подключения компьютера или другого электронного устройства к локальной сети или интернету. Он выполняет функции передачи и приема данных, обработки сетевых протоколов и установления коммуникационных каналов. Сетевые адаптеры бывают проводными (Ethernet) и беспроводными (Wi-Fi).",
        "en": "Network adapter – a hardware module designed to connect a computer or other electronic device to a local network or the internet. It facilitates data transmission and reception, processes network protocols, and establishes communication channels. Network adapters come in wired (Ethernet) and wireless (Wi-Fi) variants."
      },
      "example": {
        "kk": "Желілік адаптер компьютерді интернетке немесе жергілікті желіге қосуға мүмкіндік береді.",
        "ru": "Сетевой адаптер позволяет подключить компьютер к интернету или локальной сети.",
        "en": "A network adapter enables a computer to connect to the internet or a local network."
      },
      "image": "https://nevateka.ru/upload/iblock/f4e/283160_v01_b.jpg",
      "source": ""
    }
  ],
  "Дәріс 3. Компьютердің программалық қамтамасыз етілуі": [
    {
      "kk": "Операциялық жүйе",
      "ru": "Операционная система",
      "en": "Operating System",
      "definition": {
        "kk": "Операциялық жүйе (ОЖ) – аппараттық және бағдарламалық компоненттердің өзара әрекеттесуін ұйымдастыратын есептеу жүйесінің негізгі бағдарламалық жасақтамасы. Ол ресурстарды басқаруды, файлдық жүйені ұйымдастыруды, көп тапсырманы орындауды және пайдаланушы интерфейсін орнатуды жүзеге асырады. Операциялық жүйелер дербес компьютерлерде, серверлерде, мобильді құрылғыларда және ендірілген жүйелерде қолданылады.",
        "ru": "Операционная система (ОС) – основное программное обеспечение вычислительной системы, организующее взаимодействие аппаратных и программных компонентов. Она выполняет управление ресурсами, организацию файловой системы, обеспечение многозадачности и установку пользовательского интерфейса. Операционные системы применяются в персональных компьютерах, серверах, мобильных устройствах и встроенных системах.",
        "en": "Operating system (OS) – the fundamental software that manages the interaction between hardware and software components in a computing system. It handles resource management, file system organization, multitasking, and user interface functionality. Operating systems are used in personal computers, servers, mobile devices, and embedded systems."
      },
      "example": {
        "kk": "Windows және Linux танымал операциялық жүйелер.",
        "ru": "Windows и Linux популярные операционные системы.",
        "en": "Windows and Linux are popular operating systems."
      },
      "relations": {
        "general_concept": "Программалық қамтамасыз ету",
        "specific_concepts": [
          "Windows",
          "Linux",
          "macOS"
        ],
        "associative": [
          "Файлдық жүйе",
          "Процессор",
          "Интерфейс"
        ]
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Тактілік жиілік",
      "ru": "Тактовая частота",
      "en": "Clock Frequency",
      "definition": {
        "kk": "Тактілік жиілік – уақыт бірлігіндегі тактілік импульстарының санына негізделген есептеу жүйелері мен электрондық құрылғылардың жылдамдығын анықтайтын шама. Ол процессордың немесе басқа чиптердің өнімділігін сипаттайды және герцпен (Hz) өлшенеді. Жоғары тактілі жиілігі құрылғылардың өңдеу қуатын арттыруға көмектеседі.",
        "ru": "Тактовая частота – величина, определяющая скорость работы вычислительных систем и электронных устройств, основанная на количестве тактовых импульсов за единицу времени. Она характеризует производительность процессора или других микросхем и измеряется в герцах (Hz). Более высокая тактовая частота способствует увеличению вычислительной мощности устройств.",
        "en": "Clock frequency – a measure that defines the operational speed of computing systems and electronic devices, based on the number of clock pulses per unit of time. It represents the processing speed of a processor or other microchips and is measured in hertz (Hz). Higher clock frequencies contribute to increased computational performance."
      },
      "example": {
        "kk": "Процессордың тактілік жиілігі жоғары болған сайын, оның жылдамдығы артады.",
        "ru": "Чем выше тактовая частота процессора, тем выше его скорость.",
        "en": "The higher the clock frequency of the processor, the faster its speed."
      },
      "relations": {
        "synonyms": [
          "процессордың жылдамдығы"
        ],
        "homonyms": [],
        "general_concept": {
          "kk": "Тактілік жиілік процессордың негізгі өнімділік көрсеткіші ретінде сипатталады.",
          "ru": "Тактовая частота описывается как ключевой показатель производительности процессора.",
          "en": "Clock frequency is described as a key indicator of processor performance."
        },
        "specific_concepts": {
          "kk": [
            "генератор",
            "такт"
          ],
          "ru": [
            "генератор",
            "такт"
          ],
          "en": [
            "generator",
            "cycle"
          ]
        },
        "associative": [
          "жоғары жылдамдық",
          "өнімділік"
        ]
      }
    },
    {
      "kk": "Қолданбалы бағдарламалар",
      "ru": "Прикладные программы",
      "en": "Application software",
      "definition": {
        "kk": "Қолданбалы бағдарламалар - белгілі бір пайдаланушы тапсырмаларын немесе кәсіби операцияларды орындауға арналған бағдарламалық құрал түрі. Олар деректерді өңдеу, есептеулер жүргізу, визуализация жасау және әртүрлі функционалдық әрекеттер үшін қолданылады. Қолданбалы бағдарламаларға кеңсе пакеттері, графикалық редакторлар, мультимедиялық құралдар және мамандандырылған салалық қосымшалар кіреді.",
        "ru": "Прикладные программы – тип программного обеспечения, предназначенный для выполнения конкретных пользовательских задач или профессиональных операций. Они используются для обработки данных, выполнения расчетов, создания визуализации и различных функциональных действий. Прикладные программы включают офисные пакеты, графические редакторы, мультимедийные инструменты и специализированные отраслевые приложения.",
        "en": "Application software – a category of software designed to fulfill specific user needs or professional tasks. It is utilized for data processing, performing calculations, creating visualizations, and executing various functional operations. Application software includes office suites, graphic editors, multimedia tools, and specialized industry applications."
      },
      "example": {
        "kk": "Microsoft Word мәтінді өңдеу үшін қолданылады.",
        "ru": "Microsoft Word используется для обработки текста.",
        "en": "Microsoft Word is used for text processing."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Кітапхана бағдарламалары",
      "ru": "Библиотечные программы",
      "en": "Library Programs",
      "definition": {
        "kk": "Кітапхана бағдарламалары - жиі қолданылатын функцияларды, алгоритмдерді және деректер құрылымдарын сақтауға және қайта пайдалануға арналған бағдарламалық жасақтама жиынтығы. Олар кодтың тиімділігі мен құрылымдылығын арттыру арқылы бағдарламалау процесін жеңілдетеді. Кітапхана бағдарламалары жүйелік бағдарламалауда, қосымшаларды әзірлеуде және ғылыми есептеулерде кеңінен қолданылады.",
        "ru": "Библиотечные программы – совокупность программного обеспечения, предназначенного для хранения и повторного использования часто применяемых функций, алгоритмов и структур данных. Они облегчают процесс программирования, повышая эффективность и структурированность кода. Библиотечные программы широко применяются в системном программировании, разработке приложений и научных вычислениях.",
        "en": "Library programs – a collection of software designed for storing and reusing commonly utilized functions, algorithms, and data structures. They simplify the programming process, enhancing code efficiency and maintainability. Library programs are widely used in system software, application development, and scientific computing."
      },
      "example": {
        "kk": "Python тіліндегі 'math' кітапханасы математикалық операцияларды орындауға мүмкіндік береді.",
        "ru": "Библиотека 'math' в Python позволяет выполнять математические операции.",
        "en": "The 'math' library in Python enables mathematical operations."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Ассемблер",
      "ru": "Ассемблер",
      "en": "Assembler",
      "definition": {
        "kk": "Ассемблер - төмен деңгейлі бағдарламалау тілінің кодын процессордың машиналық командаларына түрлендіретін аудармашы бағдарламалық жасақтама. Бұл әзірлеушілерге жүйелік бағдарламалауды және аппараттық басқаруды төмен деңгейде орындауға мүмкіндік береді. Ассемблер ендірілген жүйелерді, операциялық жүйелерді және жоғары өнімділік талаптары бар тапсырмаларды әзірлеуде кеңінен қолданылады.",
        "ru": "Ассемблер – программное обеспечение-переводчик, преобразующее код низкоуровневого языка программирования в машинные команды процессора. Он позволяет разработчикам выполнять системное программирование и управление аппаратным обеспечением на низком уровне. Ассемблер широко используется в разработке встроенных систем, операционных систем и задачах с высокими требованиями к производительности.",
        "en": "Assembler – a translator software that converts low-level programming language code into machine instructions for the processor. It enables developers to perform system-level programming and hardware control at a low abstraction level. Assemblers are widely used in embedded systems development, operating system creation, and high-performance computing tasks."
      },
      "example": {
        "kk": "Ассемблер көмегімен микропроцессордың машиналық кодтарын жазуға болады.",
        "ru": "С помощью ассемблера можно писать машинные коды для микропроцессора.",
        "en": "Assembler allows writing machine codes for microprocessors."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Интерпретатор",
      "ru": "Интерпретатор",
      "en": "Interpreter",
      "definition": {
        "kk": "Интерпретатор – бағдарламалау тілінің командаларын алдымен оларды машина кодына аудармай орындауға мүмкіндік беретін бағдарламалық құрал. Ол бағдарламалардың интерактивті орындалуын қамтамасыз ете отырып, кодты жол бойынша талдайды және орындайды. Интерпретаторлар сценарий және динамикалық бағдарламалау тілдерінде кеңінен қолданылады.",
        "ru": "Интерпретатор – программное средство, позволяющее выполнять команды языка программирования без предварительного перевода их в машинный код. Он анализирует и исполняет код построчно, обеспечивая интерактивное выполнение программ. Интерпретаторы широко применяются в скриптовых и динамических языках программирования.",
        "en": "Interpreter – a software tool that enables the execution of programming language commands without converting them into machine code beforehand. It analyzes and runs code line by line, ensuring interactive program execution. Interpreters are commonly used for scripting and dynamic programming languages."
      },
      "example": {
        "kk": "Python тілі интерпретаторға негізделген, сондықтан кодты бірден орындауға болады.",
        "ru": "Язык Python основан на интерпретаторе, поэтому код можно выполнять сразу.",
        "en": "Python is interpreter-based, allowing code to be executed immediately."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Компилятор",
      "ru": "Компилятор",
      "en": "Compiler",
      "definition": {
        "kk": "Компилятор - жоғары деңгейлі бағдарламалау тілінде жазылған кодты машиналық немесе аралық кодқа түрлендіретін бағдарламалық құрал. Ол бүкіл бағдарламаның аудармасын орындайды, орындалатын нұсқасын жасайды, бұл өнімділіктің артуына ықпал етеді. Компилятор синтаксистік және семантикалық қателерді анықтау арқылы бастапқы кодты талдайды.",
        "ru": "Компилятор – программное средство, преобразующее код, написанный на языке программирования высокого уровня, в машинный или промежуточный код. Он выполняет перевод всей программы целиком, создавая исполняемую версию, что способствует увеличению производительности. Компилятор анализирует исходный код, выявляя синтаксические и семантические ошибки.",
        "en": "Compiler – a software tool that converts high-level programming language code into machine or intermediate code. It processes the entire program at once, generating an executable version, which enhances performance and efficiency. A compiler also analyzes the source code, detecting syntax and semantic errors."
      },
      "example": {
        "kk": "C++ бағдарламасының кодын компилятор арқылы орындалатын файлға аударуға болады.",
        "ru": "Код программы на C++ можно перевести в исполняемый файл с помощью компилятора.",
        "en": "A C++ program's code can be compiled into an executable file using a compiler."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Драйвер",
      "ru": "Драйвер",
      "en": "Driver",
      "definition": {
        "kk": "Драйвер - бұл аппараттық құрылғылар мен компьютердің амалдық жүйесі арасындағы өзара әрекеттесуді қамтамасыз ететін бағдарламалық жасақтама компоненті. Ол құрылғылардың дұрыс жұмыс істеуі үшін қажетті командаларды аударады және олардың жұмысын басқарады. Драйверлер принтерлер, графикалық карталар және желілік адаптерлер сияқты әртүрлі перифериялық құрылғыларға қолданылады.",
        "ru": "Драйвер – программный компонент, обеспечивающий взаимодействие между аппаратными устройствами и операционной системой компьютера. Он переводит команды, необходимые для корректной работы устройств, и управляет их функционированием. Драйверы применяются для различных периферийных устройств, таких как принтеры, видеокарты и сетевые адаптеры.",
        "en": "Driver – a software component that facilitates interaction between hardware devices and the computer's operating system. It translates and manages commands required for proper device functionality. Drivers are used for various peripherals, including printers, graphics cards, and network adapters."
      },
      "example": {
        "kk": "Принтердің драйвері компьютерге принтерді басқаруға мүмкіндік береді.",
        "ru": "Драйвер принтера позволяет компьютеру управлять принтером.",
        "en": "Printer drivers allow the computer to manage the printer."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Антивирус",
      "ru": "Антивирус",
      "en": "Antivirus",
      "definition": {
        "kk": "Антивирус - компьютерлік жүйелердегі зиянды бағдарламаларды анықтауға, алдын алуға және жоюға арналған бағдарламалық жасақтама. Ол жүйенің тұрақты жұмысын қамтамасыз ете отырып, вирустарды, трояндарды, зиянды кодтарды және басқа киберқауіптерді таниды. Антивирустық бағдарламалар файлдарды сканерлеуді, эвристикалық талдауды және нақты уақыттағы бақылауды жүзеге асырады.",
        "ru": "Антивирус – программное обеспечение, предназначенное для обнаружения, предотвращения и удаления вредоносных программ в компьютерных системах. Оно распознаёт вирусы, трояны, вредоносные коды и другие киберугрозы, обеспечивая стабильную работу системы. Антивирусные программы выполняют сканирование файлов, эвристический анализ и мониторинг в реальном времени.",
        "en": "Antivirus – security software designed to detect, prevent, and remove malicious programs in computing systems. It identifies viruses, trojans, malware, and other cyber threats, ensuring stable system performance. Antivirus programs perform file scanning, heuristic analysis, and real-time monitoring functions."
      },
      "example": {
        "kk": "Антивирус бағдарламасы зиянды бағдарламаларды анықтайды.",
        "ru": "Антивирус обнаруживает вредоносные программы.",
        "en": "The antivirus detects harmful software."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Бағдарламалау тілдері",
      "ru": "Языки программирования",
      "en": "Programming Languages",
      "definition": {
        "kk": "Бағдарламалау тілдері - есептеу жүйелерінде алгоритмдерді сипаттауға және орындауға арналған формальды синтаксисі мен семантикасы бар жасанды тілдер. Олар код жазу, деректерді өңдеу, есептеу процестерін басқару және бағдарламаларды әзірлеу үшін қолданылады. Бағдарламалау тілдері төмен деңгейлі, орта деңгейлі және жоғары деңгейлі болып бөлінеді.",
        "ru": "Языки программирования – искусственные языки с формальным синтаксисом и семантикой, предназначенные для описания и выполнения алгоритмов в вычислительных системах. Они используются для написания кода, обработки данных, управления вычислительными процессами и разработки программ. Языки программирования делятся на низкоуровневые, среднеуровневые и высокоуровневые.",
        "en": "Programming languages – artificial languages with formal syntax and semantics designed for describing and executing algorithms in computing systems. They are used for writing code, processing data, controlling computational processes, and developing software. Programming languages are categorized into low-level, mid-level, and high-level languages."
      },
      "example": {
        "kk": "Python бағдарламалауды үйрену үшін кеңінен қолданылады.",
        "ru": "Python широко используется для изучения программирования.",
        "en": "Python is widely used for learning programming."
      },
      "image": "",
      "source": ""
    }
  ],
  "Дәріс 4. Ақпаратты өңдеу": [
    {
      "kk": "Мәліметтер базасы",
      "ru": "База данных",
      "en": "Database",
      "definition": {
        "kk": "Мәліметтер базасы - есептеу жүйелерінде құрылымдық ақпаратты сақтауға, басқаруға және өңдеуге арналған ұйымдастырылған мәліметтер жиынтығы. Ол деректерді тиімді сақтау және іздеу үшін арнайы форматтар мен жүйелерді қолданады. Реляциялық, иерархиялық, желілік және Объектілік мәліметтер базасының бірнеше модельдері бар.",
        "ru": "База данных – организованный набор данных, предназначенный для хранения, управления и обработки структурированной информации в вычислительных системах. Она использует специальные форматы и системы для эффективного хранения и поиска данных. Существует несколько моделей баз данных, включая реляционные, иерархические, сетевые и объектные.",
        "en": "Database – an organized collection of data used for storing, managing, and processing structured information within computing systems. It employs specialized formats and systems for efficient data storage and retrieval. Databases are structured in various models, including relational, hierarchical, network, and object-oriented designs."
      },
      "example": {
        "kk": "Мәліметтер базасы клиенттердің ақпаратын ұйымдастырады.",
        "ru": "База данных организует информацию о клиентах.",
        "en": "The database organizes customer information."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Алгоритм",
      "ru": "Алгоритм",
      "en": "Algorithm",
      "definition": {
        "kk": "Алгоритм - тапсырманы орындауға немесе мәселені шешуге арналған реттелген әрекеттер тізбегі. Бұл нақты қадамдардан тұратын математикалық немесе логикалық ережелер жүйесі және бағдарламалауда, деректерді өңдеуде және инженерлік есептеулерде кеңінен қолданылады. Алгоритмдердің күрделілігі мен тиімділігі оларды жүзеге асыру әдісіне байланысты өзгереді.",
        "ru": "Алгоритм – упорядоченная последовательность действий, предназначенная для выполнения задачи или решения проблемы. Он представляет собой систему математических или логических правил, состоящих из четких шагов, и широко применяется в программировании, обработке данных и инженерных расчетах. Сложность и эффективность алгоритмов варьируются в зависимости от метода их реализации.",
        "en": "Algorithm – an ordered sequence of actions designed to accomplish a task or solve a problem. It is structured as a set of mathematical or logical rules consisting of precise steps and is widely used in programming, data processing, and engineering calculations. The complexity and efficiency of algorithms vary depending on their implementation methods."
      },
      "example": {
        "kk": "Сұрыптау алгоритмдері деректерді ретке келтіреді.",
        "ru": "Алгоритмы сортировки упорядочивают данные.",
        "en": "Sorting algorithms organize data."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Өңдеу жылдамдығы",
      "ru": "Скорость обработки",
      "en": "Processing Speed",
      "definition": {
        "kk": "Өңдеу жылдамдығы - есептеу жүйелерінде немесе бағдарламалық жасақтамада деректерді талдау, түрлендіру және орындау уақытын сипаттайтын параметр. Бұл процессордың сағат жылдамдығына, жадтың қол жетімділігіне және алгоритмдердің тиімділігіне байланысты. Өңдеудің жоғары жылдамдығы ақпаратты жылдам өңдеуге және күрделі есептеу операцияларын орындауға мүмкіндік береді.",
        "ru": "Скорость обработки – параметр, характеризующий время анализа, преобразования и выполнения данных в вычислительных системах или программном обеспечении. Она зависит от тактовой частоты процессора, доступности памяти и эффективности алгоритмов. Высокая скорость обработки обеспечивает быструю обработку информации и выполнение сложных вычислительных операций.",
        "en": "Processing speed – a metric that defines the time required for analyzing, transforming, and executing data within computing systems or software applications. It is influenced by processor clock frequency, memory availability, and algorithm efficiency. Higher processing speed enables rapid data handling and execution of complex computations."
      },
      "example": {
        "kk": "Жоғары жылдамдықты процессор деректерді тез өңдей алады.",
        "ru": "Высокоскоростной процессор быстро обрабатывает данные.",
        "en": "A high-speed processor can quickly process data."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Форматтау",
      "ru": "Форматирование",
      "en": "Formatting",
      "definition": {
        "kk": "Форматтау - деректерді сақтау немесе көрнекі түрде көрсету үшін белгілі бір стандарттар мен ережелерге сәйкес құрылымдау және өңдеу процесі. Есептеу жүйелерінде форматтау файлдарды, мәтіндерді, дискілерді және басқа да ақпараттық объектілерді ұйымдастыруды қамтиды.",
        "ru": "Форматирование – процесс структурирования и обработки данных в соответствии с определёнными стандартами и правилами для их хранения или визуального представления. В вычислительных системах форматирование включает организацию файлов, текстов, дисков и других информационных объектов.",
        "en": "Formatting – the process of structuring and processing data according to specific standards and rules for storage or visual representation. In computing systems, formatting involves organizing files, texts, disks, and other informational objects."
      },
      "example": {
        "kk": "Деректерді кестелерге форматтау оларды оқуды жеңілдетеді.",
        "ru": "Форматирование данных в таблицах облегчает их чтение.",
        "en": "Formatting data into tables makes it easier to read."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Кэш",
      "ru": "Кэш",
      "en": "Cache",
      "definition": {
        "kk": "Кэш -ақпаратқа қол жеткізуді жеделдетуге арналған есептеу жүйелеріндегі кэш механизмі немесе уақытша сақтау құрылғысы. Кэш жады процессор мен жедел жад арасындағы деректерді бөлісу жылдамдығын арттырады, ал бағдарламалық жасақтама кэші жүйенің жұмысын жақсарта отырып, жиі қолданылатын деректерді сақтайды.",
        "ru": "Кэш – механизм или устройство временного хранения данных в вычислительных системах, предназначенное для ускорения доступа к информации. Кэш-память повышает скорость обмена данными между процессором и оперативной памятью, а программный кэш сохраняет часто используемые данные, улучшая производительность системы.",
        "en": "Cache – a temporary data storage mechanism or device used in computing systems to speed up access to frequently used information. Cache memory enhances data transfer speed between the processor and RAM, while software caches store frequently accessed data to improve system efficiency."
      },
      "example": {
        "kk": "Кэш браузердің жылдамдығын арттырады.",
        "ru": "Кэш увеличивает скорость работы браузера.",
        "en": "Cache increases browser speed."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Microsoft Word",
      "ru": "Microsoft Word",
      "en": "Microsoft Word",
      "definition": {
        "kk": "Microsoft Word - мәтіндік құжаттарды жасауға, өңдеуге және пішімдеуге арналған кеңейтілген бағдарламалық құрал. Ол мәтін енгізу, стильдерді реттеу, кестелер мен кескіндерді кірістіру, емлені тексеру және құжаттарды әртүрлі форматта сақтау мүмкіндіктерін ұсынады. Microsoft Word кеңсе жұмысында, ғылыми зерттеулерде және баспа жұмыстарында кеңінен қолданылады.",
        "ru": "Microsoft Word – расширенное программное обеспечение для создания, редактирования и форматирования текстовых документов. Оно предоставляет возможности ввода текста, настройки стилей, вставки таблиц и изображений, проверки орфографии и сохранения документов в различных форматах. Microsoft Word широко используется в офисной работе, научных исследованиях и издательской деятельности.",
        "en": "Microsoft Word – an advanced software application for creating, editing, and formatting text documents. It provides features such as text input, style adjustments, table and image insertion, spell checking, and document saving in various formats. Microsoft Word is widely used in office tasks, academic research, and publishing."
      },
      "example": {
        "kk": "Word бағдарламасында есеп берудің мәтінін дайындауға болады.",
        "ru": "В Word можно подготовить текст отчёта.",
        "en": "You can prepare a report text in Word."
      },
      "relations": {
        "synonyms": [
          "Мәтіндік редактор"
        ],
        "general_concept": {
          "kk": "Мәтіндермен жұмыс істеу үшін арналған бағдарламалық құрал.",
          "ru": "Программное обеспечение для работы с текстами.",
          "en": "Software for working with texts."
        },
        "specific_concepts": {
          "kk": [
            "құжат",
            "қаріп"
          ],
          "ru": [
            "документ",
            "шрифт"
          ],
          "en": [
            "document",
            "font"
          ]
        },
        "associative": [
          "мәтін",
          "дизайн"
        ]
      }
    },
    {
      "kk": "PowerPoint",
      "ru": "PowerPoint",
      "en": "PowerPoint",
      "definition": {
        "kk": "Microsoft PowerPoint - визуалды презентацияларды жасауға, өңдеуге және көрсетуге арналған бағдарламалық жасақтама. Ол слайдтар жасауға, мәтін, суреттер, диаграммалар мен медиа элементтерін қосуға, анимациялар мен бейнелерді теңшеуге мүмкіндік береді. Microsoft PowerPoint бизнесте, білім беруде және шығармашылық жобаларда кеңінен қолданылады.",
        "ru": "Microsoft PowerPoint – программное обеспечение, предназначенное для создания, редактирования и демонстрации визуальных презентаций. Оно предоставляет возможности создания слайдов, добавления текста, изображений, диаграмм и мультимедиа элементов, а также настройки анимации и видеороликов. Microsoft PowerPoint широко используется в бизнесе, образовании и творческих проектах.",
        "en": "Microsoft PowerPoint – a software application designed for creating, editing, and presenting visual presentations. It offers features for slide creation, text, image, chart, and multimedia integration, as well as animation and video editing capabilities. Microsoft PowerPoint is widely utilized in business, education, and creative fields."
      },
      "example": {
        "kk": "PowerPoint арқылы графиктер мен диаграммалар бар презентация жасауға болады.",
        "ru": "С помощью PowerPoint можно создать презентацию с графиками и диаграммами.",
        "en": "You can create a presentation with graphs and charts using PowerPoint."
      },
      "relations": {
        "synonyms": [
          "Презентация құралы"
        ],
        "general_concept": {
          "kk": "Ақпаратты визуалды көрсетуге арналған бағдарлама.",
          "ru": "Программа для визуального представления информации.",
          "en": "Software for visually presenting information."
        },
        "specific_concepts": {
          "kk": [
            "диаграмма",
            "графика"
          ],
          "ru": [
            "диаграмма",
            "графика"
          ],
          "en": [
            "diagram",
            "graphics"
          ]
        },
        "associative": [
          "дизайн",
          "слайд"
        ]
      }
    },
    {
      "kk": "Excel",
      "ru": "Excel",
      "en": "Excel",
      "definition": {
        "kk": "Microsoft Excel - деректерді өңдеуге, кестелер құруға және сандық талдауды орындауға арналған бағдарламалық жасақтама. Бұл формулалар мен функциялар арқылы есептеулерді автоматтандыруға, диаграммалар құруға және үлкен көлемдегі ақпаратты ұйымдастыруға мүмкіндік береді. Microsoft Excel бизнесте, экономикада, ғылымда және инженерияда кеңінен қолданылады.",
        "ru": "Microsoft Excel – программное обеспечение, предназначенное для обработки данных, создания таблиц и выполнения числового анализа. Оно позволяет автоматизировать расчёты с помощью формул и функций, строить диаграммы и систематизировать большие объёмы информации. Microsoft Excel широко используется в бизнесе, экономике, науке и инженерии.",
        "en": "Microsoft Excel – a software application designed for data processing, table creation, and numerical analysis. It enables automated calculations using formulas and functions, facilitates chart generation, and organizes large datasets efficiently. Microsoft Excel is widely applied in business, economics, science, and engineering."
      },
      "example": {
        "kk": "Excel бағдарламасында деректерді талдап, диаграмма жасауға болады.",
        "ru": "В Excel можно анализировать данные и создавать диаграммы.",
        "en": "You can analyze data and create charts in Excel."
      },
      "relations": {
        "synonyms": [
          "Кестелер редакторы"
        ],
        "general_concept": "Деректермен жұмыс істеуге арналған құрал.",
        "specific_concepts": [
          "кесте",
          "формула",
          "ұяшық"
        ],
        "associative": [
          "анализ",
          "гистограмма"
        ]
      }
    },
    {
      "kk": "Кесте",
      "ru": "Таблица",
      "en": "Table",
      "definition": {
        "kk": "Кесте - деректерді құрылымдық түрде ұсынуға мүмкіндік беретін ақпаратты ұйымдастыру тәсілі. Ол жолдар мен бағандардан тұрады және сандық, мәтіндік немесе графикалық деректерді жүйелі түрде көрсету үшін қолданылады. Кестелер ғылыми зерттеулерде, бизнес-аналитикада және бағдарламалық жасақтамада кеңінен қолданылады.",
        "ru": "Таблица – способ организации информации, позволяющий представить данные в структурированном виде. Она состоит из строк и столбцов и используется для систематизированного отображения числовых, текстовых или графических данных. Таблицы широко применяются в научных исследованиях, бизнес-аналитике и программной инженерии.",
        "en": "Table – a method of organizing information that enables data to be presented in a structured format. It consists of rows and columns and is used for systematically displaying numerical, textual, or graphical data. Tables are widely used in scientific research, business analytics, and software engineering."
      },
      "example": {
        "kk": "Excel кестесінде деректерді талдауға болады.",
        "ru": "В таблице Excel можно анализировать данные.",
        "en": "You can analyze data in an Excel table."
      },
      "relations": {
        "synonyms": [
          "мәліметтер"
        ],
        "general_concept": "Деректерді жүйелеу тәсілі.",
        "specific_concepts": [
          "қатар",
          "баған",
          "ұяшық"
        ],
        "associative": [
          "деректер",
          "ұйымдастыру"
        ]
      }
    },
    {
      "kk": "Қатар",
      "ru": "Строка",
      "en": "Row",
      "definition": {
        "kk": "Қатар – кестеде деректерді көлденең бағытта ұйымдастыру элементі.",
        "ru": "Строка – элемент организации данных в таблице по горизонтали.",
        "en": "Row is an element that organizes data horizontally in a table."
      },
      "example": {
        "kk": "Қатардың әрбір ұяшығында бір жазба орналасады.",
        "ru": "В каждой ячейке строки содержится одна запись.",
        "en": "Each cell in a row contains one record."
      },
      "relations": {
        "synonyms": [
          "көлденең элемент"
        ],
        "general_concept": "Қатар деректерді кестеде көлденең бағытта көрсетуге арналған.",
        "specific_concepts": [
          "ұяшық",
          "баған"
        ],
        "associative": [
          "деректер",
          "ұйымдастыру"
        ]
      }
    },
    {
      "kk": "Баған",
      "ru": "Столбец",
      "en": "Column",
      "definition": {
        "kk": "Баған – кестеде деректерді тік бағытта ұйымдастыру элементі.",
        "ru": "Столбец – элемент организации данных в таблице по вертикали.",
        "en": "Column is an element that organizes data vertically in a table."
      },
      "example": {
        "kk": "Бағандар арқылы деректерді топтастыруға болады.",
        "ru": "С помощью столбцов можно группировать данные.",
        "en": "Columns can be used to group data."
      },
      "relations": {
        "synonyms": [
          "тік элемент"
        ],
        "general_concept": "Баған деректерді кестеде тік бағытта көрсетуге арналған.",
        "specific_concepts": [
          "қатар",
          "ұяшық"
        ],
        "associative": [
          "топтастыру",
          "деректер"
        ]
      }
    },
    {
      "kk": "Ұяшық",
      "ru": "Ячейка",
      "en": "Cell",
      "definition": {
        "kk": "Ұяшық – кестеде қатар мен бағанның қиылысында орналасқан деректер элементі.",
        "ru": "Ячейка – элемент данных, находящийся на пересечении строки и столбца в таблице.",
        "en": "Cell is a data element located at the intersection of a row and a column in a table."
      },
      "example": {
        "kk": "Ұяшықта бір мән немесе формула сақталуы мүмкін.",
        "ru": "В ячейке может храниться одно значение или формула.",
        "en": "A cell can contain a single value or a formula."
      },
      "relations": {
        "synonyms": [
          "деректер элементі"
        ],
        "general_concept": "Ұяшық деректерді сақтау үшін арналған.",
        "specific_concepts": [
          "қатар",
          "баған"
        ],
        "associative": [
          "мән",
          "формула"
        ]
      }
    },
    {
      "kk": "Құжат",
      "ru": "Документ",
      "en": "Document",
      "definition": {
        "kk": "Құжат - ақпаратты жазбаша, графикалық немесе электрондық түрде сақтау және беру үшін жасалған құрылымдық материал. Ол заңды, ғылыми, техникалық немесе әкімшілік маңызы бар деректерді жүйелеу үшін қолданылады. Құжаттар мәтіндік, графикалық, аудио және мультимедиялық болуы мүмкін.",
        "ru": "Документ – структурированный материал, созданный для хранения и передачи информации в письменной, графической или электронной форме. Он используется для систематизации данных, имеющих юридическое, научное, техническое или административное значение. Документы могут быть текстовыми, графическими, аудиофайлами и мультимедийными.",
        "en": "Document – a structured material created for storing and transmitting information in written, graphical, or electronic form. It is used for organizing data with legal, scientific, technical, or administrative significance. Documents can exist in text, image, audio, and multimedia formats."
      },
      "example": {
        "kk": "Құжатты Word бағдарламасында дайындауға болады.",
        "ru": "Документ можно подготовить в программе Word.",
        "en": "A document can be prepared using Word software."
      },
      "relations": {
        "synonyms": [
          "файл"
        ],
        "general_concept": "Құжат ақпаратты сақтау үшін қолданылады.",
        "specific_concepts": [
          "Word",
          "қаріп"
        ],
        "associative": [
          "мәліметтер",
          "форматтау"
        ]
      }
    },
    {
      "kk": "Қаріп",
      "ru": "Шрифт",
      "en": "Font",
      "definition": {
        "kk": "Қаріп - мәтіндік таңбалардың графикалық бейнесін анықтайтын және оларды белгілі бір стильде көрсетуге мүмкіндік беретін типографиялық жүйе. Ол әріптердің пішінін, өлшемін, қанықтылығын және таңбааралық қашықтықты реттейтін параметрлер жиынтығын қамтиды. Қаріптер баспа өнімдерінде, веб-дизайнда және сандық медиада кеңінен қолданылады.",
        "ru": "Шрифт – типографическая система, определяющая графическое изображение текстовых символов и позволяющая их отображать в определённом стиле. Он включает в себя набор параметров, регулирующих форму букв, размер, насыщенность и межсимвольное расстояние. Шрифты широко применяются в печатной продукции, веб-дизайне и цифровых медиа.",
        "en": "Font – a typographic system that defines the graphical representation of text characters, enabling them to be displayed in a specific style. It consists of a set of parameters that regulate letter shape, size, weight, and spacing. Fonts are widely used in print media, web design, and digital environments."
      },
      "example": {
        "kk": "Құжат дизайнында әртүрлі қаріптерді қолдануға болады.",
        "ru": "В дизайне документа можно использовать различные шрифты.",
        "en": "Different fonts can be used in document design."
      },
      "relations": {
        "synonyms": [
          "мәтін стилі"
        ],
        "general_concept": "Қаріп мәтіннің көркемдік ерекшелігін анықтайды.",
        "specific_concepts": [
          "дизайн",
          "формат"
        ],
        "associative": [
          "эстетика",
          "оқылымдығы"
        ]
      }
    },
    {
      "kk": "Маркер",
      "ru": "Маркер",
      "en": "Marker",
      "definition": {
        "kk": "Маркер-белгілі бір элементтерді, параметрлерді немесе позицияларды көрсету, бөлектеу немесе көрсету үшін қолданылатын объект немесе виртуалды құрал. Ол ақпаратты бөлу, навигация және деректерді құрылымдау үшін кеңсе тауарларында, бағдарламалық жасақтамада және ғылыми зерттеулерде қолданылады.",
        "ru": "Маркер – объект или виртуальный инструмент, используемый для обозначения, выделения или указания конкретных элементов, параметров или позиций. Он применяется в канцелярских принадлежностях, программном обеспечении и научных исследованиях для выделения информации, навигации и структурирования данных.",
        "en": "Marker – an object or virtual tool used for indicating, highlighting, or specifying particular elements, parameters, or positions. It is utilized in stationery supplies, software applications, and scientific research for information emphasis, navigation, and data structuring."
      },
      "example": {
        "kk": "Маркер арқылы негізгі ұғымдарды белгілеуге болады.",
        "ru": "С помощью маркера можно выделить ключевые концепции.",
        "en": "Key concepts can be highlighted using a marker."
      },
      "relations": {
        "synonyms": [
          "белгілеу элементі"
        ],
        "general_concept": "Маркер мәтіннің назар аударуға тұрарлық бөлімдерін көрсетеді.",
        "specific_concepts": [
          "құжат",
          "құрал"
        ],
        "associative": [
          "маңызды",
          "белгілеу"
        ]
      }
    },
    {
      "kk": "Формула",
      "ru": "Формула",
      "en": "Formula",
      "definition": {
        "kk": "Формула-сандық және мәтіндік деректерді өңдеуге, есептеулер жүргізуге және автоматтандырылған талдауға арналған арнайы математикалық өрнек. Ол арифметикалық операторлар жиынтығынан, функциялардан және ұяшықтарға енгізілген сілтемелерден тұрады.",
        "ru": "Формула – специальное математическое выражение, предназначенное для обработки числовых и текстовых данных, выполнения вычислений и автоматизированного анализа. Она состоит из набора арифметических операторов, функций и ссылок, вводимых в ячейки.",
        "en": "Formula - a special mathematical expression designed for processing numerical and textual data, performing calculations and automated analysis. It consists of a set of arithmetic operators, functions, and links entered into cells."
      },
      "example": {
        "kk": "Excel бағдарламасында формулаларды қолданып, есептеулерді автоматтандыруға болады.",
        "ru": "В Excel можно использовать формулы для автоматизации расчётов.",
        "en": "Formulas can be used in Excel to automate calculations."
      },
      "relations": {
        "synonyms": [
          "есептеу"
        ],
        "general_concept": "Формулалар есептерді оңайлату үшін арналған.",
        "specific_concepts": [
          "математика",
          "оператор"
        ],
        "associative": [
          "логика",
          "есеп"
        ]
      }
    },
    {
      "kk": "Формат",
      "ru": "Формат",
      "en": "Format",
      "definition": {
        "kk": "Формат - белгілі бір құрылымға сәйкес деректерді ұсыну және сақтау тәсілі. Ол ақпарат түріне, пайдалану ортасына және өңдеу әдістеріне байланысты өзгереді. Формат мәтіндік, графикалық, аудиовизуалды және есептеу ақпаратын ұйымдастыруда шешуші рөл атқарады.",
        "ru": "Формат – способ представления и хранения данных в соответствии с определённой структурой. Он варьируется в зависимости от типа информации, среды использования и методов обработки. Формат играет ключевую роль в организации текстовой, графической, аудиовизуальной и вычислительной информации.",
        "en": "Format – a method of presenting and storing data according to a specified structure. It varies depending on the type of information, usage environment, and processing techniques. Format plays a crucial role in organizing textual, graphical, audiovisual, and computational data."
      },
      "example": {
        "kk": "Құжаттың дұрыс форматын таңдау оның оқылымдылығын арттырады.",
        "ru": "Правильный формат документа улучшает его читаемость.",
        "en": "Choosing the right format for a document improves its readability."
      },
      "relations": {
        "synonyms": [
          "құрылым"
        ],
        "general_concept": "Формат деректердің тәртібі мен көрінісін анықтайды.",
        "specific_concepts": [
          "құжат",
          "құрал"
        ],
        "associative": [
          "нақтылық",
          "құрылым"
        ]
      }
    },
    {
      "kk": "Диаграмма",
      "ru": "Диаграмма",
      "en": "Chart",
      "definition": {
        "kk": "Диаграмма-сандық, логикалық немесе құрылымдық ақпаратты графикалық форматта көрсетуге мүмкіндік беретін деректерді визуалды түрде ұсыну әдісі. Диаграммалар тенденцияларды, қатынастарды және салыстыруларды анықтау үшін қолданылады. Олардың түрлерінің ішінде гистограмма, сызықтық диаграмма, дөңгелек диаграмма және шашырау диаграммасы бар.",
        "ru": "Диаграмма – метод визуального представления данных, позволяющий отображать числовую, логическую или структурную информацию в графическом формате. Диаграммы используются для выявления тенденций, взаимосвязей и сравнений. Среди их видов можно выделить гистограмму, линейную диаграмму, круговую диаграмму и диаграмму рассеяния.",
        "en": "Chart - a method of visually representing data, allowing numerical, logical, or structural information to be displayed in a graphical format. Diagrams are used to identify trends, relationships, and comparisons. Common types include bar charts, line graphs, pie charts, and scatter plots."
      },
      "example": {
        "kk": "Excel бағдарламасында сатылым деректерін диаграмма түрінде көрсетуге болады.",
        "ru": "В Excel можно представить данные о продажах в виде диаграммы.",
        "en": "Sales data can be displayed as a chart in Excel."
      },
      "relations": {
        "synonyms": [
          "графика"
        ],
        "general_concept": "Диаграммалар деректердің үлгілерін көрсету үшін арналған.",
        "specific_concepts": [
          "гистограмма",
          "график"
        ],
        "associative": [
          "визуализация",
          "талдау"
        ]
      }
    },
    {
      "kk": "Баяндамашы көрінісі",
      "ru": "Режим докладчика",
      "en": "Presenter View",
      "definition": {
        "kk": "Презентацияны көрсету кезінде баяндамашыға арналған арнайы көрініс, ол алдағы слайдты, баяндамашы жазбаларын және уақытты көрсетеді.",
        "ru": "Специальный режим просмотра для докладчика во время показа презентации, отображающий следующий слайд, заметки докладчика и время.",
        "en": "A special view for the presenter during a presentation that shows the next slide, speaker notes, and the time."
      },
      "example": {
        "kk": "Баяндамашы көрінісін пайдаланып, баяндамамды оңай өткіздім.",
        "ru": "Используя режим докладчика, я легко провел свою презентацию.",
        "en": "Using Presenter View, I delivered my presentation smoothly."
      },
      "relations": {
        "synonyms": [
          "Докладчик режимі (kk)",
          " Вид для докладчика (ru)"
        ],
        "general_concept": "Презентацияны көрсету",
        "specific_concepts": [
          "Слайд көрсетілімі",
          " Баяндамашы жазбалары",
          " Уақыт"
        ],
        "associative": [
          "Презентацияны басқару",
          " Уақытты басқару"
        ]
      }
    },
    {
      "kk": "Біріктіру",
      "ru": "Слияние",
      "en": "Mail Merge",
      "definition": {
        "kk": "Бір үлгі құжатты деректер көзімен (мысалы, мекенжайлар тізімі) біріктіру арқылы бірдей құжаттың бірнеше жекелендірілген көшірмелерін жасау процесі.",
        "ru": "Процесс создания нескольких персонализированных копий одного и того же документа путем объединения его с источником данных (например, списком адресов).",
        "en": "The process of creating multiple personalized copies of a single form document by merging it with a data source (e.g., a list of addresses)."
      },
      "example": {
        "kk": "Біріктіруді пайдаланып, көптеген алушыларға жеке хаттар жібердім.",
        "ru": "Используя слияние, я разослал персонализированные письма многим получателям.",
        "en": "Using Mail Merge, I sent personalized letters to many recipients."
      },
      "relations": {
        "synonyms": [
          "Пошталық біріктіру (kk)",
          " Почтовое слияние (ru)"
        ],
        "general_concept": "Құжатты жасау",
        "specific_concepts": [
          "Деректер көзі",
          " Негізгі құжат",
          " Алушылар тізімі"
        ],
        "associative": [
          "Жекелендіру",
          " Көпшілікке тарату"
        ]
      }
    },
    {
      "kk": "Гиперсілтеме",
      "ru": "Гиперссылка",
      "en": "Hyperlink",
      "definition": {
        "kk": "Басқа веб-бетке, құжатқа немесе сол құжаттың басқа жеріне өтуге мүмкіндік беретін мәтін немесе кескін.",
        "ru": "Текст или изображение, позволяющие перейти на другую веб-страницу, документ или другое место в том же документе.",
        "en": "Text or an image that allows you to jump to another web page, document, or a different location within the same document."
      },
      "example": {
        "kk": "Презентацияма қосымша ақпарат беретін веб-сайтқа гиперсілтеме қостым.",
        "ru": "Я добавил гиперссылку на веб-сайт, который предоставляет дополнительную информацию к моей презентации.",
        "en": "I added a hyperlink to a website that provides additional information for my presentation."
      },
      "relations": {
        "synonyms": [
          "Сілтеме (kk)",
          " Ссылка (ru)"
        ],
        "general_concept": "Навигация құралы",
        "specific_concepts": [
          "Веб-бет",
          " Құжат",
          " Мекенжай"
        ],
        "associative": [
          "Байланыс",
          " Ақпарат алмасу"
        ]
      }
    },
    {
      "kk": "Деректерді тексеру",
      "ru": "Проверка данных",
      "en": "Data Validation",
      "definition": {
        "kk": "Ұяшықтарға енгізілетін деректердің түрін немесе мәндерін шектеуге мүмкіндік беретін мүмкіндік.",
        "ru": "Функция, позволяющая ограничивать тип или значения данных, вводимых в ячейки.",
        "en": "A feature that allows you to restrict the type or values of data that can be entered into cells."
      },
      "example": {
        "kk": "Деректерді тексеруді пайдаланып, ұяшыққа тек сандарды енгізуге болатынын қамтамасыз еттім.",
        "ru": "Используя проверку данных, я убедился, что в ячейку можно вводить только числа.",
        "en": "By using Data Validation, I ensured that only numbers can be entered into the cell."
      },
      "relations": {
        "synonyms": [
          "Деректерді растау (kk)",
          " Проверка ввода данных (ru)"
        ],
        "general_concept": "Деректерді басқару",
        "specific_concepts": [
          "Деректер түрі",
          " Ережелер"
        ],
        "associative": [
          "Деректердің дұрыстығын қамтамасыз ету",
          " Қате туралы хабарламалар"
        ]
      }
    },
    {
      "kk": "Дизайн",
      "ru": "Дизайн",
      "en": "Design",
      "definition": {
        "kk": "Презентацияның жалпы көрнекі стилі, соның ішінде тақырыптар, түстер, қаріптер және фондық кескіндер.",
        "ru": "Общий визуальный стиль презентации, включая темы, цвета, шрифты и фоновые изображения.",
        "en": "The overall visual style of a presentation, including themes, colors, fonts, and background images."
      },
      "example": {
        "kk": "Презентацияның дизайнын өзгерту арқылы оның көрінісін жақсартуға болады.",
        "ru": "Изменяя дизайн презентации, можно улучшить ее внешний вид.",
        "en": "By changing the design of the presentation, you can improve its appearance."
      },
      "relations": {
        "synonyms": [
          "Стиль (kk)",
          " Стиль (ru)"
        ],
        "general_concept": "Презентация қасиеті",
        "specific_concepts": [
          "Тақырыптар",
          " Түстер",
          " Қаріптер",
          " Фондық кескіндер"
        ],
        "associative": [
          "Көрнекілік",
          " Біркелкілік"
        ]
      }
    },
    {
      "kk": "Жиынтық кесте",
      "ru": "Сводная таблица",
      "en": "Pivot Table",
      "definition": {
        "kk": "Үлкен көлемдегі деректерді талдауға және жиынтықтауға мүмкіндік беретін қуатты құрал. Ол деректерді әртүрлі тәсілдермен топтастыруға және қорытындылауға мүмкіндік береді.",
        "ru": "Мощный инструмент для анализа и обобщения больших объемов данных. Позволяет группировать и суммировать данные различными способами.",
        "en": "A powerful tool for analyzing and summarizing large amounts of data. It allows you to group and aggregate data in various ways."
      },
      "example": {
        "kk": "Жиынтық кестені пайдаланып, сатылым деректері бойынша тоқсандық есеп жасадым.",
        "ru": "Используя сводную таблицу, я создал ежеквартальный отчет по данным о продажах.",
        "en": "Using a Pivot Table, I created a quarterly report based on sales data."
      },
      "relations": {
        "synonyms": [
          "Айнымалы кесте (kk)",
          " Сводная таблица данных (ru)"
        ],
        "general_concept": "Деректерді талдау құралы",
        "specific_concepts": [
          "Деректер көзі",
          " Өрістер",
          " Есептілік сүзгілері"
        ],
        "associative": [
          "Деректерді визуализациялау",
          " Есеп беру"
        ]
      }
    },
    {
      "kk": "Жоғарғы және төменгі колонтитулдар",
      "ru": "Верхний и нижний колонтитулы",
      "en": "Header and Footer",
      "definition": {
        "kk": "Құжаттың әрбір бетінің жоғарғы (колонтитул) және төменгі (төменгі колонтитул) шеттерінде пайда болатын мәтін немесе графика.",
        "ru": "Текст или графика, которые появляются в верхнем (верхний колонтитул) и нижнем (нижний колонтитул) полях каждой страницы документа.",
        "en": "Text or graphics that appear in the top (header) and bottom (footer) margins of every page of a document."
      },
      "example": {
        "kk": "Жоғарғы колонтитулға құжаттың атауын, ал төменгі колонтитулға бет нөмірін қостым.",
        "ru": "Я добавил название документа в верхний колонтитул, а номер страницы - в нижний колонтитул.",
        "en": "I added the document title to the header and the page number to the footer."
      },
      "relations": {
        "synonyms": [
          "Колонтитулдар (kk)",
          " Колонтитулы (ru)"
        ],
        "general_concept": "Құжатты пішімдеу",
        "specific_concepts": [
          "Беттің параметрлері",
          " Бет нөмірлері"
        ],
        "associative": [
          "Құжатты ұйымдастыру",
          " Кәсіби көрініс"
        ]
      }
    },
    {
      "kk": "Жұмыс кітабы",
      "ru": "Рабочая книга",
      "en": "Workbook",
      "definition": {
        "kk": "Бір немесе бірнеше жұмыс парақтарынан тұратын Microsoft Excel файлы.",
        "ru": "Файл Microsoft Excel, состоящий из одного или нескольких рабочих листов.",
        "en": "A Microsoft Excel file consisting of one or more worksheets."
      },
      "example": {
        "kk": "Мен жаңа жұмыс кітабын аштым.",
        "ru": "Я открыл новую рабочую книгу.",
        "en": "I opened a new workbook."
      },
      "relations": {
        "synonyms": [
          "Кітап (kk)",
          " Книга (ru)"
        ],
        "general_concept": "Microsoft Excel құжаты",
        "specific_concepts": [
          "Жұмыс парағы"
        ],
        "associative": [
          "Файл",
          " Сақтау",
          " Ашу"
        ]
      }
    },
    {
      "kk": "Жұмыс парағы",
      "ru": "Рабочий лист",
      "en": "Worksheet",
      "definition": {
        "kk": "Деректер енгізілетін және өңделетін жұмыс кітабындағы жеке электрондық кесте. Бір жұмыс кітабында бірнеше жұмыс парағы болуы мүмкін.",
        "ru": "Отдельная электронная таблица в рабочей книге, где вводятся и обрабатываются данные. В одной рабочей книге может быть несколько рабочих листов.",
        "en": "An individual spreadsheet within a workbook where data is entered and manipulated. A single workbook can contain multiple worksheets."
      },
      "example": {
        "kk": "Мен жаңа жұмыс парағына деректерді енгіздім.",
        "ru": "Я ввел данные на новом рабочем листе.",
        "en": "I entered data on the new worksheet."
      },
      "relations": {
        "synonyms": [
          "Парақ (kk)",
          " Лист (ru)",
          " Таблица (ru)"
        ],
        "general_concept": "Жұмыс кітабының элементі",
        "specific_concepts": [
          "Жұмыс кітабы",
          " Ұяшықтар",
          " Жолдар",
          " Бағандар"
        ],
        "associative": [
          "Қосымша парақ",
          " Жою парағы",
          " Парақтың атын өзгерту"
        ]
      }
    },
    {
      "kk": "Мазмұны",
      "ru": "Оглавление",
      "en": "Table of Contents",
      "definition": {
        "kk": "Құжаттың бөлімдері мен олардың бет нөмірлерін көрсететін тізім. Ол оқырмандарға құжатта тез шарлауға көмектеседі.",
        "ru": "Список разделов документа с указанием номеров страниц, на которых они начинаются. Помогает читателям быстро ориентироваться в документе.",
        "en": "A list of the sections of a document along with the page numbers on which they begin. It helps readers navigate the document quickly."
      },
      "example": {
        "kk": "Мен құжатқа автоматты түрде мазмұныны қостым.",
        "ru": "Я добавил автоматическое оглавление в документ.",
        "en": "I added an automatic Table of Contents to the document."
      },
      "relations": {
        "synonyms": [
          "Мазмұн (kk)",
          " Содержание (ru)"
        ],
        "general_concept": "Құжатты ұйымдастыру",
        "specific_concepts": [
          "Тақырыптар",
          " Бет нөмірлері"
        ],
        "associative": [
          "Навигация",
          " Құжат құрылымы"
        ]
      }
    },
    {
      "kk": "Макрос",
      "ru": "Макрос",
      "en": "Macro",
      "definition": {
        "kk": "Тапсырмаларды автоматтандыру үшін жазылған әрекеттер тізбегі.",
        "ru": "Последовательность действий, записанная для автоматизации задач.",
        "en": "A sequence of actions recorded to automate tasks."
      },
      "example": {
        "kk": "Мен күнделікті есептерді автоматтандыру үшін макрос жаздым.",
        "ru": "Я записал макрос для автоматизации ежедневных отчетов.",
        "en": "I recorded a macro to automate the daily reports."
      },
      "relations": {
        "synonyms": [
          "Автоматтандыру сценарийі (kk)",
          " Скрипт (ru)"
        ],
        "general_concept": "Автоматтандыру құралы",
        "specific_concepts": [
          "VBA (Visual Basic for Applications)"
        ],
        "associative": [
          "Автоматтандыру",
          " Уақытты үнемдеу",
          " Қателерді азайту"
        ]
      }
    },
    {
      "kk": "Мәтін ұяшығы",
      "ru": "Текстовое поле",
      "en": "Text Box",
      "definition": {
        "kk": "Слайдқа немесе құжатқа мәтін енгізуге арналған контейнер.",
        "ru": "Контейнер, предназначенный для ввода текста на слайде или в документе.",
        "en": "A container designed for entering text on a slide or in a document."
      },
      "example": {
        "kk": "Слайдқа тақырыпты енгізу үшін мәтін ұяшығын пайдаланыңыз.",
        "ru": "Используйте текстовое поле для ввода заголовка на слайде.",
        "en": "Use a text box to enter the title on the slide."
      },
      "relations": {
        "synonyms": [
          "Мәтін өрісі (kk)",
          " Текстовый блок (ru)"
        ],
        "general_concept": "Объект",
        "specific_concepts": [
          "Мәтін",
          " Слайд",
          " Құжат"
        ],
        "associative": [
          "Енгізу",
          " Пішімдеу"
        ]
      }
    },
    {
      "kk": "Мәтіндік құжат",
      "ru": "Текстовый документ",
      "en": "Text Document",
      "definition": {
        "kk": "Мәтіндік ақпаратты құруға, өңдеуге және пішімдеуге арналған файл.",
        "ru": "Файл, предназначенный для создания, редактирования и форматирования текстовой информации.",
        "en": "A file designed for creating, editing, and formatting textual information."
      },
      "example": {
        "kk": "Microsoft Word бағдарламасында хат немесе есеп жасауға болады.",
        "ru": "В программе Microsoft Word можно создать письмо или отчет.",
        "en": "You can create a letter or report in Microsoft Word."
      },
      "relations": {
        "synonyms": [
          "Құжат (kk)",
          " Документ (ru)"
        ],
        "general_concept": "Ақпаратты өңдеу құралы",
        "specific_concepts": [
          "Абзац",
          " Пішімдеу",
          " Стильдер",
          " Кестелер"
        ],
        "associative": [
          "Сөз өңдегіш",
          " Баспа",
          " Құжат айналымы"
        ]
      }
    },
    {
      "kk": "Мультимедиа",
      "ru": "Мультимедиа",
      "en": "Multimedia",
      "definition": {
        "kk": "Мәтін, суреттер, дыбыс, бейне және анимация сияқты әртүрлі ақпарат түрлерінің біріктірілуі.",
        "ru": "Совокупность различных видов информации, таких как текст, изображения, звук, видео и анимация.",
        "en": "The combination of various types of information, such as text, images, sound, video, and animation."
      },
      "example": {
        "kk": "Презентациямды тартымды ету үшін мультимедиа элементтерін пайдаландым.",
        "ru": "Я использовал мультимедийные элементы, чтобы сделать свою презентацию более интересной.",
        "en": "I used multimedia elements to make my presentation more engaging."
      },
      "relations": {
        "synonyms": [
          "Көп орта (kk)",
          " Разнообразные средства информации (ru)"
        ],
        "general_concept": "Ақпаратты ұсыну",
        "specific_concepts": [
          "Мәтін",
          " Суреттер",
          " Дыбыс",
          " Бейне",
          " Анимация"
        ],
        "associative": [
          "Көрнекілік",
          " Тартымдылық"
        ]
      }
    },
    {
      "kk": "Өзгерістерді бақылау",
      "ru": "Отслеживание изменений",
      "en": "Track Changes",
      "definition": {
        "kk": "Құжатқа енгізілген өзгерістерді (қосылған мәтін, жойылған мәтін, пішімдеу өзгерістері) көрсетуге және бақылауға мүмкіндік беретін мүмкіндік.",
        "ru": "Функция, позволяющая отображать и отслеживать изменения, внесенные в документ (добавленный текст, удаленный текст, изменения форматирования).",
        "en": "A feature that allows you to display and track changes made to a document (added text, deleted text, formatting changes)."
      },
      "example": {
        "kk": "Біз өзгерістерді бақылауды қосып, құжатты бірге өңдедік.",
        "ru": "Мы включили отслеживание изменений и совместно работали над документом.",
        "en": "We turned on Track Changes and collaborated on the document."
      },
      "relations": {
        "synonyms": [
          "Редакцияларды бақылау (kk)",
          " Отслеживание правок (ru)"
        ],
        "general_concept": "Бірлескен жұмыс құралы",
        "specific_concepts": [
          "Түсініктемелер",
          " Рецензиялау"
        ],
        "associative": [
          "Бірлескен жұмыс",
          " Құжатты салыстыру"
        ]
      }
    },
    {
      "kk": "Өтпелі кезеңдер",
      "ru": "Переходы",
      "en": "Transitions",
      "definition": {
        "kk": "Бір слайдтан екіншісіне өту кезіндегі көрнекі әсерлер.",
        "ru": "Визуальные эффекты, применяемые при переходе от одного слайда к другому.",
        "en": "Visual effects applied when moving from one slide to the next."
      },
      "example": {
        "kk": "Слайдтар арасындағы өтпелі кезеңдер презентацияны тартымды етеді.",
        "ru": "Переходы между слайдами делают презентацию более интересной.",
        "en": "Transitions between slides make the presentation more engaging."
      },
      "relations": {
        "synonyms": [
          "Өту әсерлері (kk)",
          " Эффекты перехода (ru)"
        ],
        "general_concept": "Презентация әсері",
        "specific_concepts": [
          "Анимация",
          " Дыбыстық әсерлер"
        ],
        "associative": [
          "Көрнекілік",
          " Темп"
        ]
      }
    },
    {
      "kk": "Пішімдеу",
      "ru": "Форматирование",
      "en": "Formatting",
      "definition": {
        "kk": "Мәтіннің немесе құжаттың сыртқы түрін өзгерту процесі, мысалы, қаріпті, өлшемді, түсті немесе орналасуын өзгерту.",
        "ru": "Процесс изменения внешнего вида текста или документа, например, изменение шрифта, размера, цвета или выравнивания.",
        "en": "The process of changing the visual appearance of text or a document, such as changing the font, size, color, or alignment."
      },
      "example": {
        "kk": "Мәтінді қалың етіп пішімдеу үшін Жуан батырмасын басыңыз.",
        "ru": "Чтобы отформатировать текст жирным шрифтом, нажмите кнопку Полужирный.",
        "en": "To format the text in bold, click the Bold button."
      },
      "relations": {
        "synonyms": [
          "Пішімдеу (kk)",
          " Оформление (ru)"
        ],
        "general_concept": "Құжатты өңдеу",
        "specific_concepts": [
          "Стильдер",
          " Қаріп",
          " Өлшем",
          " Түс",
          " Тізімдер"
        ],
        "associative": [
          "Көрнекілік",
          " Оқылымдылық"
        ]
      }
    },
    {
      "kk": "Презентация",
      "ru": "Презентация",
      "en": "Presentation",
      "definition": {
        "kk": "Идеялар мен ақпаратты аудиторияға көрнекі түрде жеткізуге арналған слайдтар жиынтығы.",
        "ru": "Набор слайдов, предназначенных для визуального представления идей и информации аудитории.",
        "en": "A collection of slides designed to visually present ideas and information to an audience."
      },
      "example": {
        "kk": "PowerPoint бағдарламасында керемет презентация жасауға болады.",
        "ru": "В программе PowerPoint можно создать эффектную презентацию.",
        "en": "You can create a compelling presentation in PowerPoint."
      },
      "relations": {
        "synonyms": [
          "Баяндама (kk)",
          " Доклад (ru)"
        ],
        "general_concept": "Ақпаратты жеткізу құралы",
        "specific_concepts": [
          "Слайд",
          " Слайд көрсетілімі",
          " Дизайн",
          " Анимация"
        ],
        "associative": [
          "Көрнекілік",
          " Аудитория",
          " Спикер"
        ]
      }
    },
    {
      "kk": "Слайд",
      "ru": "Слайд",
      "en": "Slide",
      "definition": {
        "kk": "Презентацияның жеке беті. Ол мәтінді, суреттерді, диаграммаларды, бейнелерді және басқа да мультимедиа элементтерін қамтуы мүмкін.",
        "ru": "Отдельная страница презентации. Может содержать текст, изображения, диаграммы, видео и другие мультимедийные элементы.",
        "en": "An individual page of a presentation. It can contain text, images, charts, videos, and other multimedia elements."
      },
      "example": {
        "kk": "Презентация әрбір слайдта жаңа тақырыпты қамтиды.",
        "ru": "Каждый слайд презентации посвящен новой теме.",
        "en": "Each slide of the presentation covers a new topic."
      },
      "relations": {
        "synonyms": [
          "Бет (kk)",
          " Страница (ru)"
        ],
        "general_concept": "Презентация элементі",
        "specific_concepts": [
          "Презентация",
          " Слайд көрсетілімі",
          " Орналасуы"
        ],
        "associative": [
          "Мәтін ұяшығы",
          " Суреттер",
          " Бейнелер"
        ]
      }
    },
    {
      "kk": "Тақырып",
      "ru": "Тема",
      "en": "Theme",
      "definition": {
        "kk": "Презентацияның немесе құжаттың жалпы дизайны, соның ішінде түстер, қаріптер және фондық кескіндердің алдын ала анықталған жиынтығы.",
        "ru": "Предопределенный набор цветов, шрифтов и фоновых изображений, определяющий общий дизайн презентации или документа.",
        "en": "A predefined set of colors, fonts, and background images that define the overall design of a presentation or document."
      },
      "example": {
        "kk": "Мен презентацияма кәсіби көрініс беру үшін жаңа тақырыпты таңдадым.",
        "ru": "Я выбрал новую тему, чтобы придать своей презентации профессиональный вид.",
        "en": "I chose a new theme to give my presentation a professional look."
      },
      "relations": {
        "synonyms": [
          "Дизайн (kk)",
          " Оформление (ru)"
        ],
        "general_concept": "Презентация/Құжат қасиеті",
        "specific_concepts": [
          "Дизайн",
          " Түстер",
          " Қаріптер",
          " Фондық кескіндер"
        ],
        "associative": [
          "Біркелкілік",
          " Көрнекілік"
        ]
      }
    },
    {
      "kk": "Түсініктемелер",
      "ru": "Примечания",
      "en": "Comments",
      "definition": {
        "kk": "Құжатқа мәтінге немесе басқа элементтерге қатысты пікірлер немесе ұсыныстарды қосуға мүмкіндік беретін мүмкіндік.",
        "ru": "Функция, позволяющая добавлять комментарии или предложения относительно текста или других элементов документа.",
        "en": "A feature that allows you to add comments or suggestions regarding the text or other elements of a document."
      },
      "example": {
        "kk": "Рецензент құжатқа өзінің түсініктемелерін қосты.",
        "ru": "Рецензент добавил свои примечания к документу.",
        "en": "The reviewer added their comments to the document."
      },
      "relations": {
        "synonyms": [
          "Ескертулер (kk)",
          " Комментарии (ru)"
        ],
        "general_concept": "Бірлескен жұмыс құралы",
        "specific_concepts": [
          "Өзгерістерді бақылау",
          " Рецензиялау"
        ],
        "associative": [
          "Кері байланыс",
          " Ынтымақтастық"
        ]
      }
    },
    {
      "kk": "Үлгі",
      "ru": "Шаблон",
      "en": "Template",
      "definition": {
        "kk": "Алдын ала пішімделген құжат немесе презентация, ол жаңа құжаттар мен презентациялар жасау үшін негіз ретінде пайдаланылады.",
        "ru": "Предварительно отформатированный документ или презентация, используемая в качестве основы для создания новых документов и презентаций.",
        "en": "A pre-formatted document or presentation that serves as a basis for creating new documents and presentations."
      },
      "example": {
        "kk": "Мен жаңа хат құжатын жасау үшін үлгіні пайдаландым.",
        "ru": "Я использовал шаблон для создания нового документа письма.",
        "en": "I used a template to create a new letter document."
      },
      "relations": {
        "synonyms": [
          "Негіз (kk)",
          " Основа (ru)"
        ],
        "general_concept": "Құжатты/Презентацияны жасау",
        "specific_concepts": [
          "Пішімдеу",
          " Стильдер",
          " Орналасуы"
        ],
        "associative": [
          "Уақытты үнемдеу",
          " Біркелкілік"
        ]
      }
    },
    {
      "kk": "Ұяшық",
      "ru": "Ячейка",
      "en": "Cell",
      "definition": {
        "kk": "Электрондық кестедегі жол мен бағанның қиылысындағы негізгі элемент. Онда мәтін, сан, формула немесе функция болуы мүмкін.",
        "ru": "Основной элемент электронной таблицы, находящийся на пересечении строки и столбца. Может содержать текст, число, формулу или функцию.",
        "en": "The basic element in a spreadsheet, located at the intersection of a row and a column. It can contain text, a number, a formula, or a function."
      },
      "example": {
        "kk": "A1 ұяшығында \"Сатылым\" деген мәтін жазылған.",
        "ru": "В ячейке A1 записан текст \"Продажи\".",
        "en": "Cell A1 contains the text \"Sales\"."
      },
      "relations": {
        "synonyms": [
          "Клетка (ru)"
        ],
        "general_concept": "Электрондық кесте элементі",
        "specific_concepts": [
          "Жол",
          " Баған",
          " Формула",
          " Функция"
        ],
        "associative": [
          "Ұяшық мекенжайы",
          " Деректерді енгізу"
        ]
      }
    },
    {
      "kk": "Ұяшық мекенжайы",
      "ru": "Адрес ячейки",
      "en": "Cell Address",
      "definition": {
        "kk": "Электрондық кестедегі ұяшықтың орналасқан жерін анықтайтын белгі. Әдетте баған әрпі мен жол нөмірінен тұрады (мысалы, A1).",
        "ru": "Обозначение, определяющее местоположение ячейки в электронной таблице. Обычно состоит из буквы столбца и номера строки (например, A1).",
        "en": "A label that identifies the location of a cell in a spreadsheet, typically consisting of the column letter and row number (e.g., A1)."
      },
      "example": {
        "kk": "B5 - бұл B бағаны мен 5-ші жолдың қиылысындағы ұяшық мекенжайы.",
        "ru": "B5 - это адрес ячейки на пересечении столбца B и строки 5.",
        "en": "B5 is the cell address at the intersection of column B and row 5."
      },
      "relations": {
        "synonyms": [
          "Ұяшық атауы (kk)",
          " Имя ячейки (ru)"
        ],
        "general_concept": "Электрондық кесте элементі",
        "specific_concepts": [
          "Ұяшық",
          " Жол",
          " Баған",
          " Ауқым"
        ],
        "associative": [
          "Салыстырмалы сілтемелер",
          " Абсолютті сілтемелер"
        ]
      }
    },
    {
      "kk": "Формула",
      "ru": "Формула",
      "en": "Formula",
      "definition": {
        "kk": "Ұяшықта есептеулерді орындауға арналған өрнек. Әдетте теңдік белгісінен (=) басталады.",
        "ru": "Выражение, предназначенное для выполнения вычислений в ячейке. Обычно начинается со знака равенства (=).",
        "en": "An expression designed to perform calculations in a cell. It usually begins with an equals sign (=)."
      },
      "example": {
        "kk": "#ERROR!",
        "ru": "Формула =A1+B1 складывает значения в ячейках A1 и B1.",
        "en": "The formula =A1+B1 adds the values in cells A1 and B1."
      },
      "relations": {
        "synonyms": [
          "Өрнек (kk)",
          " Выражение (ru)"
        ],
        "general_concept": "Есептеу құралы",
        "specific_concepts": [
          "Функция",
          " Операторлар",
          " Ұяшық мекенжайлары"
        ],
        "associative": [
          "Деректерді талдау",
          " Автотолтыру"
        ]
      }
    },
    {
      "kk": "Электрондық кесте",
      "ru": "Электронная таблица",
      "en": "Spreadsheet",
      "definition": {
        "kk": "Деректерді жолдар мен бағандарға ұйымдастыруға және өңдеуге арналған бағдарламалық құрал.",
        "ru": "Программное средство для организации и обработки данных в виде строк и столбцов.",
        "en": "A software tool for organizing and manipulating data in rows and columns."
      },
      "example": {
        "kk": "Microsoft Excel - ең танымал электрондық кесте бағдарламасы.",
        "ru": "Microsoft Excel - самая популярная программа для работы с электронными таблицами.",
        "en": "Microsoft Excel is the most popular spreadsheet program."
      },
      "relations": {
        "synonyms": [
          "Кестелік процессор (kk)",
          " Табличный процессор (ru)"
        ],
        "general_concept": "Ақпаратты өңдеу құралы",
        "specific_concepts": [
          "Ұяшық",
          " Жол",
          " Баған",
          " Формула",
          " Функция"
        ],
        "associative": [
          "Деректерді талдау",
          " Есептеулер",
          " Диаграммалар"
        ]
      }
    },
    {
      "kk": "Формула жолағы",
      "ru": "Строка формул",
      "en": "Formula Bar",
      "definition": {
        "kk": "Белсенді ұяшықтың ішіндегі деректерді немесе формуланы көрсететін және өңдеуге мүмкіндік беретін Excel терезесінің жоғарғы жағындағы жолақ.",
        "ru": "Панель в верхней части окна Excel, отображающая и позволяющая редактировать данные или формулу в активной ячейке.",
        "en": "A bar at the top of the Excel window that displays and allows editing of the data or formula in the active cell."
      },
      "example": {
        "kk": "Мен ұяшықтағы формуланы формула жолағында өңдедім.",
        "ru": "Я отредактировал формулу в ячейке с помощью строки формул.",
        "en": "I edited the formula in the cell using the Formula Bar."
      },
      "relations": {
        "synonyms": [
          "Формула өрісі (kk)",
          " Поле формулы (ru)"
        ],
        "general_concept": "Excel интерфейсі",
        "specific_concepts": [
          "Ұяшық",
          " Формула",
          " Деректер"
        ],
        "associative": [
          "Ұяшық мекенжайы",
          " Атау жолағы"
        ]
      }
    },
    {
      "kk": "Атау жолағы",
      "ru": "Поле имени",
      "en": "Name Box",
      "definition": {
        "kk": "Формула жолағының сол жағында орналасқан және белсенді ұяшықтың мекенжайын немесе аталған ауқымның атын көрсететін жолақ.",
        "ru": "Поле слева от строки формул, отображающее адрес активной ячейки или имя именованного диапазона.",
        "en": "A box to the left of the Formula Bar that displays the address of the active cell or the name of a named range."
      },
      "example": {
        "kk": "Атау жолағында ағымдағы ұяшықтың мекенжайы көрсетілген.",
        "ru": "В поле имени отображается адрес текущей ячейки.",
        "en": "The Name Box shows the address of the current cell."
      },
      "relations": {
        "synonyms": [
          "Атау өрісі (kk)",
          " Ячейка имени (ru)"
        ],
        "general_concept": "Excel интерфейсі",
        "specific_concepts": [
          "Ұяшық мекенжайы",
          " Аталған ауқым"
        ],
        "associative": [
          "Формула жолағы"
        ]
      }
    },
    {
      "kk": "Шартты пішімдеу",
      "ru": "Условное форматирование",
      "en": "Conditional Formatting",
      "definition": {
        "kk": "Ұяшықтарға олардың ішіндегі мәндерге негізделген пішімдеуді (мысалы, түс, қаріп стилі) автоматты түрде қолдануға мүмкіндік беретін мүмкіндік.",
        "ru": "Возможность автоматически применять форматирование (например, цвет, стиль шрифта) к ячейкам на основе значений, которые они содержат.",
        "en": "A feature that allows you to automatically apply formatting (such as color, font style) to cells based on the values they contain."
      },
      "example": {
        "kk": "Мен шартты пішімдеуді пайдаланып, сатылымдары 1000-нан асатын ұяшықтарды жасыл түспен ерекшеледім.",
        "ru": "Я использовал условное форматирование, чтобы выделить ячейки с продажами более 1000 зеленым цветом.",
        "en": "I used Conditional Formatting to highlight cells with sales over 1000 in green."
      },
      "relations": {
        "synonyms": [
          "Шартты форматтау (kk)",
          " Форматирование по условию (ru)"
        ],
        "general_concept": "Пішімдеу",
        "specific_concepts": [
          "Деректерді визуализациялау",
          " Ережелер"
        ],
        "associative": [
          "Деректерді талдау",
          " Көрнекілік"
        ]
      }
    },
    {
      "kk": "Диаграммалар",
      "ru": "Диаграммы",
      "en": "Charts",
      "definition": {
        "kk": "Деректерді графикалық түрде ұсыну тәсілі. Диаграммалар деректердегі үрдістер мен салыстыруларды көрнекі түрде көрсетуге көмектеседі.",
        "ru": "Способ графического представления данных. Диаграммы помогают наглядно отображать тенденции и сравнения в данных.",
        "en": "A way of representing data graphically. Charts help to visualize trends and comparisons in data."
      },
      "example": {
        "kk": "Мен сатылым деректері бойынша бағанды диаграмма жасадым.",
        "ru": "Я создал столбчатую диаграмму по данным о продажах.",
        "en": "I created a column chart based on the sales data."
      },
      "relations": {
        "synonyms": [
          "Графиктер (kk)",
          " Графики (ru)"
        ],
        "general_concept": "Деректерді визуализациялау",
        "specific_concepts": [
          "Бағанды диаграмма",
          " Дөңгелек диаграмма",
          " Нүктелік диаграмма"
        ],
        "associative": [
          "Деректерді талдау",
          " Есеп беру"
        ]
      }
    },
    {
      "kk": "Функциялар",
      "ru": "Функции",
      "en": "Functions",
      "definition": {
        "kk": "Алдын ала анықталған есептеулерді орындауға арналған формуланың бөлігі. Мысалы, SUM функциясы ұяшықтар ауқымындағы сандарды қосады.",
        "ru": "Часть формулы, предназначенная для выполнения предопределенных вычислений. Например, функция SUM суммирует числа в диапазоне ячеек.",
        "en": "A part of a formula designed to perform predefined calculations. For example, the SUM function adds numbers in a range of cells."
      },
      "example": {
        "kk": "#ERROR!",
        "ru": "Функция =AVERAGE(A1:A10) вычисляет среднее значение чисел в ячейках от A1 до A10.",
        "en": "The function =AVERAGE(A1:A10) calculates the average of the numbers in cells A1 to A10."
      },
      "relations": {
        "synonyms": [
          "Формула функциялары (kk)",
          " Функции формул (ru)"
        ],
        "general_concept": "Есептеу құралы",
        "specific_concepts": [
          "Математикалық функциялар",
          " Статистикалық функциялар",
          " Логикалық функциялар"
        ],
        "associative": [
          "Формулалар",
          " Есептеулер",
          " Деректерді талдау"
        ]
      }
    },
    {
      "kk": "Деректерді сұрыптау",
      "ru": "Сортировка данных",
      "en": "Data Sorting",
      "definition": {
        "kk": "Деректерді белгілі бір бағандағы мәндерге негізделген белгілі бір ретпен (өсу немесе кему ретімен) қайта реттеу процесі.",
        "ru": "Процесс переупорядочивания данных в определенном порядке (по возрастанию или по убыванию) на основе значений в определенном столбце.",
        "en": "The process of rearranging data in a specific order (ascending or descending) based on the values in a particular column."
      },
      "example": {
        "kk": "Мен сатылым деректерін күн бойынша сұрыптадым.",
        "ru": "Я отсортировал данные о продажах по дате.",
        "en": "I sorted the sales data by date."
      },
      "relations": {
        "synonyms": [
          "Реттеу (kk)",
          " Упорядочивание данных (ru)"
        ],
        "general_concept": "Деректерді басқару",
        "specific_concepts": [
          "Өсу ретімен сұрыптау",
          " Кему ретімен сұрыптау"
        ],
        "associative": [
          "Деректерді талдау",
          " Деректерді ұйымдастыру"
        ]
      }
    },
    {
      "kk": "Деректерді сүзу",
      "ru": "Фильтрация данных",
      "en": "Data Filtering",
      "definition": {
        "kk": "Белгілі бір критерийлерге сәйкес келетін жолдарды ғана көрсету арқылы үлкен деректер жиынтығындағы ақпаратты шектеу мүмкіндігі.",
        "ru": "Возможность ограничить информацию в большом наборе данных, отображая только те строки, которые соответствуют определенным критериям.",
        "en": "The ability to limit the information in a large dataset by showing only the rows that meet certain criteria."
      },
      "example": {
        "kk": "Мен тек \"Астана\" қаласындағы сатылымдарды көрсету үшін деректерді сүзгіден өткіздім.",
        "ru": "Я отфильтровал данные, чтобы показать только продажи в городе \"Астана\".",
        "en": "I filtered the data to show only sales in \"Astana\"."
      },
      "relations": {
        "synonyms": [
          "Сүзу (kk)",
          " Фильтр данных (ru)"
        ],
        "general_concept": "Деректерді басқару",
        "specific_concepts": [
          "Сүзгі критерийлері",
          " Кеңейтілген сүзгі"
        ],
        "associative": [
          "Деректерді талдау",
          " Деректерді іздеу"
        ]
      }
    },
    {
      "kk": "Терезелерді қатыру",
      "ru": "Закрепление областей",
      "en": "Freeze Panes",
      "definition": {
        "kk": "Электрондық кестені айналдырған кезде жолдар мен бағандардың белгілі бір бөліктерін экранда көрінетін етіп бекіту мүмкіндігі. Бұл үлкен деректермен жұмыс істегенде пайдалы.",
        "ru": "Возможность закрепить определенные области строк и столбцов на экране, чтобы они оставались видимыми при прокрутке электронной таблицы. Полезно при работе с большими объемами данных.",
        "en": "The ability to keep certain rows and columns of a spreadsheet visible while you scroll through the rest of the sheet. This is useful when working with large datasets."
      },
      "example": {
        "kk": "Мен тақырып жолын қатырдым, енді кестені айналдырған кезде ол әрқашан көрініп тұрады.",
        "ru": "Я закрепил строку заголовков, теперь она всегда видна при прокрутке таблицы.",
        "en": "I froze the header row so it is always visible when I scroll through the table."
      },
      "relations": {
        "synonyms": [
          "Аймақтарды бекіту (kk)",
          " Зафиксировать области (ru)"
        ],
        "general_concept": "Excel көрінісі",
        "specific_concepts": [
          "Айналдыру"
        ],
        "associative": [
          "Үлкен кестелермен жұмыс істеу",
          " Деректерді салыстыру"
        ]
      }
    },
    {
      "kk": "Басып шығару аймағы",
      "ru": "Область печати",
      "en": "Print Area",
      "definition": {
        "kk": "Жұмыс парағының басып шығарылатын бөлігін анықтау мүмкіндігі.",
        "ru": "Возможность определить часть рабочего листа, которая будет напечатана.",
        "en": "The ability to define the portion of a worksheet that will be printed."
      },
      "example": {
        "kk": "Мен тек қажетті деректерді басып шығару үшін басып шығару аймағын орнаттым.",
        "ru": "Я установил область печати, чтобы распечатать только необходимые данные.",
        "en": "I set the Print Area to print only the necessary data."
      },
      "relations": {
        "synonyms": [
          "Басып шығару аумағы (kk)",
          " Печатная область (ru)"
        ],
        "general_concept": "Басып шығару параметрі",
        "specific_concepts": [
          "Беттің параметрлері",
          " Басып шығару алдын ала қарау"
        ],
        "associative": [
          "Құжатты басып шығару"
        ]
      }
    }
  ],
  "Дәріс 5. Компьютерлік желілер": [
    {
      "kk": "Компьютерлік желі",
      "ru": "Компьютерная сеть",
      "en": "Computer Network",
      "definition": {
        "kk": "Компьютерлік желі - ақпарат алмасу, ресурстарды бөлісу және байланыс үшін бірнеше компьютерлерді немесе басқа есептеу құрылғыларын біріктіретін жүйе. Желілер әртүрлі хаттамалар мен деректер технологияларын қолдана отырып, жергілікті (LAN), аймақтық (MAN) және ғаламдық (WAN) болуы мүмкін.",
        "ru": "Компьютерная сеть – система, объединяющая несколько компьютеров или иных вычислительных устройств для обмена информацией, совместного использования ресурсов и коммуникации. Сети могут быть локальными (LAN), региональными (MAN) и глобальными (WAN), используя различные протоколы и технологии передачи данных.",
        "en": "Computer network – a system connecting multiple computers or computing devices for information exchange, resource sharing, and communication. Networks are classified into local (LAN), metropolitan (MAN), and wide-area (WAN) levels, utilizing various data transmission protocols and technologies."
      },
      "example": {
        "kk": "Компьютерлік желі арқылы файлдарды басқа компьютерлермен бөлісуге болады.",
        "ru": "С помощью компьютерной сети можно делиться файлами с другими компьютерами.",
        "en": "Computer networks allow file sharing with other computers."
      },
      "relations": {
        "synonyms": [
          "ақпараттық желі"
        ],
        "general_concept": "Компьютерлік желі деректерді жылдам және тиімді алмасуға мүмкіндік береді.",
        "specific_concepts": [
          "интернет",
          "локалды желі"
        ],
        "associative": [
          "байланыс",
          "деректер"
        ]
      }
    },
    {
      "kk": "Жергілікті желі",
      "ru": "Локальная сеть",
      "en": "Local Area Network (LAN)",
      "definition": {
        "kk": "Жергілікті желі – шектеулі географиялық аймақтағы компьютерлер мен құрылғыларды біріктіретін байланыс жүйесі (мысалы, кеңсе, үй, кампус). Ол жоғары жылдамдықты деректер алмасуды қамтамасыз етеді және сымды немесе сымсыз технологиялар негізінде жұмыс істейді. Жергілікті желілер файлдар, принтерлер және интернет сияқты ортақ ресурстарға қол жеткізуді жеңілдетеді.",
        "ru": "Локальная сеть – коммуникационная система, объединяющая компьютеры и устройства в ограниченной географической области (например, офис, дом, кампус). Она обеспечивает высокоскоростной обмен данными и функционирует на основе проводных или беспроводных технологий. Локальные сети упрощают доступ к общим ресурсам, таким как файлы, принтеры и интернет.",
        "en": "Local Area Network (LAN) – a communication system that connects computers and devices within a limited geographical area (e.g., office, home, campus). It enables high-speed data exchange and operates using wired or wireless technologies. LANs facilitate access to shared resources such as files, printers, and internet connectivity."
      },
      "example": {
        "kk": "Жергілікті желі кеңселерде кеңінен қолданылады.",
        "ru": "Локальная сеть широко используется в офисах.",
        "en": "LAN is widely used in offices."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Ғаламдық желі",
      "ru": "Глобальная сеть",
      "en": "Wide Area Network (WAN)",
      "definition": {
        "kk": "Ғаламдық желі – кең географиялық аумақтардағы есептеу құрылғыларын біріктіретін байланыс жүйесі. Ол интернетке қосылу, ақпарат алмасу және қашықтағы ресурстарға қол жеткізу үшін қолданылады. Ғаламдық желілер деректерді беру хаттамаларын және жоғары жылдамдықты байланыс технологияларын қолданады.",
        "ru": "Глобальная сеть – коммуникационная система, объединяющая вычислительные устройства на обширных географических территориях. Она используется для подключения к интернету, обмена информацией и доступа к удалённым ресурсам. Глобальные сети применяют протоколы передачи данных и высокоскоростные технологии связи.",
        "en": "Wide Area Network (WAN) – a communication system connecting computing devices across large geographical areas. It is used for internet access, information exchange, and remote resource availability. WANs utilize data transmission protocols and high-speed connectivity technologies."
      },
      "example": {
        "kk": "Интернет әлемдік желінің ең танымал мысалы.",
        "ru": "Интернет — самый известный пример глобальной сети.",
        "en": "The Internet is the most well-known example of a WAN."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Корпоративты желі",
      "ru": "Корпоративная сеть",
      "en": "Corporate Network",
      "definition": {
        "kk": "Корпоративтік желі - ұйым ішіндегі құрылғыларды, ақпараттық ресурстарды және коммуникациялық арналарды біріктіретін мамандандырылған есептеу жүйесі. Ол деректерді қауіпсіз тасымалдау, серверлер мен қызметтерді орталықтандырылған басқару және ішкі және сыртқы өзара әрекеттесуді реттеу үшін қолданылады. Кәсіпорын желілері көбінесе VPN, Интернет және бұлтты инфрақұрылыммен біріктіріледі.",
        "ru": "Корпоративная сеть – специализированная вычислительная система, объединяющая устройства, информационные ресурсы и коммуникационные каналы внутри организации. Она используется для безопасной передачи данных, централизованного управления серверами и сервисами, а также регулирования внутреннего и внешнего взаимодействия. Корпоративные сети часто интегрируются с VPN, интранетом и облачной инфраструктурой.",
        "en": "Corporate network – a specialized computing system that connects devices, information resources, and communication channels within an organization. It is used for secure data transmission, centralized management of servers and services, and regulation of internal and external interactions. Corporate networks are often integrated with VPN, intranet, and cloud infrastructure."
      },
      "example": {
        "kk": "Корпоративты желі арқылы қызметкерлер маңызды құжаттарға ортақ қол жеткізе алады.",
        "ru": "Корпоративная сеть позволяет сотрудникам совместно использовать важные документы.",
        "en": "Corporate networks enable employees to share access to important documents."
      },
      "relations": {
        "synonyms": [
          "жеке желі"
        ],
        "general_concept": "Корпоративты желі ұйымның ішкі деректер алмасу жүйесін құрайды.",
        "specific_concepts": [
          "желілік қауіпсіздік",
          "сервер"
        ],
        "associative": [
          "ұйым",
          "ресурстар"
        ]
      }
    },
    {
      "kk": "Компьютерлік желі топологиясы",
      "ru": "Топология компьютерной сети",
      "en": "Computer Network Topology",
      "definition": {
        "kk": "Компьютерлік желі топологиясы - құрылғылардың желідегі физикалық немесе логикалық орналасуын сипаттайтын құрылымдық схема. Ол ақпарат ағынын ұйымдастырудың негізгі принциптерін анықтайды және желінің өнімділігіне, сенімділігіне және масштабталуына әсер етеді. Негізгі топологияларға жұлдыз, сақина, жасуша құрылымы, ағаш және шина жатады.",
        "ru": "Топология компьютерной сети – структурная схема, описывающая физическое или логическое расположение устройств в сети. Она определяет основные принципы организации потока информации и влияет на производительность, надёжность и масштабируемость сети. Основные топологии включают звезду, кольцо, ячеистую структуру, дерево и шину.",
        "en": "Computer network topology – a structural scheme describing the physical or logical arrangement of devices within a network. It defines the key principles of information flow organization and impacts network performance, reliability, and scalability. Major topologies include star, ring, mesh, tree, and bus configurations."
      },
      "example": {
        "kk": "Жұлдыз топологиясында барлық құрылғылар бір орталық серверге қосылған.",
        "ru": "В топологии «звезда» все устройства подключены к центральному серверу.",
        "en": "In star topology, all devices are connected to a central server."
      },
      "relations": {
        "synonyms": [
          "желінің орналасуы"
        ],
        "general_concept": "Топология желінің тиімділігін және құрылғылар арасындағы байланыс әдісін анықтайды.",
        "specific_concepts": [
          "жұлдыз топологиясы",
          "сақина топологиясы"
        ],
        "associative": [
          "байланыс",
          "құрылғы"
        ]
      },
      "image": "https://it.rfei.ru/static/realms/rfei_it/courses/9xb8/2.1.jpg",
      "source": "https://it.rfei.ru/course/~9xb8/~Gj4iWgLK/~sMVyHSka"
    },
    {
      "kk": "Жұлдызша топологиясы",
      "ru": "Звездообразная топология",
      "en": "Star Topology",
      "definition": {
        "kk": "Жұлдызша топологиясы - бұл барлық құрылғылар орталық түйінге (серверге немесе коммутаторға) қосылған желілік архитектураның моделі. Мұндай байланыс схемасы деректерді тиімді басқаруды қамтамасыз етеді және желінің сенімділігін арттырады, өйткені байланыс орталық түйін арқылы жүзеге асырылады. Жұлдызша топологиясы жергілікті желілерде (LAN) кеңінен қолданылады.",
        "ru": "Звездообразная топология – модель сетевой архитектуры, в которой все устройства подключены к центральному узлу (серверу или коммутатору). Такая схема соединения обеспечивает эффективное управление данными и повышает надёжность сети, поскольку связь осуществляется через центральный узел. Топология «звезда» широко применяется в локальных сетях (LAN).",
        "en": "Star topology – a network architecture model in which all devices are connected to a central node (server or switch). This connection scheme allows for efficient data management and enhances network reliability, as communication occurs through the central node. Star topology is widely used in local area networks (LAN)."
      },
      "example": {
        "kk": "Жұлдызша топологиясында бір құрылғы істен шықса, бұл желінің басқа құрылғыларына әсер етпейді.",
        "ru": "При топологии «звезда» выход одного устройства из строя не влияет на работу других устройств сети.",
        "en": "In star topology, the failure of one device does not affect the rest of the network."
      },
      "relations": {
        "synonyms": [
          "орталық топология"
        ],
        "general_concept": "Жұлдызша топологиясы тиімді байланыс пен басқаруды қамтамасыз етеді.",
        "specific_concepts": [
          "хаб",
          "коммутатор"
        ],
        "associative": [
          "желілік құрылым",
          "байланыс"
        ]
      }
    },
    {
      "kk": "Сақина топологиясы",
      "ru": "Кольцевая топология",
      "en": "Ring Topology",
      "definition": {
        "kk": "Сақина топологиясы - түйіндер бір-біріне тізбектей қосылып, тұйық контур немесе сақина құрайтын желідегі құрылғыларды қосу архитектурасы. Мұндай схемада деректер бір немесе екі бағытта беріледі, ал әрбір түйін ақпаратты келесіге жібереді. Сақина топологиясы тиімді маршруттауды қамтамасыз етеді, бірақ оның өнімділігі әр түйіннің тұрақтылығына байланысты.",
        "ru": "Кольцевая топология – архитектура соединения устройств в сети, при которой узлы последовательно подключены друг к другу, формируя замкнутый контур или кольцо. В такой схеме данные передаются в одном или двух направлениях, а каждый узел ретранслирует информацию следующему. Кольцевая топология обеспечивает эффективную маршрутизацию, но её работоспособность зависит от стабильности каждого узла.",
        "en": "Ring topology – a network architecture in which devices are sequentially connected to form a closed loop or ring. In this configuration, data is transmitted in one or two directions, and each node relays information to the next. Ring topology provides efficient routing, but its functionality depends on the stability of each node."
      },
      "example": {
        "kk": "Сақина топологиясында бір байланыс үзілсе, бүкіл желі істен шығады.",
        "ru": "При кольцевой топологии разрыв одного соединения приводит к выходу всей сети из строя.",
        "en": "In ring topology, a single connection failure disrupts the entire network."
      },
      "relations": {
        "synonyms": [
          "тізбектелген топология"
        ],
        "general_concept": "Сақина топологиясы деректерді ретімен жіберуді қамтамасыз етеді.",
        "specific_concepts": [
          "деректерді жіберу",
          "байланыс"
        ],
        "associative": [
          "тұрақтылық",
          "реттілік"
        ]
      }
    },
    {
      "kk": "Шина топологиясы",
      "ru": "Шинная топология",
      "en": "Bus Topology",
      "definition": {
        "kk": "Шина топологиясы - бұл барлық құрылғылар бір таратқыш арнаға (Шина магистраліне) қосылған желілік архитектураның моделі. Бұл схемада деректер бір байланыс желісі бойынша беріледі, ал әрбір түйін ақпаратты қабылдайды және өңдейді. Шина топологиясы қарапайым, бірақ жалпы арнаға жоғары жүктеме түскенде оның тиімділігі төмендеуі мүмкін.",
        "ru": "Шинная топология – модель сетевой архитектуры, в которой все устройства подключены к единому передающему каналу (шинному магистралю). В такой схеме данные передаются по одной линии связи, а каждый узел принимает и обрабатывает информацию. Шинная топология отличается простотой, но при высокой нагрузке на общий канал может снижаться её эффективность.",
        "en": "Bus topology – a network architecture model in which all devices are connected to a single communication channel (bus). In this configuration, data is transmitted along a common network line, and each node is responsible for receiving and processing information. Bus topology is simple but may experience reduced efficiency under high traffic loads."
      },
      "example": {
        "kk": "Шина топологиясында кабельдің зақымдалуы бүкіл желінің жұмысын тоқтатады.",
        "ru": "При шинной топологии повреждение кабеля приводит к остановке всей сети.",
        "en": "In bus topology, cable damage can cause the entire network to stop functioning."
      },
      "relations": {
        "synonyms": [
          "ортақ кабель"
        ],
        "general_concept": "Шина топологиясы қарапайым және арзан болып табылады.",
        "specific_concepts": [
          "кабель",
          "деректер"
        ],
        "associative": [
          "қарапайымдылық",
          "тиімділік"
        ]
      }
    },
    {
      "kk": "Маршрутизатор",
      "ru": "Маршрутизатор",
      "en": "Router",
      "definition": {
        "kk": "Маршрутизатор – деректер пакеттерін тасымалдау және бағыттау үшін компьютерлік желілерде қолданылатын құрылғы. Ол желілік түйіндерді байланыстырады және ақпаратты ең оңтайлы бағыттар бойынша бағыттайды. Маршрутизаторлар жергілікті және ғаламдық желілерде қолданылады, олардың жұмысы IP мекенжайлары мен маршруттау хаттамаларына негізделген.",
        "ru": "Маршрутизатор (роутер) – устройство, используемое в компьютерных сетях для передачи и маршрутизации пакетов данных. Оно соединяет сетевые узлы и направляет информацию по наиболее оптимальным маршрутам. Маршрутизаторы применяются в локальных и глобальных сетях, их работа основана на IP-адресах и протоколах маршрутизации.",
        "en": "Router – a device used in computer networks for transmitting and routing data packets. It connects network nodes and directs information through the most efficient paths. Routers are employed in local and global networks, operating based on IP addresses and routing protocols."
      },
      "example": {
        "kk": "Маршрутизатор бірнеше құрылғыларға интернетті жеткізеді.",
        "ru": "Маршрутизатор распределяет интернет на несколько устройств.",
        "en": "A router distributes internet to multiple devices."
      },
      "image": "",
      "source": ""
    },
    {
      "kk": "Шлюз",
      "ru": "Шлюз",
      "en": "Gateway",
      "definition": {
        "kk": "Шлюз - әртүрлі желілік протоколдар мен архитектураларды біріктіруге арналған байланыс құрылғысы. Ол үйлесімділікті сақтау үшін ақпаратты түрлендіру және қайта бағыттау арқылы әртүрлі желілер арасында деректер алмасуды қамтамасыз етеді. Шлюздер интернет байланыстарында, корпоративтік желілерде және телекоммуникациялық жүйелерде маңызды рөл атқарады.",
        "ru": "Шлюз – коммуникационное устройство, предназначенное для объединения различных сетевых протоколов и архитектур. Он обеспечивает обмен данными между разными сетями, преобразуя и перенаправляя информацию для поддержания совместимости. Шлюзы играют важную роль в интернет-соединениях, корпоративных сетях и телекоммуникационных системах.",
        "en": "Gateway – a communication device used to integrate different network protocols and architectures. It facilitates data exchange between diverse networks by transforming and redirecting information to ensure compatibility. Gateways play a vital role in internet connections, corporate networks, and telecommunications systems."
      },
      "example": {
        "kk": "Шлюз арқылы жергілікті желі мен интернет арасында байланыс орнатылады.",
        "ru": "С помощью шлюза устанавливается связь между локальной сетью и интернетом.",
        "en": "A gateway establishes communication between a local network and the internet."
      },
      "relations": {
        "synonyms": [
          "желілік шлюз"
        ],
        "general_concept": "Шлюз деректерді түрлендіру және маршруттау функциясын орындайды.",
        "specific_concepts": [
          "желілік байланыс",
          "деректер алмасу"
        ],
        "associative": [
          "байланыс",
          "технология"
        ]
      }
    },
    {
      "kk": "Брандмауэр",
      "ru": "Брандмауэр",
      "en": "Firewall",
      "definition": {
        "kk": "Брандмауэр – компьютерлік желілерде рұқсатсыз кіруді және деректерді қорғауды болдырмауға арналған қауіпсіздік жүйесі. Ол кіріс және шығыс желілік трафикті бақылау, сүзу және бағыттау арқылы ақпараттық қауіпсіздікті қамтамасыз етеді. Брандмауэр аппараттық немесе бағдарламалық жасақтамада жүзеге асырылуы мүмкін.",
        "ru": "Брандмауэр (межсетевой экран) – система безопасности, предназначенная для предотвращения несанкционированного доступа и защиты данных в компьютерных сетях. Он обеспечивает информационную безопасность путём контроля, фильтрации и маршрутизации входящего и исходящего сетевого трафика. Брандмауэр может быть реализован аппаратно или программно.",
        "en": "Firewall – a security system designed to prevent unauthorized access and protect data within computer networks. It ensures information security by monitoring, filtering, and routing incoming and outgoing network traffic based on predefined rules. Firewalls can be implemented as hardware or software solutions."
      },
      "example": {
        "kk": "Брандмауэр зиянды шабуылдардан қорғайды.",
        "ru": "Брандмауэр защищает от вредоносных атак.",
        "en": "A firewall protects against malicious attacks."
      },
      "image": "",
      "source": ""
    }
  ],
  "Дәріс 6. Бұлтты және мобильді технологиялар": [
    {
      "kk": "Бұлтты есептеулер",
      "ru": "Облачные вычисления",
      "en": "Cloud Computing",
      "definition": {
        "kk": "Бұлтты есептеу - интернет арқылы есептеу ресурстары мен қызметтеріне қол жеткізуді қамтамасыз ететін технологиялық модель. Ол деректерді өңдеу, ақпаратты сақтау және бағдарламалық жасақтаманы басқару мүмкіндіктерін ұсынады. Бұлтты есептеу көптеген пайдаланушылар үшін масштабталатын және икемді инфрақұрылымды қамтамасыз етеді.",
        "ru": "Облачные вычисления – технологическая модель, обеспечивающая доступ к вычислительным ресурсам и сервисам через интернет. Она предоставляет возможности обработки данных, хранения информации и управления программным обеспечением. Облачные вычисления предоставляют масштабируемую и гибкую инфраструктуру для множества пользователей.",
        "en": "Cloud computing – a technological model that provides access to computing resources and services via the internet. It offers capabilities for data processing, storage, and software management. Cloud computing enables scalable and flexible infrastructure for multiple users."
      },
      "example": {
        "kk": "Google Drive бұлтты есептеулердің бір түрі болып табылады.",
        "ru": "Google Drive является одним из видов облачных вычислений.",
        "en": "Google Drive is an example of cloud computing."
      },
      "relations": {
        "synonyms": [
          "онлайн қызметтер"
        ],
        "general_concept": "Бұлтты есептеулер деректерді сақтау үшін интернет арқылы қол жетімді платформа.",
        "specific_concepts": [
          "деректер сақтау",
          "бұлт"
        ],
        "associative": [
          "онлайн орта",
          "қолжетімділік"
        ]
      }
    },
    {
      "kk": "Бұлтты сақтау",
      "ru": "Облачное хранилище",
      "en": "Cloud Storage",
      "definition": {
        "kk": "Бұлтты сақтау – интернет арқылы деректерді қашықтан сақтау және басқару технологиясы. Ол ақпараттың сақталуын, сақтық көшірмесін жасауды және деректерге қауіпсіз қол жеткізуді қамтамасыз етеді. Бұлтты сақтау кең ауқымды инфрақұрылымға негізделген және жеке, қоғамдық немесе гибридті болуы мүмкін.",
        "ru": "Облачное хранилище – технология удалённого хранения и управления данными через интернет. Оно обеспечивает хранение информации, резервное копирование и безопасный доступ к данным. Облачные хранилища базируются на масштабируемой инфраструктуре и могут быть частными, публичными или гибридными.",
        "en": "Cloud storage – a technology for remotely storing and managing data via the internet. It provides data storage, backup, and secure access capabilities. Cloud storage is based on scalable infrastructure and can be deployed as private, public, or hybrid models."
      },
      "example": {
        "kk": "Dropbox деректерді бұлтта сақтауға мүмкіндік береді.",
        "ru": "Dropbox позволяет хранить данные в облаке.",
        "en": "Dropbox enables cloud-based data storage."
      },
      "relations": {
        "synonyms": [
          "онлайн сақтау"
        ],
        "general_concept": "Бұлтты сақтау деректерге кез келген жерден қол жеткізуге мүмкіндік береді.",
        "specific_concepts": [
          "сервер",
          "қолжетімділік"
        ],
        "associative": [
          "ресурстар",
          "құрал"
        ]
      }
    },
    {
      "kk": "Бұлтты платформалар",
      "ru": "Облачные платформы",
      "en": "Cloud Platforms",
      "definition": {
        "kk": "Бұлтты платформалар – интернет-технологияларға негізделген қосымшаларды сақтау, өңдеу және орналастыру қызметтерін ұсынатын Инфрақұрылым. Олар пайдаланушыларға есептеу қуатын, желілік ресурстарды және бағдарламалық жасақтаманы қашықтан басқаруға мүмкіндік береді. Бұлтты платформалар IaaS, PaaS және SaaS модельдеріне негізделген.",
        "ru": "Облачные платформы – инфраструктура, предоставляющая услуги хранения, обработки данных и размещения приложений на основе интернет-технологий. Они позволяют пользователям удалённо управлять вычислительными мощностями, сетевыми ресурсами и программным обеспечением. Облачные платформы функционируют на основе моделей IaaS, PaaS и SaaS.",
        "en": "Cloud platforms – an infrastructure that provides storage, data processing, and application hosting services over the internet. They enable users to remotely manage computing power, networking resources, and software applications. Cloud platforms operate based on IaaS, PaaS, and SaaS models."
      },
      "example": {
        "kk": "Amazon AWS – бұлтты платформалардың бірі.",
        "ru": "Amazon AWS — одна из облачных платформ.",
        "en": "Amazon AWS is one of the cloud platforms."
      },
      "relations": {
        "synonyms": [
          "онлайн платформалар"
        ],
        "general_concept": "Бұлтты платформалар қолданушыларға көптеген ресурстарды ұсынады.",
        "specific_concepts": [
          "бағдарламалар",
          "ресурстар"
        ],
        "associative": [
          "қолжетімділік",
          "инновация"
        ]
      }
    },
    {
      "kk": "Мобильді қосымшалар",
      "ru": "Мобильные приложения",
      "en": "Mobile Applications",
      "definition": {
        "kk": "Мобильді қосымшалар - смартфондарға, планшеттерге және басқа мобильді құрылғыларға арналған бағдарламалық жасақтама. Бұл пайдаланушыларға әртүрлі қызметтерге қол жеткізуге, деректерді өңдеуге және интернет арқылы ақпарат алмасуға мүмкіндік береді. Мобильді қосымшалар платформалық (iOS, Android) және вебке бағытталған.",
        "ru": "Мобильные приложения – программное обеспечение, разработанное для смартфонов, планшетов и других мобильных устройств. Оно позволяет пользователям получать доступ к различным сервисам, обрабатывать данные и обмениваться информацией через интернет. Мобильные приложения бывают платформенными (iOS, Android) и веб-ориентированными.",
        "en": "Mobile applications – software designed for smartphones, tablets, and other mobile devices. They enable users to access various services, process data, and exchange information via the internet. Mobile applications exist in platform-specific (iOS, Android) and web-based versions."
      },
      "example": {
        "kk": "Instagram – танымал мобильді қосымша.",
        "ru": "Instagram — популярное мобильное приложение.",
        "en": "Instagram is a popular mobile application."
      },
      "relations": {
        "synonyms": [
          "мобильді бағдарлама"
        ],
        "general_concept": "Мобильді қосымшалар смартфондар мен планшеттерді пайдалануды жеңілдетеді.",
        "specific_concepts": [
          "смартфон",
          "платформа"
        ],
        "associative": [
          "жүктеу",
          "қолдану"
        ]
      }
    },
    {
      "kk": "Мобилді қызметтер",
      "ru": "Мобильные сервисы",
      "en": "Mobile Services",
      "definition": {
        "kk": "Мобильді қызметтер-мобильді құрылғылар арқылы пайдаланушыларға қолжетімді цифрлық және коммуникациялық қызметтер жиынтығы. Оларға ақпарат алмасу, навигация, онлайн төлемдер, әлеуметтік медиа және басқа мүмкіндіктер кіреді. Мобильді қызметтер ұялы желілер, GPS және бұлтты технологиялар негізінде жұмыс істейді.",
        "ru": "Мобильные сервисы – совокупность цифровых и коммуникационных услуг, доступных пользователям через мобильные устройства. Они включают обмен информацией, навигацию, онлайн-платежи, социальные сети и другие функции. Мобильные сервисы работают на основе сотовых сетей, GPS и облачных технологий.",
        "en": "Mobile services – a collection of digital and communication services accessible to users via mobile devices. They include information exchange, navigation, online payments, social media, and other functionalities. Mobile services operate based on cellular networks, GPS, and cloud technologies."
      },
      "example": {
        "kk": "Мобилді банк қызметтері арқылы шоттарды бақылауға болады.",
        "ru": "Через мобильные банковские сервисы можно отслеживать счета.",
        "en": "Mobile banking services allow tracking of accounts."
      },
      "relations": {
        "synonyms": [
          "онлайн қызметтер"
        ],
        "general_concept": "Мобилді қызметтер пайдаланушыларға ыңғайлы шешімдер ұсынады.",
        "specific_concepts": [
          "смартфон",
          "интернет"
        ],
        "associative": [
          "қолдану",
          "қолжетімділік"
        ]
      }
    },
    {
      "kk": "Виртуалды машина",
      "ru": "Виртуальная машина",
      "en": "Virtual Machine",
      "definition": {
        "kk": "Виртуалды машина - бұл физикалық компьютердің функционалдығын имитациялайтын және оқшауланған операциялық жүйені іске қосуға мүмкіндік беретін бағдарламалық жасақтама. Виртуалды машиналар серверді шоғырландыру, бағдарламалық жасақтаманы тестілеу және қауіпсіздік механизмдерін енгізу үшін кеңінен қолданылады.",
        "ru": "Виртуальная машина – программно созданная вычислительная среда, имитирующая функциональность физического компьютера и позволяющая запускать изолированную операционную систему. Виртуальные машины широко применяются для серверной консолидации, тестирования программного обеспечения и реализации механизмов безопасности.",
        "en": "Virtual machine – a software-created computing environment that simulates the functionality of a physical computer and allows an isolated operating system to run. Virtual machines are widely used for server consolidation, software testing, and security implementation."
      },
      "example": {
        "kk": "VMware виртуалды машиналарды басқаруға арналған платформа болып табылады.",
        "ru": "VMware — это платформа для управления виртуальными машинами.",
        "en": "VMware is a platform for managing virtual machines."
      },
      "relations": {
        "synonyms": [
          "виртуалды операциялық жүйе"
        ],
        "general_concept": "Виртуалды машина деректерді тәуелсіз ортада өңдейді.",
        "specific_concepts": [
          "операциялық жүйе",
          "ресурстар"
        ],
        "associative": [
          "тәуелсіздік",
          "құрал"
        ]
      }
    },
    {
      "kk": "Мобильді байланыс",
      "ru": "Мобильная связь",
      "en": "Mobile Communication",
      "definition": {
        "kk": "Ұялы байланыс-радио толқындарын немесе спутниктік технологияларды қолдана отырып, ақпараттың сымсыз берілуін қамтамасыз ететін телекоммуникациялық жүйе. Оған телефонмен сөйлесу, хабарлама жіберу, интернетке қосылу және деректерді беру қызметтері кіреді. Ұялы байланыс ұялы желілердің инфрақұрылымына негізделген және GSM, CDMA, LTE, 5G технологияларын қолдана отырып дамиды.",
        "ru": "Мобильная связь – телекоммуникационная система, обеспечивающая беспроводную передачу информации с использованием радиоволн или спутниковых технологий. Она включает услуги телефонных разговоров, отправки сообщений, подключения к интернету и передачи данных. Мобильная связь базируется на инфраструктуре сотовых сетей и развивается с применением технологий GSM, CDMA, LTE, 5G.",
        "en": "Mobile communication – a telecommunications system enabling wireless transmission of information using radio waves or satellite technologies. It includes services such as phone calls, messaging, internet connectivity, and data transfer. Mobile communication relies on cellular network infrastructure and evolves with technologies like GSM, CDMA, LTE, and 5G."
      },
      "example": {
        "kk": "5G мобильді байланыс жылдамдығын арттырады.",
        "ru": "5G увеличивает скорость мобильной связи.",
        "en": "5G enhances the speed of mobile communication."
      },
      "relations": {
        "synonyms": [
          "ұялы байланыс"
        ],
        "general_concept": "Мобильді байланыс адамдар арасында байланыс орнатуға мүмкіндік береді.",
        "specific_concepts": [
          "5G",
          "смартфон"
        ],
        "associative": [
          "жылдамдық",
          "желілер"
        ]
      }
    },
    {
      "kk": "Мобильді құрылғылар",
      "ru": "Мобильные устройства",
      "en": "Mobile Devices",
      "definition": {
        "kk": "Мобильді құрылғылар - дербес қуат көздерінде жұмыс істейтін және сымсыз байланыс мүмкіндігі бар электрондық құрылғылар. Оларға Смартфондар, планшеттер, ақылды сағаттар және басқа портативті жүйелер кіреді. Мобильді құрылғылар ақпаратты өңдеу, Байланыс және Интернетке қол жеткізу үшін кеңінен қолданылады.",
        "ru": "Мобильные устройства – электронные устройства, работающие на автономных источниках питания и имеющие возможность беспроводной связи. К ним относятся смартфоны, планшеты, умные часы и другие портативные системы. Мобильные устройства широко используются для обработки информации, коммуникации и доступа к интернету.",
        "en": "Mobile devices – electronic devices powered by autonomous energy sources with wireless communication capabilities. These include smartphones, tablets, smartwatches, and other portable systems. Mobile devices are widely used for information processing, communication, and internet access."
      },
      "example": {
        "kk": "Мобильді құрылғылар арқылы интернетке қосылуға болады.",
        "ru": "Через мобильные устройства можно подключаться к интернету.",
        "en": "Mobile devices allow internet connectivity."
      },
      "relations": {
        "synonyms": [
          "ұялы құрылғылар"
        ],
        "general_concept": "Мобильді құрылғылар адамдарға байланыста болуға мүмкіндік береді.",
        "specific_concepts": [
          "смартфон",
          "планшет"
        ],
        "associative": [
          "портативтілік",
          "байланыс"
        ]
      }
    }
  ],
  "Дәріс 7. Smart технологиялар": [
    {
      "kk": "SMART технологиясы",
      "ru": "SMART технология",
      "en": "SMART Technology",
      "definition": {
        "kk": "SMART технологиясы - интеллектуалды және автоматтандырылған жүйелерді пайдалану арқылы тиімділікті арттыратын инновациялық тәсілдердің жиынтығы. Ол деректерді өңдеуді, шешім қабылдауды және жасанды интеллект, сенсорлық деректер және алгоритмдер негізінде қызметтерді оңтайландыруды қамтиды. SMART технологиялары тұрмыстық құрылғылардан өнеркәсіптік автоматтандыруға дейін кеңінен қолданылады.",
        "ru": "SMART технология – совокупность инновационных подходов, повышающих эффективность за счёт использования интеллектуальных и автоматизированных систем. Она включает обработку данных, принятие решений и оптимизацию услуг на основе искусственного интеллекта, сенсорных данных и алгоритмов. SMART технологии широко применяются от бытовых устройств до промышленной автоматизации.",
        "en": "SMART technology – a collection of innovative approaches that enhance efficiency through the use of intelligent and automated systems. It involves data processing, decision-making, and service optimization using artificial intelligence, sensor data, and algorithms. SMART technologies are widely applied, from household devices to industrial automation."
      },
      "example": {
        "kk": "SMART тақталар оқушылар мен мұғалімдердің оқу процесін жеңілдетеді.",
        "ru": "SMART-доски упрощают процесс обучения для учеников и учителей.",
        "en": "SMART boards simplify the learning process for students and teachers."
      },
      "relations": {
        "synonyms": [
          "интерактивті технология"
        ],
        "general_concept": "SMART технология білім беру мен кәсіпкерлік салаларында тиімділікті арттырады.",
        "specific_concepts": [
          "интерактивті тақта",
          "ақылды шешімдер"
        ],
        "associative": [
          "инновация",
          "технология"
        ]
      }
    },
    {
      "kk": "Ақылды үй",
      "ru": "Умный дом",
      "en": "Smart Home",
      "definition": {
        "kk": "Ақылды үй - бұл тұрмыстық құрылғыларды, қауіпсіздік жүйелерін және энергияны үнемдеу технологияларын біріктіретін автоматтандырылған басқару жүйелерімен жабдықталған тұрғын үй. Ақылды үйлер пайдаланушылардың жайлылығын арттыру үшін жасанды интеллект, Заттар интернеті (IoT) және сенсорлық басқаруды қолданады.",
        "ru": "Умный дом – жилое пространство, оснащённое автоматизированными системами управления, объединяющее бытовые устройства, системы безопасности и технологии энергосбережения. Умные дома используют искусственный интеллект, Интернет вещей (IoT) и сенсорное управление для повышения комфорта пользователей.",
        "en": "Smart home – a living space equipped with automated control systems integrating household devices, security systems, and energy-saving technologies. Smart homes utilize artificial intelligence, the Internet of Things (IoT), and sensor-based control to enhance user convenience."
      },
      "example": {
        "kk": "Ақылды үйде жарықтандыруды смартфон арқылы басқаруға болады.",
        "ru": "В умном доме можно управлять освещением через смартфон.",
        "en": "In a smart home, lighting can be controlled through a smartphone."
      },
      "relations": {
        "synonyms": [
          "SMART үй"
        ],
        "general_concept": "Ақылды үй тұрмыстық жайлылықты арттырады және энергия тиімділігін қамтамасыз етеді.",
        "specific_concepts": [
          "ақылды құрылғылар",
          "автоматтандыру"
        ],
        "associative": [
          "қашықтан басқару",
          "технология"
        ]
      }
    },
    {
      "kk": "Ақылды құрылғылар",
      "ru": "Умные устройства",
      "en": "Smart Devices",
      "definition": {
        "kk": "Ақылды құрылғылар - деректерді өңдеу, Автоматтандыру және пайдаланушы тәжірибесі үшін жасанды интеллект, сенсорлар және байланыс технологияларын пайдаланатын электрондық құрылғылар. Оларға смартфондар, ақылды сағаттар, Тұрмыстық техника және өнеркәсіптік IoT жүйелері кіреді.",
        "ru": "Умные устройства – электронные устройства, использующие искусственный интеллект, сенсоры и технологии связи для обработки данных, автоматизации и взаимодействия с пользователем. К ним относятся смартфоны, умные часы, бытовая техника и промышленные IoT-системы.",
        "en": "Smart devices – electronic devices that utilize artificial intelligence, sensors, and communication technologies for data processing, automation, and user interaction. They include smartphones, smartwatches, household appliances, and industrial IoT systems."
      },
      "example": {
        "kk": "Ақылды сағаттар пайдаланушыларға денсаулық деректерін бақылауға мүмкіндік береді.",
        "ru": "Умные часы позволяют пользователям отслеживать данные о здоровье.",
        "en": "Smartwatches enable users to monitor health data."
      },
      "relations": {
        "synonyms": [
          "ақылды гаджеттер"
        ],
        "general_concept": "Ақылды құрылғылар өмір сапасын жақсартады.",
        "specific_concepts": [
          "смартфон",
          "сағат"
        ],
        "associative": [
          "қосымшалар",
          "пайдалану"
        ]
      }
    },
    {
      "kk": "Wi-Fi",
      "ru": "Wi-Fi",
      "en": "Wi-Fi",
      "definition": {
        "kk": "Wi-Fi – радио толқындарын қолданатын сымсыз деректерді беру технологиясы. Бұл құрылғыларға жергілікті желілерде ақпарат алмасуға және интернетке қосылуға мүмкіндік береді. Wi-Fi IEEE 802.11 стандарттарына негізделген және әртүрлі жиілік диапазондарын қолданады (2.4 ГГц, 5 ГГц, 6 ГГц).",
        "ru": "Wi-Fi – технология беспроводной передачи данных с использованием радиоволн. Она позволяет устройствам обмениваться информацией в локальных сетях и подключаться к интернету. Wi-Fi основан на стандартах IEEE 802.11 и использует различные диапазоны частот (2.4 ГГц, 5 ГГц, 6 ГГц).",
        "en": "Wi-Fi – a wireless data transmission technology using radio waves. It enables devices to exchange information within local networks and access the internet. Wi-Fi is based on IEEE 802.11 standards and operates at various frequency ranges (2.4 GHz, 5 GHz, 6 GHz)."
      },
      "example": {
        "kk": "Wi-Fi қосылымы арқылы интернетке сымсыз қол жеткізуге болады.",
        "ru": "Через подключение Wi-Fi можно получить беспроводной доступ к интернету.",
        "en": "Wi-Fi connection allows wireless access to the internet."
      },
      "relations": {
        "synonyms": [
          "сымсыз желі"
        ],
        "general_concept": "Wi-Fi технологиясы пайдаланушыларды кабельдерден босатады және мобильділікке мүмкіндік береді.",
        "specific_concepts": [
          "роутер",
          "сымсыз желі"
        ],
        "associative": [
          "интернет",
          "қол жетімділік"
        ]
      }
    },
    {
      "kk": "Блокчейн",
      "ru": "Блокчейн",
      "en": "Blockchain",
      "definition": {
        "kk": "Блокчейн - деректерді қауіпсіз сақтауға және тасымалдауға арналған таратылған сандық тізілім жүйесі. Ол блокчейннен тұрады, олардың әрқайсысы ақпараттың өзгермейтіндігін қамтамасыз ете отырып, алдыңғысымен криптографиялық байланысты. Блокчейн қаржы, логистика, денсаулық сақтау және басқа салаларда сенімді технология ретінде қолданылады.",
        "ru": "Блокчейн – распределённая цифровая система реестра, предназначенная для безопасного хранения и передачи данных. Она состоит из цепочки блоков, каждый из которых криптографически связан с предыдущим, обеспечивая неизменяемость информации. Блокчейн используется в финансах, логистике, здравоохранении и других отраслях как надёжная технология.",
        "en": "Blockchain – a distributed digital ledger system designed for secure data storage and transmission. It consists of a chain of blocks, each cryptographically linked to the previous one, ensuring data immutability. Blockchain is widely used in finance, logistics, healthcare, and other industries as a trusted technology."
      },
      "example": {
        "kk": "Блокчейн криптовалюталар транзакцияларын қауіпсіз етуде маңызды рөл атқарады.",
        "ru": "Блокчейн играет важную роль в обеспечении безопасности транзакций с криптовалютами.",
        "en": "Blockchain plays a vital role in securing cryptocurrency transactions."
      },
      "relations": {
        "synonyms": [
          "таратылған журнал"
        ],
        "general_concept": "Блокчейн технологиясы деректердің өзгермейтіндігін қамтамасыз етеді.",
        "specific_concepts": [
          "криптовалюта",
          "транзакция"
        ],
        "associative": [
          "қауіпсіздік",
          "сенімділік"
        ]
      }
    }
  ],
  "Дәріс 8. Е - технологиялар": [
    {
      "kk": "Электрондық технология",
      "ru": "Электронные технологии",
      "en": "Electronic Technology",
      "definition": {
        "kk": "Электрондық технологиялар - ақпаратты өңдеу, сақтау және беру үшін электроникаға негізделген құрылғылар мен жүйелерді пайдалану әдістері. Олар сандық есептеу құрылғыларын, байланыс желілерін, деректерді басқару жүйелерін және автоматтандырылған процестерді қамтиды. Электрондық технологиялар өнеркәсіпте, тұрмыстық техникада және цифрлық сервистерде қолданылады.",
        "ru": "Электронные технологии – методы использования устройств и систем, основанных на электронике, для обработки, хранения и передачи информации. Они охватывают цифровые вычислительные устройства, коммуникационные сети, системы управления данными и автоматизированные процессы. Электронные технологии применяются в промышленности, бытовой технике и цифровых сервисах.",
        "en": "Electronic technologies – methods of utilizing devices and systems based on electronics for information processing, storage, and transmission. They encompass digital computing devices, communication networks, data management systems, and automated processes. Electronic technologies are applied across industries, household appliances, and digital services."
      },
      "example": {
        "kk": "Электрондық технологиялар арқылы өндіріс процесін автоматтандыру жүзеге асырылады.",
        "ru": "С помощью электронных технологий осуществляется автоматизация производственного процесса.",
        "en": "Electronic technologies enable the automation of production processes."
      },
      "relations": {
        "synonyms": [
          "цифрлық технологиялар"
        ],
        "general_concept": "Электрондық технологиялар ақпаратты басқару мен өндіріске тиімділік қосады.",
        "specific_concepts": [
          "құрылғылар",
          "инновация"
        ],
        "associative": [
          "ақпарат",
          "интернет"
        ]
      }
    },
    {
      "kk": "Электронды білім беру",
      "ru": "Электронное образование",
      "en": "E-learning",
      "definition": {
        "kk": "Электрондық білім беру - цифрлық технологиялар мен интернетті пайдалана отырып іске асырылатын оқыту жүйесі. Оған онлайн курстар, виртуалды сабақтар, интерактивті ресурстар және қашықтықтан оқыту платформалары кіреді. Электрондық білім беру білім беру процесін икемді, қолжетімді және жекелендірілген етеді.",
        "ru": "Электронное образование – система обучения, реализуемая с использованием цифровых технологий и интернета. Оно включает онлайн-курсы, виртуальные классы, интерактивные ресурсы и платформы дистанционного обучения. Электронное образование делает образовательный процесс гибким, доступным и персонализированным.",
        "en": "E-learning – an educational system implemented through digital technologies and the internet. It includes online courses, virtual classrooms, interactive resources, and distance learning platforms. E-learning enables a flexible, accessible, and personalized learning experience."
      },
      "example": {
        "kk": "Электронды білім беру платформалары оқушыларға қашықтан оқуға мүмкіндік береді.",
        "ru": "Платформы электронного образования позволяют ученикам учиться удалённо.",
        "en": "E-learning platforms enable students to learn remotely."
      },
      "relations": {
        "synonyms": [
          "электронды оқыту"
        ],
        "general_concept": "Электронды білім беру білім алуды икемді және қолжетімді етеді.",
        "specific_concepts": [
          "қашықтан оқу",
          "онлайн курстар"
        ],
        "associative": [
          "платформа",
          "мультимедиа"
        ]
      }
    },
    {
      "kk": "Электронды үкімет",
      "ru": "Электронное правительство",
      "en": "E-government",
      "definition": {
        "kk": "Электрондық үкімет - мемлекеттік процестерді цифрлық Автоматтандыру және Азаматтарға, бизнеске және мемлекеттік қызметшілерге тиімді қызметтер көрсету жүйесі. Ол мемлекеттік деректер базасын біріктіруді, онлайн-сервистерді дамытуды және ашық үкімет платформасын құруды қамтиды.",
        "ru": "Электронное правительство – система цифровой автоматизации государственных процессов и предоставления эффективных услуг гражданам, бизнесу и государственным служащим. Оно включает интеграцию государственных баз данных, развитие онлайн-сервисов и создание платформы открытого правительства.",
        "en": "E-government – a system for digital automation of governmental processes and efficient service delivery to citizens, businesses, and public officials. It involves integration of government databases, development of online services, and creation of an open government platform."
      },
      "example": {
        "kk": "Электронды үкімет порталы арқылы салықтарды төлеуге болады.",
        "ru": "Через портал электронного правительства можно оплачивать налоги.",
        "en": "Taxes can be paid through the e-government portal."
      },
      "relations": {
        "synonyms": [
          "электронды әкімшілік"
        ],
        "general_concept": "Электронды үкімет азаматтарға жылдам және ыңғайлы қызметтер ұсынады.",
        "specific_concepts": [
          "қызметтер",
          "ақпараттық жүйе"
        ],
        "associative": [
          "технология",
          "ресурстар"
        ]
      }
    },
    {
      "kk": "Электронды сауда",
      "ru": "Электронная коммерция",
      "en": "E-commerce",
      "definition": {
        "kk": "Электрондық коммерция - интернет пен цифрлық технологияларды пайдалана отырып, тауарлар мен қызметтерді сатып алу, сату және тарату процесі. Оған онлайн төлем жүйелері, цифрлық маркетинг және логистикалық инфрақұрылым кіреді. Электрондық коммерция жаһандық нарыққа қол жеткізуді қамтамасыз ете отырып, бизнес пен тұтынушылардың өзара әрекеттесу үлгісін өзгертеді.",
        "ru": "Электронная коммерция – процесс покупки, продажи и распространения товаров и услуг с использованием интернета и цифровых технологий. Она включает онлайн-платежные системы, цифровой маркетинг и логистическую инфраструктуру. Электронная коммерция трансформирует модель взаимодействия между бизнесом и потребителями, обеспечивая доступ к глобальному рынку.",
        "en": "E-commerce – the process of buying, selling, and distributing goods and services using the internet and digital technologies. It encompasses online payment systems, digital marketing, and delivery infrastructure. E-commerce transforms business-consumer interactions, enabling access to global markets."
      },
      "example": {
        "kk": "Электронды сауда платформалары арқылы тапсырыстар жасауға болады.",
        "ru": "Через платформы электронной коммерции можно делать заказы.",
        "en": "Orders can be placed through e-commerce platforms."
      },
      "relations": {
        "synonyms": [
          "онлайн сауда"
        ],
        "general_concept": "Электронды сауда сауда-саттық процесін жеңілдетеді және уақыт үнемдейді.",
        "specific_concepts": [
          "онлайн дүкендер",
          "төлемдер"
        ],
        "associative": [
          "интернет",
          "қолжетімділік"
        ]
      }
    },
    {
      "kk": "Портал",
      "ru": "Портал",
      "en": "Portal",
      "definition": {
        "kk": "Портал - пайдаланушылардың ақпаратқа, қызметтер мен құралдарға интеграцияланған қол жеткізуін қамтамасыз ететін цифрлық платформа. Ол деректерді басқару мүмкіндіктерін, интерактивті мүмкіндіктерді және көп арналы байланыстарды ұсынады. Порталдар мемлекеттік, корпоративтік және білім беру салаларында кеңінен қолданылады.",
        "ru": "Портал – цифровая платформа, обеспечивающая интегрированный доступ пользователей к информации, сервисам и инструментам. Она предоставляет возможности управления данными, интерактивные функции и многоканальные коммуникации. Порталы широко применяются в государственных, корпоративных и образовательных сферах.",
        "en": "Portal – a digital platform that provides integrated user access to information, services, and tools. It offers data management, interactive functionalities, and multichannel communication capabilities. Portals are widely used in government, corporate, and educational sectors."
      },
      "example": {
        "kk": "Е-үкімет порталы арқылы азаматтар мемлекеттік қызметтерге қол жеткізе алады.",
        "ru": "Через портал электронного правительства граждане могут получить доступ к государственным услугам.",
        "en": "Through the e-government portal, citizens can access public services."
      },
      "relations": {
        "synonyms": [
          "веб-платформа"
        ],
        "general_concept": "Порталдар пайдаланушыларға қажетті ақпаратты бір жерден алуға мүмкіндік береді.",
        "specific_concepts": [
          "ақпараттық жүйе",
          "қызметтер"
        ],
        "associative": [
          "интернет",
          "қолжетімділік"
        ]
      }
    },
    {
      "kk": "Провайдинг",
      "ru": "Провайдинг",
      "en": "Providing",
      "definition": {
        "kk": "Провайдер - Пайдаланушыларға интернет, телекоммуникация қызметтері немесе IT шешімдері сияқты ресурстарға қол жеткізуді қамтамасыз ету процесі. Ол инфрақұрылымды басқаруды, деректерді беруді және байланыс арналарына қызмет көрсетуді қамтиды. Провайдерлер коммерциялық, Мемлекеттік және жеке секторларда кеңінен қолданылады.",
        "ru": "Провайдинг – процесс предоставления пользователям доступа к ресурсам, таким как интернет, телекоммуникационные услуги или IT-решения. Он включает управление инфраструктурой, передачу данных и обслуживание каналов связи. Провайдинг широко используется в коммерческом, государственном и частном секторах.",
        "en": "Providing – the process of offering users access to resources such as internet, telecommunications services, or IT solutions. It involves infrastructure management, data transmission, and communication channel administration. Providing is widely applied in commercial, governmental, and private sectors."
      },
      "example": {
        "kk": "Интернет провайдинг қызметтері арқылы үйге интернет қосуға болады.",
        "ru": "С помощью услуг интернет-провайдинга можно подключить интернет домой.",
        "en": "Internet providing services can be used to connect internet at home."
      },
      "relations": {
        "synonyms": [
          "қызмет көрсету"
        ],
        "general_concept": "Провайдинг пайдаланушылардың ресурстарға қол жеткізуін қамтамасыз етеді.",
        "specific_concepts": [
          "интернет",
          "бұлттық қызмет"
        ],
        "associative": [
          "қолжетімділік",
          "байланыс"
        ]
      }
    }
  ],
  "Дәріс 9. Internet технологиялар": [
    {
      "kk": "Интернет",
      "ru": "Интернет",
      "en": "Internet",
      "definition": {
        "kk": "Интернет - бүкіл әлем бойынша ақпарат алмасу мен коммуникацияны қамтамасыз ететін ғаламдық компьютерлік желі. Ол деректерді беру, сандық қызметтер және желілік протоколдар негізінде жұмыс істейді. Интернет миллиондаған серверлер мен пайдаланушы құрылғыларын біріктіретін орталықтандырылмаған құрылымға ие.",
        "ru": "Интернет – глобальная компьютерная сеть, обеспечивающая обмен информацией и коммуникацию по всему миру. Она функционирует на основе передачи данных, цифровых сервисов и сетевых протоколов. Интернет имеет децентрализованную структуру, объединяющую миллионы серверов и пользовательских устройств.",
        "en": "Internet – a global computer network that enables information exchange and communication worldwide. It operates through data transmission, digital services, and network protocols. The internet has a decentralized structure, connecting millions of servers and user devices."
      },
      "example": {
        "kk": "Интернет арқылы ақпарат алмасуға және байланыс орнатуға болады.",
        "ru": "С помощью интернета можно обмениваться информацией и устанавливать связь.",
        "en": "The Internet allows information exchange and communication."
      },
      "relations": {
        "synonyms": [
          "бүкіләлемдік желі"
        ],
        "general_concept": "Интернет деректер алмасудың басты платформасы болып табылады.",
        "specific_concepts": [
          "веб-сайт",
          "электронды пошта"
        ],
        "associative": [
          "қол жетімділік",
          "байланыс"
        ]
      }
    },
    {
      "kk": "TCP құжаты",
      "ru": "TCP-документ",
      "en": "TCP Document",
      "definition": {
        "kk": "TCP құжаты - деректерді желі арқылы тасымалдау кезінде Transmission Control Protocol (TCP) арқылы өңделетін ақпараттық файл. Ол қосылымды басқаруда, пакеттерді ұйымдастыруда және деректердің тұтастығын қамтамасыз етуде шешуші рөл атқарады. TCP құжаттары желілік хаттамаларда және байланыс архитектурасында кеңінен қолданылады.",
        "ru": "TCP-документ – информационный файл, обрабатываемый по протоколу Transmission Control Protocol (TCP) во время передачи данных по сети. Он играет ключевую роль в управлении соединением, упорядочивании пакетов и обеспечении целостности данных. TCP-документы широко используются в сетевых протоколах и архитектуре связи.",
        "en": "TCP document – an informational file processed according to the Transmission Control Protocol (TCP) during data transmission over a network. It plays a key role in connection management, packet sequencing, and data integrity assurance. TCP documents are widely applied in communication protocols and network architecture."
      },
      "example": {
        "kk": "TCP құжаты Интернетте сенімді байланыс орнатуға мүмкіндік береді.",
        "ru": "TCP-документ позволяет устанавливать надёжные соединения в интернете.",
        "en": "A TCP document enables reliable connections over the Internet."
      },
      "relations": {
        "synonyms": [
          "TCP стандарты"
        ],
        "general_concept": "TCP деректер пакеттерін басқаруды және сенімді жеткізуді қамтамасыз етеді.",
        "specific_concepts": [
          "желілер",
          "протокол"
        ],
        "associative": [
          "деректер",
          "қосылу"
        ]
      }
    },
    {
      "kk": "ARPANET",
      "ru": "ARPANET",
      "en": "ARPANET",
      "definition": {
        "kk": "ARPANET - 1969 жылы АҚШ Қорғаныс министрлігінің жетілдірілген ғылыми жобалар басқармасы (ARPA) жасаған алғашқы пакеттік коммутациялық желі. Ол ақпаратты пакеттерге бөлу арқылы деректердің сенімді берілуін қамтамасыз етті. ARPANET заманауи Интернеттің негізі болды және желілік протоколдар мен инфрақұрылымды дамытуға ықпал етті.",
        "ru": "ARPANET – первая сеть с пакетной коммутацией, разработанная в 1969 году Управлением перспективных исследовательских проектов Министерства обороны США (ARPA). Она обеспечивала надёжную передачу данных путём разбиения информации на пакеты. ARPANET стала основой для современного интернета и способствовала развитию сетевых протоколов и инфраструктуры.",
        "en": "ARPANET – the first packet-switching network, developed in 1969 by the Advanced Research Projects Agency (ARPA) of the U.S. Department of Defense. It enabled reliable communication by transmitting data in small packets. ARPANET laid the foundation for the modern internet and contributed to the development of network protocols and infrastructure."
      },
      "example": {
        "kk": "ARPANET ғылыми-зерттеу мақсатында қолданылды.",
        "ru": "ARPANET использовалась для научных исследований.",
        "en": "ARPANET was used for research purposes."
      },
      "relations": {
        "synonyms": [
          "алғашқы желі"
        ],
        "general_concept": "ARPANET қазіргі интернет технологияларының дамуына негіз болды.",
        "specific_concepts": [
          "деректер алмасу",
          "ғылым"
        ],
        "associative": [
          "тарих",
          "инновация"
        ]
      }
    },
    {
      "kk": "Файлдарды тасымалдау протоколы",
      "ru": "Протокол передачи файлов",
      "en": "File Transfer Protocol (FTP)",
      "definition": {
        "kk": "Файлдарды тасымалдау протоколы - Компьютерлік желілер арқылы файлдарды тасымалдау және алу үшін қолданылатын протокол. Ол қашықтағы серверден файлдарды жүктеуге немесе оларды серверге жіберуге мүмкіндік беретін клиент-сервер архитектурасы негізінде жұмыс істейді. FTP файлдарды басқаруда, желіні сақтауда және деректерді бөлісу процестерінде кеңінен қолданылады.",
        "ru": "Протокол передачи файлов — протокол, используемый для передачи и получения файлов через компьютерные сети. Он функционирует на основе клиент-серверной архитектуры, позволяя загружать файлы с удалённого сервера или передавать их на сервер. FTP широко применяется в управлении файлами, сетевых хранилищах и процессах обмена данными.",
        "en": "FTP (File Transfer Protocol) – a protocol used for transferring and receiving files over computer networks. It operates on a client-server architecture, enabling users to download files from a remote server or upload files to it. FTP is widely used in file management, network storage, and data transfer processes."
      },
      "example": {
        "kk": "FTP сервері файлдарды орталықтандырылған түрде сақтауға мүмкіндік береді.",
        "ru": "FTP-сервер позволяет централизованно хранить файлы.",
        "en": "An FTP server allows centralized file storage."
      },
      "relations": {
        "synonyms": [
          "файлдарды тасымалдау"
        ],
        "general_concept": "FTP үлкен көлемдегі файлдарды беру үшін қолданылады.",
        "specific_concepts": [
          "сервер",
          "желілер"
        ],
        "associative": [
          "деректер",
          "қолжетімділік"
        ]
      }
    },
    {
      "kk": "Электронды пошта",
      "ru": "Электронная почта",
      "en": "Email",
      "definition": {
        "kk": "Электрондық пошта - интернет арқылы мәтіндік хабарларды, файлдарды және басқа сандық деректерді жіберуге және алуға мүмкіндік беретін байланыс жүйесі. Ол POP3, IMAP және SMTP сияқты Протокол стандарттарын қолдана отырып, жіберуші мен алушы арасындағы хат алмасуды қамтамасыз етеді.",
        "ru": "Электронная почта – система связи, позволяющая отправлять и получать текстовые сообщения, файлы и другие цифровые данные через интернет. Она обеспечивает обмен корреспонденцией между отправителем и получателем, используя стандарты протоколов, такие как POP3, IMAP и SMTP.",
        "en": "Email (electronic mail) – a communication system that enables sending and receiving text messages, files, and other digital data over the internet. It facilitates correspondence between sender and recipient, utilizing protocol standards such as POP3, IMAP, and SMTP."
      },
      "example": {
        "kk": "Электронды пошта арқылы құжаттарды әріптестермен бөлісуге болады.",
        "ru": "Через электронную почту можно делиться документами с коллегами.",
        "en": "Email can be used to share documents with colleagues."
      },
      "relations": {
        "synonyms": [
          "E-mail",
          "цифрлық пошта"
        ],
        "general_concept": "Электронды пошта ресми және бейресми байланыс үшін кең таралған құрал.",
        "specific_concepts": [
          "хабарламалар",
          "желі"
        ],
        "associative": [
          "байланыс",
          "құжат алмасу"
        ]
      }
    },
    {
      "kk": "ІР (Internet Protocol)",
      "ru": "IP (Интернет-протокол)",
      "en": "IP (Internet Protocol)",
      "definition": {
        "kk": "IP (Интернет протоколы) - компьютерлік желілерде адрестеу, бағыттау және деректерді беру үшін қолданылатын негізгі желілік протокол. Ол әр құрылғыға бірегей IP мекенжайын тағайындайды және ақпараттың дұрыс бағытын қамтамасыз етеді. IP протоколы IPv4 және IPv6 нұсқаларында ұсынылған.",
        "ru": "IP (Интернет-протокол) – основной сетевой протокол, используемый для адресации, маршрутизации и передачи данных в компьютерных сетях. Он назначает каждому устройству уникальный IP-адрес и обеспечивает корректное направление информации. IP протокол представлен в версиях IPv4 и IPv6.",
        "en": "IP (Internet Protocol) – a fundamental network protocol used for addressing, routing, and transmitting data in computer networks. It assigns a unique IP address to each device, ensuring proper information delivery. The IP protocol exists in versions IPv4 and IPv6."
      },
      "example": {
        "kk": "ІР мекенжайы құрылғылар арасындағы деректер жіберуді анықтайды.",
        "ru": "IP-адрес определяет отправку данных между устройствами.",
        "en": "IP address identifies the data transmission between devices."
      },
      "relations": {
        "synonyms": [
          "Интернет протоколы"
        ],
        "general_concept": "ІР деректерді жіберу және маршруттау үшін жауапты.",
        "specific_concepts": [
          "мекенжай",
          "деректер пакеттері"
        ],
        "associative": [
          "байланыс",
          "желілер"
        ]
      }
    },
    {
      "kk": "IP мекенжай",
      "ru": "IP-адрес",
      "en": "IP Address",
      "definition": {
        "kk": "IP мекенжайы – интернет желісіндегі немесе жергілікті желідегі құрылғының бірегей сандық идентификаторы. Ол желілік құрылғыларды анықтау және деректерді беруді қамтамасыз ету үшін қолданылады. IP мекенжайларының екі түрі бар: IPv4 (32 биттік) және IPv6 (128 биттік), бұл нұсқалардың әрқайсысы желі архитектурасына және маршруттау механизмдеріне әсер етеді.",
        "ru": "IP-адрес – уникальный числовой идентификатор устройства в интернет-сети или локальной сети. Он используется для определения сетевых устройств и обеспечения передачи данных. IP-адреса бывают двух типов: IPv4 (32-битный) и IPv6 (128-битный), каждая из этих версий влияет на архитектуру сети и механизмы маршрутизации.",
        "en": "IP address – a unique numerical identifier assigned to a device within an internet or local network. It is used to identify network devices and enable data transmission. IP addresses exist in two formats: IPv4 (32-bit) and IPv6 (128-bit), each impacting network architecture and routing mechanisms."
      },
      "example": {
        "kk": "IP мекенжайды пайдаланып, интернеттегі құрылғылар арасындағы байланыс орнатылады.",
        "ru": "С помощью IP-адреса устанавливается связь между устройствами в интернете.",
        "en": "An IP address is used to establish communication between devices on the internet."
      },
      "relations": {
        "synonyms": [
          "желілік адрес"
        ],
        "general_concept": "IP мекенжай деректер пакеттерін бағыттау үшін маңызды.",
        "specific_concepts": [
          "IPv4",
          "IPv6"
        ],
        "associative": [
          "желілік байланыс",
          "интернет"
        ]
      }
    },
    {
      "kk": "Домендік атау жүйесі",
      "ru": "Система доменных имён",
      "en": "DNS (Domain Name System)",
      "definition": {
        "kk": "Домендік атау жүйесі – интернеттегі құрылғылар мен серверлерді анықтау үшін оқылатын домендік атауларды сандық IP мекенжайларына түрлендіруді қамтамасыз ететін жүйе. Ол иерархиялық құрылымға негізделген және сұраныстарды өңдеу үшін атау серверлерін пайдаланады.",
        "ru": "Система доменных имён – система, обеспечивающая преобразование удобочитаемых доменных имен в числовые IP-адреса для идентификации устройств и серверов в интернете. Она основана на иерархической структуре и использует серверы имён для обработки запросов.",
        "en": "Domain Name System (DNS) – a system that translates human-readable domain names into numerical IP addresses to identify devices and servers on the internet. It is based on a hierarchical structure and utilizes name servers to process queries."
      },
      "example": {
        "kk": "DNS арқылы \"example.com\" доменін нақты IP мекенжайға бағыттауға болады.",
        "ru": "С помощью DNS можно направить домен \"example.com\" на конкретный IP-адрес.",
        "en": "DNS can direct the domain \"example.com\" to a specific IP address."
      },
      "relations": {
        "synonyms": [
          "домендік атаулар жүйесі"
        ],
        "general_concept": "DNS интернетте домендік атауларды пайдалану үшін қолайлы етеді.",
        "specific_concepts": [
          "домендер",
          "IP мекенжай"
        ],
        "associative": [
          "желілік бағыттау",
          "интернет ресурстар"
        ]
      }
    },
    {
      "kk": "Бірыңғай ресурс локаторы",
      "ru": "Единый указатель ресурса",
      "en": "Uniform Resource Locator (URL)",
      "definition": {
        "kk": "Бірыңғай ресурс локаторы - интернеттегі ресурстардың орналасуын анықтайтын стандартталған адрестеу жүйесі. Оған Хаттама, домендік атау, Жол және сұрау параметрлері кіреді. URL мекен-жайы веб-шолғыштарда, желілік қосымшаларда және деректер алмасу процестерінде кеңінен қолданылады.",
        "ru": "Единый указатель ресурса – стандартизированная система адресации, определяющая расположение ресурсов в интернете. Он включает протокол, доменное имя, путь и параметры запроса. URL широко используется в веб-браузерах, сетевых приложениях и процессах обмена данными.",
        "en": "Uniform Resource Locator (URL) – a standardized addressing system that defines the location of resources on the internet. It consists of a protocol, domain name, path, and query parameters. URLs are widely used in web browsers, network applications, and data exchange processes."
      },
      "example": {
        "kk": "https://example.com URL арқылы веб-сайтқа кіруге болады.",
        "ru": "С помощью URL https://example.com можно зайти на веб-сайт.",
        "en": "Using the URL https://example.com, you can access a website."
      },
      "relations": {
        "synonyms": [
          "веб мекенжай"
        ],
        "general_concept": "URL интернеттегі ресурсқа жылдам қолжетімділік ұсынады.",
        "specific_concepts": [
          "веб-сайт",
          "хостинг"
        ],
        "associative": [
          "ресурстар",
          "интернет"
        ]
      }
    },
    {
      "kk": "Гипермәтінді тасмалдау протоколы",
      "ru": "Протокол передачи гипертекста",
      "en": "Hypertext Transfer Protocol (HTTP)",
      "definition": {
        "kk": "Гипермәтінді тасмалдау протоколы – веб-шолғыштар мен серверлер арасындағы ақпарат алмасуды басқаратын желілік протокол. Ол гипермәтіндік деректерді сұрау, жіберу және қабылдау процесін реттейді. Қауіпсіздік пен шифрлауды қамтамасыз ету үшін HTTP HTTPS нұсқасымен жетілдірілген.",
        "ru": "Протокол передачи гипертекста – сетевой протокол, управляющий обменом информацией между веб-браузерами и серверами. Он регулирует процесс запроса, отправки и получения гипертекстовых данных. Для обеспечения безопасности и шифрования HTTP усовершенствован версией HTTPS.",
        "en": "Hypertext Transfer Protocol (HTTP) – a network protocol that manages information exchange between web browsers and servers. It regulates the process of requesting, sending, and receiving hypertext data. To ensure security and encryption, HTTP has been enhanced with the HTTPS version."
      },
      "example": {
        "kk": "HTTP веб-сервер мен браузер арасындағы байланыс орнатады.",
        "ru": "HTTP устанавливает связь между веб-сервером и браузером.",
        "en": "HTTP establishes communication between the web server and the browser."
      },
      "relations": {
        "synonyms": [
          "гипермәтіндік протокол"
        ],
        "general_concept": "HTTP веб-қызметтерді пайдалану үшін қажетті негіз болып табылады.",
        "specific_concepts": [
          "веб-сервер",
          "браузер"
        ],
        "associative": [
          "байланыс",
          "веб-сайттар"
        ]
      }
    },
    {
      "kk": "Дүниежүзілік желі (WWW)",
      "ru": "Всемирная паутина",
      "en": "WWW (World Wide Web)",
      "definition": {
        "kk": "Дүниежүзілік желі – интернеттегі гипермәтіндік ақпаратты сақтаудың, өңдеудің және таратудың ғаламдық жүйесі. Ол веб-шолғыштар арқылы қол жетімді веб-беттерді байланыстыратын гиперсілтемелерге негізделген. WWW маңызды протоколдары HTTP, HTTPS және HTML болып табылады.",
        "ru": "Всемирная паутина – глобальная система хранения, обработки и распространения гипертекстовой информации в интернете. Она основана на гиперссылках, соединяющих веб-страницы, доступные через веб-браузеры. Важными протоколами WWW являются HTTP, HTTPS и HTML.",
        "en": "World Wide Web (WWW) – a global system for storing, processing, and distributing hypertext information on the internet. It is based on hyperlinks connecting web pages accessible through web browsers. Key protocols of WWW include HTTP, HTTPS, and HTML."
      },
      "example": {
        "kk": "WWW арқылы веб-сайттарға қол жеткізуге болады.",
        "ru": "Через WWW можно получить доступ к веб-сайтам.",
        "en": "WWW provides access to websites."
      },
      "relations": {
        "synonyms": [
          "Интернет жүйесі",
          "Веб"
        ],
        "general_concept": "WWW пайдаланушыларға ақпаратты іздеу және пайдалану мүмкіндігін береді.",
        "specific_concepts": [
          "веб-сайт",
          "гипермәтін"
        ],
        "associative": [
          "ақпарат",
          "интернет"
        ]
      }
    }
  ],
  "Дәріс 10. Мультимедиа технологиялары және құралдары.": [
    {
      "kk": "Мультимедиа",
      "ru": "Мультимедиа",
      "en": "Multimedia",
      "definition": {
        "kk": "Мультимедиа – әртүрлі ақпараттық форматтарды (мәтін, графика, дыбыс, бейне, анимация) біріктіріп, интерактивті түрде қолдануға мүмкіндік беретін технологиялар мен жүйелер жиынтығы. Ол білім беру, ойын-сауық, жарнама және ақпараттық жүйелерде кеңінен қолданылады.",
        "ru": "Мультимедиа – совокупность технологий и систем, позволяющих комбинировать и интерактивно использовать различные информационные форматы (текст, графика, звук, видео, анимация). Оно широко применяется в образовании, индустрии развлечений, рекламе и информационных системах.",
        "en": "Multimedia – a collection of technologies and systems that enable the integration and interactive use of various information formats (text, graphics, sound, video, animation). It is widely used in education, entertainment, advertising, and information systems."
      },
      "example": {
        "kk": "Мультимедиа презентациялар оқыту процесінде кеңінен қолданылады.",
        "ru": "Мультимедиа-презентации широко используются в образовательном процессе.",
        "en": "Multimedia presentations are widely used in educational processes."
      },
      "relations": {
        "synonyms": [
          "Кешенді медиа",
          "Біріктірілген ақпараттық жүйелер"
        ],
        "general_concept": "Мультимедиа ақпараттың түрлі формаларын біріктіру арқылы интерактивті пайдалануды қамтамасыз етеді.",
        "specific_concepts": [
          "гипермедиа",
          "виртуалды шындық",
          "интерактивті интерфейс"
        ],
        "associative": [
          "ақпарат",
          "визуализация",
          "дыбыстық өңдеу"
        ]
      }
    },
    {
      "kk": "Мультимедиа технологиялары",
      "ru": "Мультимедиа технологии",
      "en": "Multimedia technologies",
      "definition": {
        "kk": "Мультимедиа технологиялары – әртүрлі ақпарат түрлерін (мәтін, графика, дыбыс, бейне, анимация) біріктіруге және интерактивті пайдалануға мүмкіндік беретін цифрлық технологиялар жиынтығы. Олар білім беру, ойын-сауық, жарнама және ақпараттық жүйелерде кеңінен қолданылады.",
        "ru": "Мультимедиа технологии – совокупность цифровых технологий, позволяющих комбинировать и интерактивно использовать различные виды информации (текст, графика, звук, видео, анимация). Они широко применяются в образовании, индустрии развлечений, рекламе и информационных системах.",
        "en": "Multimedia technologies – a set of digital technologies that enable the integration and interactive use of various types of information (text, graphics, sound, video, animation). They are widely used in education, entertainment, advertising, and information systems."
      },
      "example": {
        "kk": "Мультимедиа технологиялары сандық білім беру платформаларында қолданылады.",
        "ru": "Мультимедиа технологии используются в цифровых образовательных платформах.",
        "en": "Multimedia technologies are used in digital educational platforms."
      },
      "relations": {
        "synonyms": [
          "Мультимедиалық жүйелер",
          "Цифрлық медиа"
        ],
        "general_concept": "Мультимедиа технологиялары ақпараттың түрлі формаларын біріктіру арқылы интерактивті пайдалануды қамтамасыз етеді.",
        "specific_concepts": [
          "гипермедиа",
          "виртуалды шындық"
        ],
        "associative": [
          "ақпарат",
          "интерактивтілік",
          "визуализация"
        ]
      }
    },
    {
      "kk": "Иллюстрация",
      "ru": "Иллюстрация",
      "en": "Illustration",
      "definition": {
        "kk": "Иллюстрация – мәтіндік немесе көркем материалға қосымша ретінде қолданылатын визуалды бейне, ол ақпаратты түсіндіру, көрнекілендіру және толықтыру мақсатында пайдаланылады. Ол графика, сурет, диаграмма немесе фотосурет түрінде болуы мүмкін.",
        "ru": "Иллюстрация – визуальное изображение, используемое как дополнение к текстовому или художественному материалу для пояснения, визуализации и усиления информации. Она может быть представлена в виде графики, рисунка, диаграммы или фотографии.",
        "en": "Illustration – a visual representation used as a supplement to textual or artistic material to explain, visualize, or enhance information. It can take the form of graphics, drawings, diagrams, or photographs."
      },
      "example": {
        "kk": "Оқулықтағы иллюстрациялар түсіндіруді жеңілдетеді.",
        "ru": "Иллюстрации в учебнике помогают упростить объяснение.",
        "en": "Illustrations in a textbook help simplify explanations."
      },
      "relations": {
        "synonyms": [
          "кескін",
          "сурет",
          "визуалды материал"
        ],
        "general_concept": "Иллюстрация ақпаратты түсінуді жеңілдету және оны көрнекі ету үшін қолданылады.",
        "specific_concepts": [
          "графика",
          "диаграмма",
          "сурет өнері"
        ],
        "associative": [
          "ақпарат",
          "визуализация",
          "дизайн"
        ]
      }
    },
    {
      "kk": "Гипермедиа",
      "ru": "Гипермедиа",
      "en": "Hypermedia",
      "definition": {
        "kk": "Гипермедиа – мультимедиялық контенттің құрылымдалған және өзара байланысқан формасы, онда мәтін, графика, бейне, дыбыс және анимация интерактивті түрде беріледі.",
        "ru": "Гипермедиа – структурированная и взаимосвязанная форма мультимедийного контента, включающая текст, графику, видео, звук и анимацию в интерактивном формате.",
        "en": "Hypermedia – a structured and interconnected form of multimedia content, incorporating text, graphics, video, sound, and animation interactively."
      },
      "example": {
        "kk": "Гипермедиа білім беру жүйелерінде қолданылады.",
        "ru": "Гипермедиа используется в образовательных системах.",
        "en": "Hypermedia is used in educational systems."
      },
      "relations": {
        "synonyms": [
          "Интерактивті мультимедиа"
        ],
        "general_concept": "Гипермедиа ақпаратты күрделі құрылымда ұсыну арқылы интерактивтілікті қамтамасыз етеді.",
        "specific_concepts": [
          "веб-дизайн",
          "сандық оқыту"
        ],
        "associative": [
          "ақпарат",
          "интерактивтілік"
        ]
      }
    },
    {
      "kk": "Сандық графика",
      "ru": "Цифровая графика",
      "en": "Digital Graphics",
      "definition": {
        "kk": "Сандық графика – кескіндерді цифрлық форматта өңдеу және визуалды ақпаратты модельдеу әдістері.",
        "ru": "Цифровая графика – методы обработки изображений в цифровом формате и моделирования визуальной информации.",
        "en": "Digital Graphics – methods for processing images in digital format and modeling visual information."
      },
      "example": {
        "kk": "Сандық графика жарнамада жиі қолданылады.",
        "ru": "Цифровая графика часто используется в рекламе.",
        "en": "Digital graphics are frequently used in advertising."
      },
      "relations": {
        "synonyms": [
          "Компьютерлік графика"
        ],
        "general_concept": "Сандық графика визуалды мазмұнды жасау мен өңдеуге мүмкіндік береді.",
        "specific_concepts": [
          "растерлік графика",
          "векторлық графика"
        ],
        "associative": [
          "дизайн",
          "визуализация"
        ]
      }
    },
    {
      "kk": "Аудиовизуалды жүйелер",
      "ru": "Аудиовизуальные системы",
      "en": "Audiovisual Systems",
      "definition": {
        "kk": "Аудиовизуалды жүйелер – дыбыстық және визуалды ақпаратты біріктіруге арналған аппараттық және бағдарламалық кешендер.",
        "ru": "Аудиовизуальные системы – аппаратно-программные комплексы, предназначенные для объединения звуковой и визуальной информации.",
        "en": "Audiovisual Systems – hardware and software complexes designed to integrate sound and visual information."
      },
      "example": {
        "kk": "Аудиовизуалды жүйелер кинематографияда қолданылады.",
        "ru": "Аудиовизуальные системы применяются в кинематографе.",
        "en": "Audiovisual systems are used in cinematography."
      },
      "relations": {
        "synonyms": [
          "Көпмедиалық жүйелер"
        ],
        "general_concept": "Аудиовизуалды жүйелер интерактивті мультимедиа тәжірибесін ұсынады.",
        "specific_concepts": [
          "дыбыстық өңдеу",
          "видео монтаж"
        ],
        "associative": [
          "дыбыс",
          "бейнелеу"
        ]
      }
    },
    {
      "kk": "Виртуалды шындық",
      "ru": "Виртуальная реальность",
      "en": "Virtual Reality",
      "definition": {
        "kk": "Виртуалды шындық – қолданушыларды интерактивті цифрлық ортаға енгізетін технология.",
        "ru": "Виртуальная реальность – технология, погружающая пользователей в интерактивную цифровую среду.",
        "en": "Virtual Reality – technology that immerses users in an interactive digital environment."
      },
      "example": {
        "kk": "Виртуалды шындық ойын индустриясында қолданылады.",
        "ru": "Виртуальная реальность применяется в игровой индустрии.",
        "en": "Virtual reality is used in the gaming industry."
      },
      "relations": {
        "synonyms": [
          "VR"
        ],
        "general_concept": "Виртуалды шындық пайдаланушының цифрлық ортамен әрекеттесуін қамтамасыз етеді.",
        "specific_concepts": [
          "AR",
          "3D модельдеу"
        ],
        "associative": [
          "иммерсия",
          "цифрлық орта"
        ]
      }
    },
    {
      "kk": "Бейнені өңдеу",
      "ru": "Редактирование видео",
      "en": "Video Editing",
      "definition": {
        "kk": "Бейнені өңдеу – бейнежазбаларды монтаждау, өңдеу және визуалды эффекттерді қосу процесі.",
        "ru": "Редактирование видео – процесс монтажа, обработки и добавления визуальных эффектов в видеозаписях.",
        "en": "Video Editing – the process of assembling, processing, and adding visual effects to video recordings."
      },
      "example": {
        "kk": "Бейнені өңдеу кәсіби кинематографияда маңызды рөл атқарады.",
        "ru": "Редактирование видео играет важную роль в профессиональной кинематографии.",
        "en": "Video editing plays a crucial role in professional cinematography."
      },
      "relations": {
        "synonyms": [
          "Бейне монтаж"
        ],
        "general_concept": "Бейнені өңдеу бейне мазмұнды жетілдіру және түрлендіру үшін қолданылады.",
        "specific_concepts": [
          "түстерді түзету",
          "визуалды эффекттер"
        ],
        "associative": [
          "бейне",
          "өндеу"
        ]
      }
    }
  ],
  "Дәріс 11. Ақпараттық қауіпсіздік": [
    {
      "kk": "Ақпараттық қауіпсіздік",
      "ru": "Информационная безопасность",
      "en": "Information Security",
      "definition": {
        "kk": "Ақпараттық қауіпсіздік – деректерді рұқсатсыз қолжетімділіктен, бұрмалаудан немесе жойылудан қорғау процесі. Ол криптография, аутентификация, желілік қауіпсіздік және кибершабуылдарды алдын алу шараларын қамтиды.",
        "ru": "Информационная безопасность – процесс защиты данных от несанкционированного доступа, искажения или уничтожения. Он включает криптографию, аутентификацию, сетевую безопасность и меры предотвращения кибератак.",
        "en": "Information Security – the process of protecting data from unauthorized access, alteration, or destruction. It includes cryptography, authentication, network security, and measures to prevent cyberattacks."
      },
      "example": {
        "kk": "Ақпараттық қауіпсіздік желілердегі деректердің тұтастығын қамтамасыз етеді.",
        "ru": "Информационная безопасность обеспечивает целостность данных в сетях.",
        "en": "Information security ensures data integrity in networks."
      },
      "relations": {
        "synonyms": [
          "Киберқауіпсіздік",
          "Деректерді қорғау"
        ],
        "general_concept": "Ақпараттық қауіпсіздік цифрлық экожүйенің сенімділігін қамтамасыз етеді.",
        "specific_concepts": [
          "шифрлау",
          "аутентификация",
          "кіруді басқару"
        ],
        "associative": [
          "желі",
          "қорғаныс",
          "хакерлік"
        ]
      }
    },
    {
      "kk": "Криптография",
      "ru": "Криптография",
      "en": "Cryptography",
      "definition": {
        "kk": "Криптография – ақпаратты рұқсатсыз қолжетімділіктен қорғау және оны қауіпсіз түрде тасымалдау үшін математикалық әдістерді қолданатын ғылым. Ол шифрлау, қолтаңба түзу, аутентификация және деректерді бұрмалауға қарсы тұру механизмдерін қамтиды.",
        "ru": "Криптография – наука, использующая математические методы для защиты информации от несанкционированного доступа и безопасной передачи данных. Она включает шифрование, создание цифровых подписей, аутентификацию и механизмы противодействия подделке данных.",
        "en": "Cryptography – a science that uses mathematical methods to protect information from unauthorized access and ensure secure data transmission. It includes encryption, digital signatures, authentication, and mechanisms to prevent data forgery."
      },
      "example": {
        "kk": "Криптография онлайн транзакцияларды қорғау үшін қолданылады.",
        "ru": "Криптография используется для защиты онлайн-транзакций.",
        "en": "Cryptography is used to protect online transactions."
      },
      "relations": {
        "synonyms": [
          "шифрлау",
          "ақпараттық қауіпсіздік"
        ],
        "general_concept": "Криптография деректердің құпиялылығын, тұтастығын және аутентификациясын қамтамасыз етеді.",
        "specific_concepts": [
          "симметриялық шифрлау",
          "асимметриялық шифрлау",
          "хэш-функциялар"
        ],
        "associative": [
          "қауіпсіздік",
          "математика",
          "алгоритмдер"
        ]
      }
    },
    {
      "kk": "Ақпаратты шифрлеу",
      "ru": "Шифрование данных",
      "en": "Data Encryption",
      "definition": {
        "kk": "Ақпаратты шифрлеу – деректерді рұқсатсыз қолжетімділіктен қорғау мақсатында математикалық алгоритмдерді қолдану арқылы ақпаратты түрлендіру процесі. Ол құпиялылықты, тұтастықты және аутентификацияны қамтамасыз етеді.",
        "ru": "Шифрование данных – процесс преобразования информации с использованием математических алгоритмов для защиты данных от несанкционированного доступа. Оно обеспечивает конфиденциальность, целостность и аутентификацию.",
        "en": "Data encryption – the process of transforming information using mathematical algorithms to protect data from unauthorized access. It ensures confidentiality, integrity, and authentication."
      },
      "example": {
        "kk": "Банк операцияларында ақпаратты шифрлеу қолданылады.",
        "ru": "Шифрование данных используется в банковских операциях.",
        "en": "Data encryption is used in banking transactions."
      },
      "relations": {
        "synonyms": [
          "Шифрлау",
          "Криптографиялық қорғау"
        ],
        "general_concept": "Ақпаратты шифрлеу деректерді қауіпсіз тасымалдау және сақтау үшін қолданылады.",
        "specific_concepts": [
          "симметриялық шифрлеу",
          "асимметриялық шифрлеу",
          "қоғамдық және жеке кілт"
        ],
        "associative": [
          "құпиялылық",
          "қауіпсіздік",
          "кодтау"
        ]
      }
    },
    {
      "kk": "Шифрлеу",
      "ru": "Шифрование",
      "en": "Encryption",
      "definition": {
        "kk": "Шифрлеу – ақпаратты рұқсатсыз қолжетімділіктен қорғау үшін оны арнайы математикалық алгоритмдермен түрлендіру процесі. Ол деректердің құпиялылығын, тұтастығын және аутентификациясын қамтамасыз етеді.",
        "ru": "Шифрование – процесс преобразования данных с помощью специальных математических алгоритмов для защиты от несанкционированного доступа. Оно обеспечивает конфиденциальность, целостность и аутентификацию информации.",
        "en": "Encryption – the process of transforming data using specialized mathematical algorithms to protect it from unauthorized access. It ensures confidentiality, integrity, and authentication of information."
      },
      "example": {
        "kk": "Шифрлеу арқылы маңызды деректерді қауіпсіз сақтауға болады.",
        "ru": "С помощью шифрования можно безопасно хранить важные данные.",
        "en": "Encryption allows secure storage of important data."
      },
      "relations": {
        "synonyms": [
          "Деректерді шифрлеу",
          "Криптографиялық кодтау"
        ],
        "general_concept": "Шифрлеу ақпараттық қауіпсіздікті қамтамасыз ету үшін қолданылады.",
        "specific_concepts": [
          "симметриялық шифрлеу",
          "асимметриялық шифрлеу",
          "қоғамдық және жеке кілт"
        ],
        "associative": [
          "құпиялылық",
          "қауіпсіздік",
          "алгоритм"
        ]
      }
    },
    {
      "kk": "Кодтау",
      "ru": "Кодирование",
      "en": "Encoding",
      "definition": {
        "kk": "Кодтау – ақпаратты белгілі бір форматқа түрлендіру процесі, оны сақтау, өңдеу немесе тасымалдау үшін оңтайландыру мақсатында қолданылады. Ол деректердің құрылымын өзгертіп, сандық жүйелерде тиімді қолдануға мүмкіндік береді.",
        "ru": "Кодирование – процесс преобразования информации в определённый формат для её оптимального хранения, обработки или передачи. Оно изменяет структуру данных, обеспечивая их эффективное использование в цифровых системах.",
        "en": "Encoding – the process of transforming information into a specific format to optimize its storage, processing, or transmission. It modifies data structure, enabling efficient use in digital systems."
      },
      "example": {
        "kk": "Кодтау арқылы мәтіндерді цифрлық форматқа айналдыруға болады.",
        "ru": "С помощью кодирования можно преобразовывать тексты в цифровой формат.",
        "en": "Encoding allows texts to be converted into a digital format."
      },
      "relations": {
        "synonyms": [
          "Ақпаратты кодтау",
          "Мәліметтерді түрлендіру"
        ],
        "general_concept": "Кодтау деректерді тиімді сақтау және өңдеу үшін қолданылады.",
        "specific_concepts": [
          "UTF-8",
          "ASCII",
          "Base64"
        ],
        "associative": [
          "ақпарат",
          "алгоритм",
          "цифрлық жүйе"
        ]
      }
    },
    {
      "kk": "Декодтау",
      "ru": "Декодирование",
      "en": "Decoding",
      "definition": {
        "kk": "Декодтау – кодталған ақпаратты бастапқы түріне қайта түрлендіру процесі, ол деректерді түсіну, өңдеу немесе жіберу үшін қолданылады. Бұл процесс кодтау алгоритмдері мен стандарттарына негізделеді.",
        "ru": "Декодирование – процесс преобразования закодированной информации обратно в её исходную форму, используемый для понимания, обработки или передачи данных. Этот процесс основан на алгоритмах кодирования и стандартах.",
        "en": "Decoding – the process of converting encoded information back into its original form, used for understanding, processing, or transmitting data. This process relies on encoding algorithms and standards."
      },
      "example": {
        "kk": "Қабылдаушы құрылғы аудиофайлды декодтау арқылы ойнатады.",
        "ru": "Приёмное устройство воспроизводит аудиофайл путём его декодирования.",
        "en": "A receiving device plays an audio file by decoding it."
      },
      "relations": {
        "synonyms": [
          "Ақпаратты декодтау",
          "Кері кодтау"
        ],
        "general_concept": "Декодтау ақпараттың бастапқы мазмұнын қалпына келтіру үшін қолданылады.",
        "specific_concepts": [
          "ASCII декодтау",
          "Видео декодтау",
          "Мәтіндік декодтау"
        ],
        "associative": [
          "кодтау",
          "ақпарат",
          "алгоритм"
        ]
      }
    },
    {
      "kk": "Симметриялық шифрлау",
      "ru": "Симметричное шифрование",
      "en": "Symmetric Encryption",
      "definition": {
        "kk": "Симметриялық шифрлау – бірдей құпия кілтті қолдану арқылы деректерді шифрлау және дешифрлау процесі. Бұл әдіс жоғары жылдамдық пен есептеу тиімділігімен ерекшеленеді.",
        "ru": "Симметричное шифрование – процесс кодирования и декодирования данных с использованием одного и того же секретного ключа. Этот метод отличается высокой скоростью и вычислительной эффективностью.",
        "en": "Symmetric encryption – the process of encrypting and decrypting data using the same secret key. This method is characterized by high speed and computational efficiency."
      },
      "example": {
        "kk": "Симметриялық шифрлау қаржы жүйелерінде деректерді қорғау үшін қолданылады.",
        "ru": "Симметричное шифрование используется для защиты данных в финансовых системах.",
        "en": "Symmetric encryption is used to protect data in financial systems."
      },
      "relations": {
        "synonyms": [
          "Бір кілтті шифрлау",
          "Жабық кілтті шифрлау"
        ],
        "general_concept": "Симметриялық шифрлау ақпараттық қауіпсіздікті қамтамасыз ету үшін қолданылады.",
        "specific_concepts": [
          "AES",
          "DES",
          "Blowfish"
        ],
        "associative": [
          "қауіпсіздік",
          "деректерді қорғау",
          "кілттерді басқару"
        ]
      }
    },
    {
      "kk": "Асимметриялық шифрлау",
      "ru": "Асимметричное шифрование",
      "en": "Asymmetric Encryption",
      "definition": {
        "kk": "Асимметриялық шифрлау – ашық және жеке кілттерді қолдану арқылы деректерді шифрлау және дешифрлау процесі. Ашық кілт ақпаратты шифрлау үшін, ал жеке кілт оны дешифрлау үшін пайдаланылады. Бұл әдіс жоғары қауіпсіздікті қамтамасыз етеді және сандық қолтаңба мен аутентификацияда кеңінен қолданылады.",
        "ru": "Асимметричное шифрование – процесс кодирования и декодирования данных с использованием открытого и закрытого ключей. Открытый ключ применяется для шифрования, а закрытый – для расшифровки. Этот метод обеспечивает высокий уровень безопасности и широко используется в цифровых подписях и аутентификации.",
        "en": "Asymmetric encryption – a process of encrypting and decrypting data using public and private keys. The public key is used for encryption, while the private key is used for decryption. This method provides high security and is widely used in digital signatures and authentication."
      },
      "example": {
        "kk": "Асимметриялық шифрлау электрондық қолтаңбада қолданылады.",
        "ru": "Асимметричное шифрование используется в электронной подписи.",
        "en": "Asymmetric encryption is used in digital signatures."
      },
      "relations": {
        "synonyms": [
          "Қоғамдық кілтті криптография"
        ],
        "general_concept": "Асимметриялық шифрлау ақпараттық қауіпсіздікті қамтамасыз ету үшін қолданылады.",
        "specific_concepts": [
          "RSA",
          "ECC",
          "Diffie-Hellman"
        ],
        "associative": [
          "құпиялылық",
          "аутентификация",
          "кілттерді басқару"
        ]
      }
    },
    {
      "kk": "Криптоталдау",
      "ru": "Криптоанализ",
      "en": "Cryptanalysis",
      "definition": {
        "kk": "Криптоталдау – шифрланған ақпаратты бастапқы күйіне қайтару немесе шифрлау алгоритмінің әлсіз тұстарын анықтау әдістерін зерттейтін ғылым. Ол криптографиялық жүйелердің беріктігін сынау және олардың сенімділігін бағалау үшін қолданылады.",
        "ru": "Криптоанализ – наука, изучающая методы восстановления зашифрованной информации или выявления уязвимостей в алгоритмах шифрования. Он используется для тестирования стойкости криптографических систем и оценки их надежности.",
        "en": "Cryptanalysis – a science that studies methods for recovering encrypted information or identifying weaknesses in encryption algorithms. It is used to test the strength of cryptographic systems and assess their reliability."
      },
      "example": {
        "kk": "Криптоталдау әдістері шифрлау жүйесінің қауіпсіздігін тексеру үшін қолданылады.",
        "ru": "Методы криптоанализа применяются для проверки безопасности шифрования.",
        "en": "Cryptanalysis methods are used to test the security of encryption systems."
      },
      "relations": {
        "synonyms": [
          "Шифрды бұзу",
          "Криптографиялық талдау"
        ],
        "general_concept": "Криптоталдау криптографиялық жүйелердің әлсіздігін анықтау арқылы олардың сенімділігін арттыруға ықпал етеді.",
        "specific_concepts": [
          "Шифрды ашу",
          "Статистикалық талдау",
          "Дифференциалдық криптоанализ"
        ],
        "associative": [
          "қауіпсіздік",
          "шифрлау",
          "математика"
        ]
      }
    }
  ]
}